zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/* ===========================  Configuration of the ARM Cortex-A Processor and Core Peripherals  ============================ */
#define __CORTEX_A                    7U      /*!< Cortex-A# Core                              */
#define __CA_REV                 0x0005U      /*!< Core revision r0p0                          */
#define __FPU_PRESENT                 1U      /*!< Set to 1 if FPU is present                  */
#define __GIC_PRESENT                 1U      /*!< Set to 1 if GIC is present                  */
#define __TIM_PRESENT                 1U      /*!< Set to 1 if TIM is present                  */
#define __L2C_PRESENT                 0U      /*!< Set to 1 if L2C is present (only for A9)    */

#define GIC_BASE             0xA0021000
#define GIC_DISTRIBUTOR_BASE GIC_BASE
#define GIC_INTERFACE_BASE   (GIC_BASE+0x1000)

#include "core_ca.h"
#include "system_stm32mp13xx_A7.h"


/**
  * @}
  */

#include <stdint.h>

/** @addtogroup Peripheral_registers_structures
  * @{
  */


/*
 * @brief DCMIPP Camera Interface (DCMIPP)
 */
typedef struct
{
  __IO uint32_t IPGR1;            /*!< DCMIPP IPPLUG Global register 1                               Address offset: 0x000 */
  __IO uint32_t IPGR2;            /*!< DCMIPP IPPLUG Global register 2                               Address offset: 0x004 */
  __IO uint32_t IPGR3;            /*!< DCMIPP IPPLUG Global register 3                               Address offset: 0x008 */
       uint32_t RESERVED0[4];     /*!< Reserved                                                      Address offset: 0x00C-0x018 */
  __IO uint32_t IPGR8;            /*!< DCMIPP IPPLUG Identification register                         Address offset: 0x01C */
  __IO uint32_t IPC1R1;           /*!< DCMIPP IPPLUG Client 1 register 1                             Address offset: 0x020 */
  __IO uint32_t IPC1R2;           /*!< DCMIPP IPPLUG Client 1 register 2                             Address offset: 0x024 */
  __IO uint32_t IPC1R3;           /*!< DCMIPP IPPLUG Client 1 register 3                             Address offset: 0x028 */
       uint32_t RESERVED1[53];    /*!< Reserved                                                      Address offset: 0x02C-0x0FC */
  __IO uint32_t PRHWCFGR;         /*!< Parallel Interface HW Configuration register                  Address offset: 0x100 */
  __IO uint32_t PRCR;             /*!< Parallel Interface control register                           Address offset: 0x104 */
  __IO uint32_t PRESCR;           /*!< Parallel Interface Embedded Sync code register                Address offset: 0x108 */
  __IO uint32_t PRESUR;           /*!< Parallel Interface Embedded Sync Unmsk register               Address offset: 0x10C */
       uint32_t RESERVED2[57];    /*!< Reserved                                                      Address offset: 0x110-0x1F0 */
  __IO uint32_t PRIER;            /*!< Parallel Interface Interrupt enable register                  Address offset: 0x1F4 */
  __IO uint32_t PRSR;             /*!< Parallel Interface status register                            Address offset: 0x1F8 */
  __IO uint32_t PRFCR;            /*!< Parallel Interface Interrupt clear register                   Address offset: 0x1FC */
  __IO uint32_t CMHWCFGR;         /*!< Common IP HW Configuration register                           Address offset: 0x200 */
  __IO uint32_t CMCR;             /*!< Common Configuration register                                 Address offset: 0x204 */
  __IO uint32_t CMFRCR;           /*!< Common frame counter register                                 Address offset: 0x208 */
       uint32_t RESERVED3[121];   /*!< Reserved                                                      Address offset: 0x20C-0x3EC */
  __IO uint32_t CMIER;            /*!< Common Interrupt enable register                              Address offset: 0x3F0 */
  __IO uint32_t CMSR1;            /*!< Common status register 1                                      Address offset: 0x3F4 */
  __IO uint32_t CMSR2;            /*!< Common status register 2                                      Address offset: 0x3F8 */
  __IO uint32_t CMFCR;            /*!< Common Interrupt clear register                               Address offset: 0x3FC */
  __IO uint32_t P0HWCFGR;         /*!< Pipe0 HW Configuration register                               Address offset: 0x400 */
  __IO uint32_t P0FSCR;           /*!< Pipe0 Flow Selection configuration register                   Address offset: 0x404 */
       uint32_t RESERVED4[62];    /*!< Reserved                                                      Address offset: 0x408-0x4FC */
  __IO uint32_t P0FCTCR;          /*!< Pipe0 Flow Control configuration register                     Address offset: 0x500 */
  __IO uint32_t P0SCSTR;          /*!< Pipe0 Stat/Crop Start register                                Address offset: 0x504 */
  __IO uint32_t P0SCSZR;          /*!< Pipe0 Stat/Crop Size register                                 Address offset: 0x508 */
       uint32_t RESERVED5[41];    /*!< Reserved                                                      Address offset: 0x50C-0x5AC */
  __IO uint32_t P0DCCNTR;         /*!< Pipe0 Dump counter register                                   Address offset: 0x5B0 */
  __IO uint32_t P0DCLMTR;         /*!< Pipe0 Dump limit register                                     Address offset: 0x5B4 */
       uint32_t RESERVED6[2];     /*!< Reserved                                                      Address offset: 0x5B8-0x5BC */
  __IO uint32_t P0PPCR;           /*!< Pipe0 Pixel Packer configuration register                     Address offset: 0x5C0 */
  __IO uint32_t P0PPM0AR1;        /*!< Pipe0 Pixel Packer memory0 address register 1                 Address offset: 0x5C4 */
  __IO uint32_t P0PPM0AR2;        /*!< Pipe0 Pixel Packer memory0 address register 2                 Address offset: 0x5C8 */
       uint32_t RESERVED7[10];    /*!< Reserved                                                      Address offset: 0x5CC-0x5F0 */
  __IO uint32_t P0IER;            /*!< Pipe0 Interrupt enable register                               Address offset: 0x5F4 */
  __IO uint32_t P0SR;             /*!< Pipe0 status register                                         Address offset: 0x5F8 */
  __IO uint32_t P0FCR;            /*!< Pipe0 Interrupt clear register                                Address offset: 0x5FC */
       uint32_t RESERVED8[64];    /*!< Reserved                                                      Address offset: 0x600-0x6FC */
  __IO uint32_t P0CFCTCR;         /*!< Pipe0 Current Flow Control configuration register             Address offset: 0x700 */
  __IO uint32_t P0CSCSTR;         /*!< Pipe0 Current Stat/Crop Start register                        Address offset: 0x704 */
  __IO uint32_t P0CSCSZR;         /*!< Pipe0 Current Stat/Crop Size register                         Address offset: 0x708 */
       uint32_t RESERVED9[45];    /*!< Reserved                                                      Address offset: 0x70C-0x7BC */
  __IO uint32_t P0CPPCR;          /*!< Pipe0 Current Pixel Packer configuration register             Address offset: 0x7C0 */
  __IO uint32_t P0CPPM0AR1;       /*!< Pipe0 Current Pixel Packer memory0 address register 1         Address offset: 0x7C4 */
  __IO uint32_t P0CPPM0AR2;       /*!< Pipe0 Current Pixel Packer Current memory0 address register 2 Address offset: 0x7C8 */
       uint32_t RESERVED10[521];  /*!< Reserved                                                      Address offset: 0x7CC-0xFEC */
  __IO uint32_t HWCFGR;           /*!< IP HW Configuration register                                  Address offset: 0xFF0 */
  __IO uint32_t VERR;             /*!< IP Version register                                           Address offset: 0xFF4 */
  __IO uint32_t IPIDR;            /*!< IP Identification register                                    Address offset: 0xFF8 */
  __IO uint32_t SIDR;             /*!< Size Identification register                                  Address offset: 0xFFC */
} DCMIPP_TypeDef;

/******************************************************************************/
/*                                                                            */
/*                      DCMIPP Camera Interface (DCMIPP)                      */
/*                                                                            */
/******************************************************************************/

#define DCMIPP_NUM_OF_PIPES               (0x1U)
/*****************  Bit definition for DCMIPP_IPGR1 register  *****************/
#define DCMIPP_IPGR1_MEMORYPAGE_Pos       (0U)
#define DCMIPP_IPGR1_MEMORYPAGE_Msk       (0x7UL << DCMIPP_IPGR1_MEMORYPAGE_Pos)         /*!< 0x00000007 */
#define DCMIPP_IPGR1_MEMORYPAGE           DCMIPP_IPGR1_MEMORYPAGE_Msk                   /*!< memory page size, as power2 of 64Bytes units: */
#define DCMIPP_IPGR1_MEMORYPAGE_0         (0x1UL << DCMIPP_IPGR1_MEMORYPAGE_Pos)         /*!< 0x00000001 */
#define DCMIPP_IPGR1_MEMORYPAGE_1         (0x2UL << DCMIPP_IPGR1_MEMORYPAGE_Pos)         /*!< 0x00000002 */
#define DCMIPP_IPGR1_MEMORYPAGE_2         (0x4UL << DCMIPP_IPGR1_MEMORYPAGE_Pos)         /*!< 0x00000004 */

