zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/*****************  Bit definition for DCMIPP_PRSR register  ******************/
#define DCMIPP_PRSR_ERRF_Pos              (6U)
#define DCMIPP_PRSR_ERRF_Msk              (0x1UL << DCMIPP_PRSR_ERRF_Pos)                /*!< 0x00000040 */
#define DCMIPP_PRSR_ERRF                  DCMIPP_PRSR_ERRF_Msk                          /*!< Synchronization error raw interrupt status */
#define DCMIPP_PRSR_HSYNC_Pos             (16U)
#define DCMIPP_PRSR_HSYNC_Msk             (0x1UL << DCMIPP_PRSR_HSYNC_Pos)               /*!< 0x00010000 */
#define DCMIPP_PRSR_HSYNC                 DCMIPP_PRSR_HSYNC_Msk                         /*!< This bit gives the state of the HSYNC pin with the correct programmed polarity if the ENABLE bit is set into the DCMIPP_PRCR register and if the pixel clock is received. It is set during the blanking period whatever the polarity selected in HPOL bit, and cleared otherwise. */
#define DCMIPP_PRSR_VSYNC_Pos             (17U)
#define DCMIPP_PRSR_VSYNC_Msk             (0x1UL << DCMIPP_PRSR_VSYNC_Pos)               /*!< 0x00020000 */
#define DCMIPP_PRSR_VSYNC                 DCMIPP_PRSR_VSYNC_Msk                         /*!< This bit gives the state of the VSYNC pin with the correct programmed polarity if the ENABLE bit is set into the DCMIPP_PRCR register and if the pixel clock is received. It is set during the blanking period whatever the polarity selected in VPOL bit, and cleared otherwise. */

/*****************  Bit definition for DCMIPP_PRFCR register  *****************/
#define DCMIPP_PRFCR_CERRF_Pos            (6U)
#define DCMIPP_PRFCR_CERRF_Msk            (0x1UL << DCMIPP_PRFCR_CERRF_Pos)              /*!< 0x00000040 */
#define DCMIPP_PRFCR_CERRF                DCMIPP_PRFCR_CERRF_Msk                        /*!< Synchronization error interrupt status clear */

/***************  Bit definition for DCMIPP_CMHWCFGR register  ****************/
#define DCMIPP_CMHWCFGR_CPIPES_Pos        (2U)
#define DCMIPP_CMHWCFGR_CPIPES_Msk        (0x3UL << DCMIPP_CMHWCFGR_CPIPES_Pos)          /*!< 0x0000000C */
#define DCMIPP_CMHWCFGR_CPIPES            DCMIPP_CMHWCFGR_CPIPES_Msk                    /*!< (1..3) Amount of instantiated Pipes (either Dump Pipes or Pixel Pipes) */
#define DCMIPP_CMHWCFGR_CPIPES_0          (0x1UL << DCMIPP_CMHWCFGR_CPIPES_Pos)          /*!< 0x00000004 */
#define DCMIPP_CMHWCFGR_CPIPES_1          (0x2UL << DCMIPP_CMHWCFGR_CPIPES_Pos)          /*!< 0x00000008 */
#define DCMIPP_CMHWCFGR_CPAR_Pos          (4U)
#define DCMIPP_CMHWCFGR_CPAR_Msk          (0x1UL << DCMIPP_CMHWCFGR_CPAR_Pos)            /*!< 0x00000010 */
#define DCMIPP_CMHWCFGR_CPAR              DCMIPP_CMHWCFGR_CPAR_Msk                      /*!< Presence of the Parallel Interface: */
#define DCMIPP_CMHWCFGR_CCSI_Pos          (5U)
#define DCMIPP_CMHWCFGR_CCSI_Msk          (0x1UL << DCMIPP_CMHWCFGR_CCSI_Pos)            /*!< 0x00000020 */
#define DCMIPP_CMHWCFGR_CCSI              DCMIPP_CMHWCFGR_CCSI_Msk                      /*!< presence of the CSI-2 Host interface: */

/*****************  Bit definition for DCMIPP_CMCR register  ******************/
#define DCMIPP_CMCR_CFC_Pos               (4U)
#define DCMIPP_CMCR_CFC_Msk               (0x1UL << DCMIPP_CMCR_CFC_Pos)                 /*!< 0x00000010 */
#define DCMIPP_CMCR_CFC                   DCMIPP_CMCR_CFC_Msk                           /*!< Clear frame counter */

/****************  Bit definition for DCMIPP_CMFRCR register  *****************/
#define DCMIPP_CMFRCR_FRMCNT_Pos          (0U)
#define DCMIPP_CMFRCR_FRMCNT_Msk          (0xFFFFFFFFUL << DCMIPP_CMFRCR_FRMCNT_Pos)     /*!< 0xFFFFFFFF */
#define DCMIPP_CMFRCR_FRMCNT              DCMIPP_CMFRCR_FRMCNT_Msk                      /*!< frame counter, read-only, loops around.. */
#define DCMIPP_CMFRCR_FRMCNT_0            (0x1UL << DCMIPP_CMFRCR_FRMCNT_Pos)            /*!< 0x00000001 */
#define DCMIPP_CMFRCR_FRMCNT_1            (0x2UL << DCMIPP_CMFRCR_FRMCNT_Pos)            /*!< 0x00000002 */
#define DCMIPP_CMFRCR_FRMCNT_2            (0x4UL << DCMIPP_CMFRCR_FRMCNT_Pos)            /*!< 0x00000004 */
#define DCMIPP_CMFRCR_FRMCNT_3            (0x8UL << DCMIPP_CMFRCR_FRMCNT_Pos)            /*!< 0x00000008 */
#define DCMIPP_CMFRCR_FRMCNT_4            (0x10UL << DCMIPP_CMFRCR_FRMCNT_Pos)           /*!< 0x00000010 */
#define DCMIPP_CMFRCR_FRMCNT_5            (0x20UL << DCMIPP_CMFRCR_FRMCNT_Pos)           /*!< 0x00000020 */
#define DCMIPP_CMFRCR_FRMCNT_6            (0x40UL << DCMIPP_CMFRCR_FRMCNT_Pos)           /*!< 0x00000040 */
#define DCMIPP_CMFRCR_FRMCNT_7            (0x80UL << DCMIPP_CMFRCR_FRMCNT_Pos)           /*!< 0x00000080 */
#define DCMIPP_CMFRCR_FRMCNT_8            (0x100UL << DCMIPP_CMFRCR_FRMCNT_Pos)          /*!< 0x00000100 */
#define DCMIPP_CMFRCR_FRMCNT_9            (0x200UL << DCMIPP_CMFRCR_FRMCNT_Pos)          /*!< 0x00000200 */
#define DCMIPP_CMFRCR_FRMCNT_10           (0x400UL << DCMIPP_CMFRCR_FRMCNT_Pos)          /*!< 0x00000400 */
#define DCMIPP_CMFRCR_FRMCNT_11           (0x800UL << DCMIPP_CMFRCR_FRMCNT_Pos)          /*!< 0x00000800 */
#define DCMIPP_CMFRCR_FRMCNT_12           (0x1000UL << DCMIPP_CMFRCR_FRMCNT_Pos)         /*!< 0x00001000 */
#define DCMIPP_CMFRCR_FRMCNT_13           (0x2000UL << DCMIPP_CMFRCR_FRMCNT_Pos)         /*!< 0x00002000 */
#define DCMIPP_CMFRCR_FRMCNT_14           (0x4000UL << DCMIPP_CMFRCR_FRMCNT_Pos)         /*!< 0x00004000 */
#define DCMIPP_CMFRCR_FRMCNT_15           (0x8000UL << DCMIPP_CMFRCR_FRMCNT_Pos)         /*!< 0x00008000 */
#define DCMIPP_CMFRCR_FRMCNT_16           (0x10000UL << DCMIPP_CMFRCR_FRMCNT_Pos)        /*!< 0x00010000 */
#define DCMIPP_CMFRCR_FRMCNT_17           (0x20000UL << DCMIPP_CMFRCR_FRMCNT_Pos)        /*!< 0x00020000 */
#define DCMIPP_CMFRCR_FRMCNT_18           (0x40000UL << DCMIPP_CMFRCR_FRMCNT_Pos)        /*!< 0x00040000 */
#define DCMIPP_CMFRCR_FRMCNT_19           (0x80000UL << DCMIPP_CMFRCR_FRMCNT_Pos)        /*!< 0x00080000 */
#define DCMIPP_CMFRCR_FRMCNT_20           (0x100000UL << DCMIPP_CMFRCR_FRMCNT_Pos)       /*!< 0x00100000 */
#define DCMIPP_CMFRCR_FRMCNT_21           (0x200000UL << DCMIPP_CMFRCR_FRMCNT_Pos)       /*!< 0x00200000 */
#define DCMIPP_CMFRCR_FRMCNT_22           (0x400000UL << DCMIPP_CMFRCR_FRMCNT_Pos)       /*!< 0x00400000 */
#define DCMIPP_CMFRCR_FRMCNT_23           (0x800000UL << DCMIPP_CMFRCR_FRMCNT_Pos)       /*!< 0x00800000 */
#define DCMIPP_CMFRCR_FRMCNT_24           (0x1000000UL << DCMIPP_CMFRCR_FRMCNT_Pos)      /*!< 0x01000000 */
#define DCMIPP_CMFRCR_FRMCNT_25           (0x2000000UL << DCMIPP_CMFRCR_FRMCNT_Pos)      /*!< 0x02000000 */
#define DCMIPP_CMFRCR_FRMCNT_26           (0x4000000UL << DCMIPP_CMFRCR_FRMCNT_Pos)      /*!< 0x04000000 */
#define DCMIPP_CMFRCR_FRMCNT_27           (0x8000000UL << DCMIPP_CMFRCR_FRMCNT_Pos)      /*!< 0x08000000 */
#define DCMIPP_CMFRCR_FRMCNT_28           (0x10000000UL << DCMIPP_CMFRCR_FRMCNT_Pos)     /*!< 0x10000000 */
#define DCMIPP_CMFRCR_FRMCNT_29           (0x20000000UL << DCMIPP_CMFRCR_FRMCNT_Pos)     /*!< 0x20000000 */
#define DCMIPP_CMFRCR_FRMCNT_30           (0x40000000UL << DCMIPP_CMFRCR_FRMCNT_Pos)     /*!< 0x40000000 */
#define DCMIPP_CMFRCR_FRMCNT_31           (0x80000000UL << DCMIPP_CMFRCR_FRMCNT_Pos)     /*!< 0x80000000 */

