zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/*****************  Bit definition for DCMIPP_CMIER register  *****************/
#define DCMIPP_CMIER_ATXERRIE_Pos         (5U)
#define DCMIPP_CMIER_ATXERRIE_Msk         (0x1UL << DCMIPP_CMIER_ATXERRIE_Pos)           /*!< 0x00000020 */
#define DCMIPP_CMIER_ATXERRIE             DCMIPP_CMIER_ATXERRIE_Msk                     /*!< AXI Transfer error interrupt enable for IPPLUG. */
#define DCMIPP_CMIER_PRERRIE_Pos          (6U)
#define DCMIPP_CMIER_PRERRIE_Msk          (0x1UL << DCMIPP_CMIER_PRERRIE_Pos)            /*!< 0x00000040 */
#define DCMIPP_CMIER_PRERRIE              DCMIPP_CMIER_PRERRIE_Msk                      /*!< limit interrupt enable for the Parallel Interface. */
#define DCMIPP_CMIER_PROVRIE_Pos          (7U)
#define DCMIPP_CMIER_PROVRIE_Msk          (0x1UL << DCMIPP_CMIER_PROVRIE_Pos)            /*!< 0x00000080 */
#define DCMIPP_CMIER_PROVRIE              DCMIPP_CMIER_PROVRIE_Msk                      /*!< overrun interrupt enable for the Parallel Interface. */
#define DCMIPP_CMIER_P0LINEIE_Pos         (8U)
#define DCMIPP_CMIER_P0LINEIE_Msk         (0x1UL << DCMIPP_CMIER_P0LINEIE_Pos)           /*!< 0x00000100 */
#define DCMIPP_CMIER_P0LINEIE             DCMIPP_CMIER_P0LINEIE_Msk                     /*!< multi-Line Capture complete interrupt enable for the Pipe0 */
#define DCMIPP_CMIER_P0FRAMEIE_Pos        (9U)
#define DCMIPP_CMIER_P0FRAMEIE_Msk        (0x1UL << DCMIPP_CMIER_P0FRAMEIE_Pos)          /*!< 0x00000200 */
#define DCMIPP_CMIER_P0FRAMEIE            DCMIPP_CMIER_P0FRAMEIE_Msk                    /*!< Frame Capture complete interrupt enable for the Pipe0 */
#define DCMIPP_CMIER_P0VSYNCIE_Pos        (10U)
#define DCMIPP_CMIER_P0VSYNCIE_Msk        (0x1UL << DCMIPP_CMIER_P0VSYNCIE_Pos)          /*!< 0x00000400 */
#define DCMIPP_CMIER_P0VSYNCIE            DCMIPP_CMIER_P0VSYNCIE_Msk                    /*!< Vertical sync interrupt enable for the Pipe0. */
#define DCMIPP_CMIER_P0LIMITIE_Pos        (14U)
#define DCMIPP_CMIER_P0LIMITIE_Msk        (0x1UL << DCMIPP_CMIER_P0LIMITIE_Pos)          /*!< 0x00004000 */
#define DCMIPP_CMIER_P0LIMITIE            DCMIPP_CMIER_P0LIMITIE_Msk                    /*!< limit interrupt status clear for the Pipe0. */
#define DCMIPP_CMIER_P0OVRIE_Pos          (15U)
#define DCMIPP_CMIER_P0OVRIE_Msk          (0x1UL << DCMIPP_CMIER_P0OVRIE_Pos)            /*!< 0x00008000 */
#define DCMIPP_CMIER_P0OVRIE              DCMIPP_CMIER_P0OVRIE_Msk                      /*!< Overrun interrupt status clear for the Pipe0. */

/*****************  Bit definition for DCMIPP_CMSR1 register  *****************/
#define DCMIPP_CMSR1_PRHSYNC_Pos          (0U)
#define DCMIPP_CMSR1_PRHSYNC_Msk          (0x1UL << DCMIPP_CMSR1_PRHSYNC_Pos)            /*!< 0x00000001 */
#define DCMIPP_CMSR1_PRHSYNC              DCMIPP_CMSR1_PRHSYNC_Msk                      /*!< This bit gives the state of the HSYNC pin with the correct programmed polarity on the Parallel Interface if the ENABLE bit is set into the DCMIPP_PRCR register and if the pixel clock is received. It is set during the blanking period whatever the polarity selected in HPOL bit into the DCMIPP_PRCR, and cleared otherwise. */
#define DCMIPP_CMSR1_PRVSYNC_Pos          (1U)
#define DCMIPP_CMSR1_PRVSYNC_Msk          (0x1UL << DCMIPP_CMSR1_PRVSYNC_Pos)            /*!< 0x00000002 */
#define DCMIPP_CMSR1_PRVSYNC              DCMIPP_CMSR1_PRVSYNC_Msk                      /*!< This bit gives the state of the VSYNC pin with the correct programmed polarity on the Parallel Interface if the ENABLE bit is set into the DCMIPP_PRCR register and if the pixel clock is received. It is set during the blanking period whatever the polarity selected in VPOL bit into the DCMIPP_PRCR, and cleared otherwise. */
#define DCMIPP_CMSR1_P0CPTACT_Pos         (15U)
#define DCMIPP_CMSR1_P0CPTACT_Msk         (0x1UL << DCMIPP_CMSR1_P0CPTACT_Pos)           /*!< 0x00008000 */
#define DCMIPP_CMSR1_P0CPTACT             DCMIPP_CMSR1_P0CPTACT_Msk                     /*!< active frame capture (active from start-of-frame to frame complete) for the Pipe0. */

/*****************  Bit definition for DCMIPP_CMSR2 register  *****************/
#define DCMIPP_CMSR2_ATXERRF_Pos          (5U)
#define DCMIPP_CMSR2_ATXERRF_Msk          (0x1UL << DCMIPP_CMSR2_ATXERRF_Pos)            /*!< 0x00000020 */
#define DCMIPP_CMSR2_ATXERRF              DCMIPP_CMSR2_ATXERRF_Msk                      /*!< AXI transfer error interrupt status flag for the IPPLUG. */
#define DCMIPP_CMSR2_PRERRF_Pos           (6U)
#define DCMIPP_CMSR2_PRERRF_Msk           (0x1UL << DCMIPP_CMSR2_PRERRF_Pos)             /*!< 0x00000040 */
#define DCMIPP_CMSR2_PRERRF               DCMIPP_CMSR2_PRERRF_Msk                       /*!< Synchronization error raw interrupt status for the Parallel Interface. */
#define DCMIPP_CMSR2_P0LINEF_Pos          (8U)
#define DCMIPP_CMSR2_P0LINEF_Msk          (0x1UL << DCMIPP_CMSR2_P0LINEF_Pos)            /*!< 0x00000100 */
#define DCMIPP_CMSR2_P0LINEF              DCMIPP_CMSR2_P0LINEF_Msk                      /*!< multi-Line Capture completed raw interrupt status for the Pipe0. */
#define DCMIPP_CMSR2_P0FRAMEF_Pos         (9U)
#define DCMIPP_CMSR2_P0FRAMEF_Msk         (0x1UL << DCMIPP_CMSR2_P0FRAMEF_Pos)           /*!< 0x00000200 */
#define DCMIPP_CMSR2_P0FRAMEF             DCMIPP_CMSR2_P0FRAMEF_Msk                     /*!< Frame Capture completed raw interrupt status for the Pipe0. */
#define DCMIPP_CMSR2_P0VSYNCF_Pos         (10U)
#define DCMIPP_CMSR2_P0VSYNCF_Msk         (0x1UL << DCMIPP_CMSR2_P0VSYNCF_Pos)           /*!< 0x00000400 */
#define DCMIPP_CMSR2_P0VSYNCF             DCMIPP_CMSR2_P0VSYNCF_Msk                     /*!< VSYNC raw interrupt status for the Pipe0. */
#define DCMIPP_CMSR2_P0LIMITF_Pos         (14U)
#define DCMIPP_CMSR2_P0LIMITF_Msk         (0x1UL << DCMIPP_CMSR2_P0LIMITF_Pos)           /*!< 0x00004000 */
#define DCMIPP_CMSR2_P0LIMITF             DCMIPP_CMSR2_P0LIMITF_Msk                     /*!< Limit raw interrupt status for the Pipe0. */
#define DCMIPP_CMSR2_P0OVRF_Pos           (15U)
#define DCMIPP_CMSR2_P0OVRF_Msk           (0x1UL << DCMIPP_CMSR2_P0OVRF_Pos)             /*!< 0x00008000 */
#define DCMIPP_CMSR2_P0OVRF               DCMIPP_CMSR2_P0OVRF_Msk                       /*!< Overrun raw interrupt status for the Pipe0. */

/*****************  Bit definition for DCMIPP_CMFCR register  *****************/
#define DCMIPP_CMFCR_CATXERRF_Pos         (5U)
#define DCMIPP_CMFCR_CATXERRF_Msk         (0x1UL << DCMIPP_CMFCR_CATXERRF_Pos)           /*!< 0x00000020 */
#define DCMIPP_CMFCR_CATXERRF             DCMIPP_CMFCR_CATXERRF_Msk                     /*!< AXI Transfer error interrupt status clear */
#define DCMIPP_CMFCR_CPRERRF_Pos          (6U)
#define DCMIPP_CMFCR_CPRERRF_Msk          (0x1UL << DCMIPP_CMFCR_CPRERRF_Pos)            /*!< 0x00000040 */
#define DCMIPP_CMFCR_CPRERRF              DCMIPP_CMFCR_CPRERRF_Msk                      /*!< Synchronization error interrupt status clear */
#define DCMIPP_CMFCR_CP0LINEF_Pos         (8U)
#define DCMIPP_CMFCR_CP0LINEF_Msk         (0x1UL << DCMIPP_CMFCR_CP0LINEF_Pos)           /*!< 0x00000100 */
#define DCMIPP_CMFCR_CP0LINEF             DCMIPP_CMFCR_CP0LINEF_Msk                     /*!< multi-Line Capture complete interrupt status clear */
#define DCMIPP_CMFCR_CP0FRAMEF_Pos        (9U)
#define DCMIPP_CMFCR_CP0FRAMEF_Msk        (0x1UL << DCMIPP_CMFCR_CP0FRAMEF_Pos)          /*!< 0x00000200 */
#define DCMIPP_CMFCR_CP0FRAMEF            DCMIPP_CMFCR_CP0FRAMEF_Msk                    /*!< Frame Capture complete interrupt status clear */
#define DCMIPP_CMFCR_CP0VSYNCF_Pos        (10U)
#define DCMIPP_CMFCR_CP0VSYNCF_Msk        (0x1UL << DCMIPP_CMFCR_CP0VSYNCF_Pos)          /*!< 0x00000400 */
#define DCMIPP_CMFCR_CP0VSYNCF            DCMIPP_CMFCR_CP0VSYNCF_Msk                    /*!< Vertical synch interrupt status clear */
#define DCMIPP_CMFCR_CP0LIMITF_Pos        (14U)
#define DCMIPP_CMFCR_CP0LIMITF_Msk        (0x1UL << DCMIPP_CMFCR_CP0LIMITF_Pos)          /*!< 0x00004000 */
#define DCMIPP_CMFCR_CP0LIMITF            DCMIPP_CMFCR_CP0LIMITF_Msk                    /*!< limit interrupt status clear */
#define DCMIPP_CMFCR_CP0OVRF_Pos          (15U)
#define DCMIPP_CMFCR_CP0OVRF_Msk          (0x1UL << DCMIPP_CMFCR_CP0OVRF_Pos)            /*!< 0x00008000 */
#define DCMIPP_CMFCR_CP0OVRF              DCMIPP_CMFCR_CP0OVRF_Msk                      /*!< Overrun interrupt status clear */

/***************  Bit definition for DCMIPP_P0HWCFGR register  ****************/
#define DCMIPP_P0HWCFGR_CPLA_Pos          (0U)
#define DCMIPP_P0HWCFGR_CPLA_Msk          (0x3UL << DCMIPP_P0HWCFGR_CPLA_Pos)            /*!< 0x00000003 */
#define DCMIPP_P0HWCFGR_CPLA              DCMIPP_P0HWCFGR_CPLA_Msk                      /*!< Capability for planar buffers */
#define DCMIPP_P0HWCFGR_CPLA_0            (0x1UL << DCMIPP_P0HWCFGR_CPLA_Pos)            /*!< 0x00000001 */
#define DCMIPP_P0HWCFGR_CPLA_1            (0x2UL << DCMIPP_P0HWCFGR_CPLA_Pos)            /*!< 0x00000002 */
#define DCMIPP_P0HWCFGR_CDS_Pos           (2U)
#define DCMIPP_P0HWCFGR_CDS_Msk           (0x1UL << DCMIPP_P0HWCFGR_CDS_Pos)             /*!< 0x00000004 */
#define DCMIPP_P0HWCFGR_CDS               DCMIPP_P0HWCFGR_CDS_Msk                       /*!< capability for Downsize Filter: */
#define DCMIPP_P0HWCFGR_DBM_Pos           (3U)
#define DCMIPP_P0HWCFGR_DBM_Msk           (0x1UL << DCMIPP_P0HWCFGR_DBM_Pos)             /*!< 0x00000008 */
#define DCMIPP_P0HWCFGR_DBM               DCMIPP_P0HWCFGR_DBM_Msk                       /*!< Double buffer mode */
#define DCMIPP_P0HWCFGR_CRB_Pos           (4U)
#define DCMIPP_P0HWCFGR_CRB_Msk           (0x3UL << DCMIPP_P0HWCFGR_CRB_Pos)             /*!< 0x00000030 */
#define DCMIPP_P0HWCFGR_CRB               DCMIPP_P0HWCFGR_CRB_Msk                       /*!< 1: capability for demosaicing: */
#define DCMIPP_P0HWCFGR_CRB_0             (0x1UL << DCMIPP_P0HWCFGR_CRB_Pos)            /*!< 0x00000010 */
#define DCMIPP_P0HWCFGR_CRB_1             (0x2UL << DCMIPP_P0HWCFGR_CRB_Pos)            /*!< 0x00000020 */
#define DCMIPP_P0HWCFGR_CGM_Pos           (6U)
#define DCMIPP_P0HWCFGR_CGM_Msk           (0x3UL << DCMIPP_P0HWCFGR_CGM_Pos)             /*!< 0x000000C0 */
#define DCMIPP_P0HWCFGR_CGM               DCMIPP_P0HWCFGR_CGM_Msk                       /*!< capability for Gamma Conversions: */
#define DCMIPP_P0HWCFGR_CGM_0             (0x1UL << DCMIPP_P0HWCFGR_CGM_Pos)            /*!< 0x00000040 */
#define DCMIPP_P0HWCFGR_CGM_1             (0x2UL << DCMIPP_P0HWCFGR_CGM_Pos)            /*!< 0x00000080 */
#define DCMIPP_P0HWCFGR_CROI_Pos          (8U)
#define DCMIPP_P0HWCFGR_CROI_Msk          (0xFUL << DCMIPP_P0HWCFGR_CROI_Pos)            /*!< 0x00000F00 */
#define DCMIPP_P0HWCFGR_CROI              DCMIPP_P0HWCFGR_CROI_Msk                      /*!< capability for ROI : It defines the number of ROI in the pipe */
#define DCMIPP_P0HWCFGR_CROI_0            (0x1UL << DCMIPP_P0HWCFGR_CROI_Pos)          /*!< 0x00000100 */
#define DCMIPP_P0HWCFGR_CROI_1            (0x2UL << DCMIPP_P0HWCFGR_CROI_Pos)          /*!< 0x00000200 */
#define DCMIPP_P0HWCFGR_CROI_2            (0x4UL << DCMIPP_P0HWCFGR_CROI_Pos)          /*!< 0x00000400 */
#define DCMIPP_P0HWCFGR_CROI_3            (0x8UL << DCMIPP_P0HWCFGR_CROI_Pos)          /*!< 0x00000800 */
#define DCMIPP_P0HWCFGR_CVP_Pos           (13U)
#define DCMIPP_P0HWCFGR_CVP_Msk           (0x1UL << DCMIPP_P0HWCFGR_CVP_Pos)             /*!< 0x00002000 */
#define DCMIPP_P0HWCFGR_CVP               DCMIPP_P0HWCFGR_CVP_Msk                       /*!< Capability for virtual pipeline virtualization */

/****************  Bit definition for DCMIPP_P0FSCR register  *****************/
#define DCMIPP_P0FSCR_PIPEN_Pos           (31U)
#define DCMIPP_P0FSCR_PIPEN_Msk           (0x1UL << DCMIPP_P0FSCR_PIPEN_Pos)             /*!< 0x80000000 */
#define DCMIPP_P0FSCR_PIPEN               DCMIPP_P0FSCR_PIPEN_Msk                       /*!< activation of this Pipe. */

/****************  Bit definition for DCMIPP_P0FCTCR register  ****************/
#define DCMIPP_P0FCTCR_FRATE_Pos          (0U)
#define DCMIPP_P0FCTCR_FRATE_Msk          (0x3UL << DCMIPP_P0FCTCR_FRATE_Pos)            /*!< 0x00000003 */
#define DCMIPP_P0FCTCR_FRATE              DCMIPP_P0FCTCR_FRATE_Msk                      /*!< Frame capture rate control */
#define DCMIPP_P0FCTCR_FRATE_0            (0x1UL << DCMIPP_P0FCTCR_FRATE_Pos)            /*!< 0x00000001 */
#define DCMIPP_P0FCTCR_FRATE_1            (0x2UL << DCMIPP_P0FCTCR_FRATE_Pos)            /*!< 0x00000002 */
#define DCMIPP_P0FCTCR_CPTMODE_Pos        (2U)
#define DCMIPP_P0FCTCR_CPTMODE_Msk        (0x1UL << DCMIPP_P0FCTCR_CPTMODE_Pos)          /*!< 0x00000004 */
#define DCMIPP_P0FCTCR_CPTMODE            DCMIPP_P0FCTCR_CPTMODE_Msk                    /*!< Capture mode */
#define DCMIPP_P0FCTCR_CPTREQ_Pos         (3U)
#define DCMIPP_P0FCTCR_CPTREQ_Msk         (0x1UL << DCMIPP_P0FCTCR_CPTREQ_Pos)           /*!< 0x00000008 */
#define DCMIPP_P0FCTCR_CPTREQ             DCMIPP_P0FCTCR_CPTREQ_Msk                     /*!< Capture requested */

/****************  Bit definition for DCMIPP_P0SCSTR register  ****************/
#define DCMIPP_P0SCSTR_HSTART_Pos         (0U)
#define DCMIPP_P0SCSTR_HSTART_Msk         (0xFFFUL << DCMIPP_P0SCSTR_HSTART_Pos)         /*!< 0x00000FFF */
#define DCMIPP_P0SCSTR_HSTART             DCMIPP_P0SCSTR_HSTART_Msk                     /*!< horizontal start, from 0 to 4094 words wide */
#define DCMIPP_P0SCSTR_HSTART_0           (0x1UL << DCMIPP_P0SCSTR_HSTART_Pos)           /*!< 0x00000001 */
#define DCMIPP_P0SCSTR_HSTART_1           (0x2UL << DCMIPP_P0SCSTR_HSTART_Pos)           /*!< 0x00000002 */
#define DCMIPP_P0SCSTR_HSTART_2           (0x4UL << DCMIPP_P0SCSTR_HSTART_Pos)           /*!< 0x00000004 */
#define DCMIPP_P0SCSTR_HSTART_3           (0x8UL << DCMIPP_P0SCSTR_HSTART_Pos)           /*!< 0x00000008 */
#define DCMIPP_P0SCSTR_HSTART_4           (0x10UL << DCMIPP_P0SCSTR_HSTART_Pos)          /*!< 0x00000010 */
#define DCMIPP_P0SCSTR_HSTART_5           (0x20UL << DCMIPP_P0SCSTR_HSTART_Pos)          /*!< 0x00000020 */
#define DCMIPP_P0SCSTR_HSTART_6           (0x40UL << DCMIPP_P0SCSTR_HSTART_Pos)          /*!< 0x00000040 */
#define DCMIPP_P0SCSTR_HSTART_7           (0x80UL << DCMIPP_P0SCSTR_HSTART_Pos)          /*!< 0x00000080 */
#define DCMIPP_P0SCSTR_HSTART_8           (0x100UL << DCMIPP_P0SCSTR_HSTART_Pos)         /*!< 0x00000100 */
#define DCMIPP_P0SCSTR_HSTART_9           (0x200UL << DCMIPP_P0SCSTR_HSTART_Pos)         /*!< 0x00000200 */
#define DCMIPP_P0SCSTR_HSTART_10          (0x400UL << DCMIPP_P0SCSTR_HSTART_Pos)         /*!< 0x00000400 */
#define DCMIPP_P0SCSTR_HSTART_11          (0x800UL << DCMIPP_P0SCSTR_HSTART_Pos)         /*!< 0x00000800 */
#define DCMIPP_P0SCSTR_VSTART_Pos         (16U)
#define DCMIPP_P0SCSTR_VSTART_Msk         (0xFFFUL << DCMIPP_P0SCSTR_VSTART_Pos)         /*!< 0x0FFF0000 */
#define DCMIPP_P0SCSTR_VSTART             DCMIPP_P0SCSTR_VSTART_Msk                     /*!< vertical start, from 0 to 4094 pixels high */
#define DCMIPP_P0SCSTR_VSTART_0           (0x1UL << DCMIPP_P0SCSTR_VSTART_Pos)       /*!< 0x00010000 */
#define DCMIPP_P0SCSTR_VSTART_1           (0x2UL << DCMIPP_P0SCSTR_VSTART_Pos)       /*!< 0x00020000 */
#define DCMIPP_P0SCSTR_VSTART_2           (0x4UL << DCMIPP_P0SCSTR_VSTART_Pos)       /*!< 0x00040000 */
#define DCMIPP_P0SCSTR_VSTART_3           (0x8UL << DCMIPP_P0SCSTR_VSTART_Pos)       /*!< 0x00080000 */
#define DCMIPP_P0SCSTR_VSTART_4           (0x10UL << DCMIPP_P0SCSTR_VSTART_Pos)      /*!< 0x00100000 */
#define DCMIPP_P0SCSTR_VSTART_5           (0x20UL << DCMIPP_P0SCSTR_VSTART_Pos)      /*!< 0x00200000 */
#define DCMIPP_P0SCSTR_VSTART_6           (0x40UL << DCMIPP_P0SCSTR_VSTART_Pos)      /*!< 0x00400000 */
#define DCMIPP_P0SCSTR_VSTART_7           (0x80UL << DCMIPP_P0SCSTR_VSTART_Pos)      /*!< 0x00800000 */
#define DCMIPP_P0SCSTR_VSTART_8           (0x100UL << DCMIPP_P0SCSTR_VSTART_Pos)     /*!< 0x01000000 */
#define DCMIPP_P0SCSTR_VSTART_9           (0x200UL << DCMIPP_P0SCSTR_VSTART_Pos)     /*!< 0x02000000 */
#define DCMIPP_P0SCSTR_VSTART_10          (0x400UL << DCMIPP_P0SCSTR_VSTART_Pos)     /*!< 0x04000000 */
#define DCMIPP_P0SCSTR_VSTART_11          (0x800UL << DCMIPP_P0SCSTR_VSTART_Pos)     /*!< 0x08000000 */

/****************  Bit definition for DCMIPP_P0SCSZR register  ****************/
#define DCMIPP_P0SCSZR_HSIZE_Pos          (0U)
#define DCMIPP_P0SCSZR_HSIZE_Msk          (0xFFFUL << DCMIPP_P0SCSZR_HSIZE_Pos)          /*!< 0x00000FFF */
#define DCMIPP_P0SCSZR_HSIZE              DCMIPP_P0SCSZR_HSIZE_Msk                      /*!< horizontal size, from 0 to 4094 word wide (data 32-bit). If the value is maintained at 0 when enabling the crop thanks to the ENABLE bit, the value is forced internally at 0x3FF which is the maximum value. */
#define DCMIPP_P0SCSZR_HSIZE_0            (0x1UL << DCMIPP_P0SCSZR_HSIZE_Pos)            /*!< 0x00000001 */
#define DCMIPP_P0SCSZR_HSIZE_1            (0x2UL << DCMIPP_P0SCSZR_HSIZE_Pos)            /*!< 0x00000002 */
#define DCMIPP_P0SCSZR_HSIZE_2            (0x4UL << DCMIPP_P0SCSZR_HSIZE_Pos)            /*!< 0x00000004 */
#define DCMIPP_P0SCSZR_HSIZE_3            (0x8UL << DCMIPP_P0SCSZR_HSIZE_Pos)            /*!< 0x00000008 */
#define DCMIPP_P0SCSZR_HSIZE_4            (0x10UL << DCMIPP_P0SCSZR_HSIZE_Pos)           /*!< 0x00000010 */
#define DCMIPP_P0SCSZR_HSIZE_5            (0x20UL << DCMIPP_P0SCSZR_HSIZE_Pos)           /*!< 0x00000020 */
#define DCMIPP_P0SCSZR_HSIZE_6            (0x40UL << DCMIPP_P0SCSZR_HSIZE_Pos)           /*!< 0x00000040 */
#define DCMIPP_P0SCSZR_HSIZE_7            (0x80UL << DCMIPP_P0SCSZR_HSIZE_Pos)           /*!< 0x00000080 */
#define DCMIPP_P0SCSZR_HSIZE_8            (0x100UL << DCMIPP_P0SCSZR_HSIZE_Pos)          /*!< 0x00000100 */
#define DCMIPP_P0SCSZR_HSIZE_9            (0x200UL << DCMIPP_P0SCSZR_HSIZE_Pos)          /*!< 0x00000200 */
#define DCMIPP_P0SCSZR_HSIZE_10           (0x400UL << DCMIPP_P0SCSZR_HSIZE_Pos)          /*!< 0x00000400 */
#define DCMIPP_P0SCSZR_HSIZE_11           (0x800UL << DCMIPP_P0SCSZR_HSIZE_Pos)          /*!< 0x00000800 */
#define DCMIPP_P0SCSZR_VSIZE_Pos          (16U)
#define DCMIPP_P0SCSZR_VSIZE_Msk          (0xFFFUL << DCMIPP_P0SCSZR_VSIZE_Pos)          /*!< 0x0FFF0000 */
#define DCMIPP_P0SCSZR_VSIZE              DCMIPP_P0SCSZR_VSIZE_Msk                      /*!< vertical size, from 0 to 4094 pixels high. If the value is maintained at 0 when enabling the crop thanks to the ENABLE bit, the value is forced internally at 0x3FF which is the maximum value. */
#define DCMIPP_P0SCSZR_VSIZE_0            (0x1UL << DCMIPP_P0SCSZR_VSIZE_Pos)        /*!< 0x00010000 */
#define DCMIPP_P0SCSZR_VSIZE_1            (0x2UL << DCMIPP_P0SCSZR_VSIZE_Pos)        /*!< 0x00020000 */
#define DCMIPP_P0SCSZR_VSIZE_2            (0x4UL << DCMIPP_P0SCSZR_VSIZE_Pos)        /*!< 0x00040000 */
#define DCMIPP_P0SCSZR_VSIZE_3            (0x8UL << DCMIPP_P0SCSZR_VSIZE_Pos)        /*!< 0x00080000 */
#define DCMIPP_P0SCSZR_VSIZE_4            (0x10UL << DCMIPP_P0SCSZR_VSIZE_Pos)       /*!< 0x00100000 */
#define DCMIPP_P0SCSZR_VSIZE_5            (0x20UL << DCMIPP_P0SCSZR_VSIZE_Pos)       /*!< 0x00200000 */
#define DCMIPP_P0SCSZR_VSIZE_6            (0x40UL << DCMIPP_P0SCSZR_VSIZE_Pos)       /*!< 0x00400000 */
#define DCMIPP_P0SCSZR_VSIZE_7            (0x80UL << DCMIPP_P0SCSZR_VSIZE_Pos)       /*!< 0x00800000 */
#define DCMIPP_P0SCSZR_VSIZE_8            (0x100UL << DCMIPP_P0SCSZR_VSIZE_Pos)      /*!< 0x01000000 */
#define DCMIPP_P0SCSZR_VSIZE_9            (0x200UL << DCMIPP_P0SCSZR_VSIZE_Pos)      /*!< 0x02000000 */
#define DCMIPP_P0SCSZR_VSIZE_10           (0x400UL << DCMIPP_P0SCSZR_VSIZE_Pos)      /*!< 0x04000000 */
#define DCMIPP_P0SCSZR_VSIZE_11           (0x800UL << DCMIPP_P0SCSZR_VSIZE_Pos)      /*!< 0x08000000 */
#define DCMIPP_P0SCSZR_POSNEG_Pos         (30U)
#define DCMIPP_P0SCSZR_POSNEG_Msk         (0x1UL << DCMIPP_P0SCSZR_POSNEG_Pos)           /*!< 0x40000000 */
#define DCMIPP_P0SCSZR_POSNEG             DCMIPP_P0SCSZR_POSNEG_Msk                     /*!< This bit is set and cleared by software. It has a meaning only if ENABLE bit is set. */
#define DCMIPP_P0SCSZR_ENABLE_Pos         (31U)
#define DCMIPP_P0SCSZR_ENABLE_Msk         (0x1UL << DCMIPP_P0SCSZR_ENABLE_Pos)           /*!< 0x80000000 */
#define DCMIPP_P0SCSZR_ENABLE             DCMIPP_P0SCSZR_ENABLE_Msk                     /*!< This bit is set and cleared by software. */

/***************  Bit definition for DCMIPP_P0DCCNTR register  ****************/
#define DCMIPP_P0DCCNTR_CNT_Pos           (0U)
#define DCMIPP_P0DCCNTR_CNT_Msk           (0x3FFFFFFUL << DCMIPP_P0DCCNTR_CNT_Pos)       /*!< 0x03FFFFFF */
#define DCMIPP_P0DCCNTR_CNT               DCMIPP_P0DCCNTR_CNT_Msk                       /*!< number of data dumped during the frame. The size of the data is expressed in bytes. It counts only the data selected thanks to the CROP 2D function. The counter satures at 0x3FFFFF. Granularity is 32-bit for all the formats except for the byte stream format (JPEG for instance...) having a byte granularity. */
#define DCMIPP_P0DCCNTR_CNT_0             (0x1UL << DCMIPP_P0DCCNTR_CNT_Pos)             /*!< 0x00000001 */
#define DCMIPP_P0DCCNTR_CNT_1             (0x2UL << DCMIPP_P0DCCNTR_CNT_Pos)             /*!< 0x00000002 */
#define DCMIPP_P0DCCNTR_CNT_2             (0x4UL << DCMIPP_P0DCCNTR_CNT_Pos)             /*!< 0x00000004 */
#define DCMIPP_P0DCCNTR_CNT_3             (0x8UL << DCMIPP_P0DCCNTR_CNT_Pos)             /*!< 0x00000008 */
#define DCMIPP_P0DCCNTR_CNT_4             (0x10UL << DCMIPP_P0DCCNTR_CNT_Pos)            /*!< 0x00000010 */
#define DCMIPP_P0DCCNTR_CNT_5             (0x20UL << DCMIPP_P0DCCNTR_CNT_Pos)            /*!< 0x00000020 */
#define DCMIPP_P0DCCNTR_CNT_6             (0x40UL << DCMIPP_P0DCCNTR_CNT_Pos)            /*!< 0x00000040 */
#define DCMIPP_P0DCCNTR_CNT_7             (0x80UL << DCMIPP_P0DCCNTR_CNT_Pos)            /*!< 0x00000080 */
#define DCMIPP_P0DCCNTR_CNT_8             (0x100UL << DCMIPP_P0DCCNTR_CNT_Pos)           /*!< 0x00000100 */
#define DCMIPP_P0DCCNTR_CNT_9             (0x200UL << DCMIPP_P0DCCNTR_CNT_Pos)           /*!< 0x00000200 */
#define DCMIPP_P0DCCNTR_CNT_10            (0x400UL << DCMIPP_P0DCCNTR_CNT_Pos)           /*!< 0x00000400 */
#define DCMIPP_P0DCCNTR_CNT_11            (0x800UL << DCMIPP_P0DCCNTR_CNT_Pos)           /*!< 0x00000800 */
#define DCMIPP_P0DCCNTR_CNT_12            (0x1000UL << DCMIPP_P0DCCNTR_CNT_Pos)          /*!< 0x00001000 */
#define DCMIPP_P0DCCNTR_CNT_13            (0x2000UL << DCMIPP_P0DCCNTR_CNT_Pos)          /*!< 0x00002000 */
#define DCMIPP_P0DCCNTR_CNT_14            (0x4000UL << DCMIPP_P0DCCNTR_CNT_Pos)          /*!< 0x00004000 */
#define DCMIPP_P0DCCNTR_CNT_15            (0x8000UL << DCMIPP_P0DCCNTR_CNT_Pos)          /*!< 0x00008000 */
#define DCMIPP_P0DCCNTR_CNT_16            (0x10000UL << DCMIPP_P0DCCNTR_CNT_Pos)         /*!< 0x00010000 */
#define DCMIPP_P0DCCNTR_CNT_17            (0x20000UL << DCMIPP_P0DCCNTR_CNT_Pos)         /*!< 0x00020000 */
#define DCMIPP_P0DCCNTR_CNT_18            (0x40000UL << DCMIPP_P0DCCNTR_CNT_Pos)         /*!< 0x00040000 */
#define DCMIPP_P0DCCNTR_CNT_19            (0x80000UL << DCMIPP_P0DCCNTR_CNT_Pos)         /*!< 0x00080000 */
#define DCMIPP_P0DCCNTR_CNT_20            (0x100000UL << DCMIPP_P0DCCNTR_CNT_Pos)        /*!< 0x00100000 */
#define DCMIPP_P0DCCNTR_CNT_21            (0x200000UL << DCMIPP_P0DCCNTR_CNT_Pos)        /*!< 0x00200000 */
#define DCMIPP_P0DCCNTR_CNT_22            (0x400000UL << DCMIPP_P0DCCNTR_CNT_Pos)        /*!< 0x00400000 */
#define DCMIPP_P0DCCNTR_CNT_23            (0x800000UL << DCMIPP_P0DCCNTR_CNT_Pos)        /*!< 0x00800000 */
#define DCMIPP_P0DCCNTR_CNT_24            (0x1000000UL << DCMIPP_P0DCCNTR_CNT_Pos)       /*!< 0x01000000 */
#define DCMIPP_P0DCCNTR_CNT_25            (0x2000000UL << DCMIPP_P0DCCNTR_CNT_Pos)       /*!< 0x02000000 */

