zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/****************** Bit definition for GPIO_AFRL register *********************/
#define GPIO_AFRL_AFR0_Pos           (0U)
#define GPIO_AFRL_AFR0_Msk           (0xFUL << GPIO_AFRL_AFR0_Pos)          /*!< 0x0000000F */
#define GPIO_AFRL_AFR0               GPIO_AFRL_AFR0_Msk
#define GPIO_AFRL_AFR0_0             (0x1UL << GPIO_AFRL_AFR0_Pos)          /*!< 0x00000001 */
#define GPIO_AFRL_AFR0_1             (0x2UL << GPIO_AFRL_AFR0_Pos)          /*!< 0x00000002 */
#define GPIO_AFRL_AFR0_2             (0x4UL << GPIO_AFRL_AFR0_Pos)          /*!< 0x00000004 */
#define GPIO_AFRL_AFR0_3             (0x8UL << GPIO_AFRL_AFR0_Pos)          /*!< 0x00000008 */
#define GPIO_AFRL_AFR1_Pos           (4U)
#define GPIO_AFRL_AFR1_Msk           (0xFUL << GPIO_AFRL_AFR1_Pos)          /*!< 0x000000F0 */
#define GPIO_AFRL_AFR1               GPIO_AFRL_AFR1_Msk
#define GPIO_AFRL_AFR1_0             (0x1UL << GPIO_AFRL_AFR1_Pos)          /*!< 0x00000010 */
#define GPIO_AFRL_AFR1_1             (0x2UL << GPIO_AFRL_AFR1_Pos)          /*!< 0x00000020 */
#define GPIO_AFRL_AFR1_2             (0x4UL << GPIO_AFRL_AFR1_Pos)          /*!< 0x00000040 */
#define GPIO_AFRL_AFR1_3             (0x8UL << GPIO_AFRL_AFR1_Pos)          /*!< 0x00000080 */
#define GPIO_AFRL_AFR2_Pos           (8U)
#define GPIO_AFRL_AFR2_Msk           (0xFUL << GPIO_AFRL_AFR2_Pos)          /*!< 0x00000F00 */
#define GPIO_AFRL_AFR2               GPIO_AFRL_AFR2_Msk
#define GPIO_AFRL_AFR2_0             (0x1UL << GPIO_AFRL_AFR2_Pos)          /*!< 0x00000100 */
#define GPIO_AFRL_AFR2_1             (0x2UL << GPIO_AFRL_AFR2_Pos)          /*!< 0x00000200 */
#define GPIO_AFRL_AFR2_2             (0x4UL << GPIO_AFRL_AFR2_Pos)          /*!< 0x00000400 */
#define GPIO_AFRL_AFR2_3             (0x8UL << GPIO_AFRL_AFR2_Pos)          /*!< 0x00000800 */
#define GPIO_AFRL_AFR3_Pos           (12U)
#define GPIO_AFRL_AFR3_Msk           (0xFUL << GPIO_AFRL_AFR3_Pos)          /*!< 0x0000F000 */
#define GPIO_AFRL_AFR3               GPIO_AFRL_AFR3_Msk
#define GPIO_AFRL_AFR3_0             (0x1UL << GPIO_AFRL_AFR3_Pos)          /*!< 0x00001000 */
#define GPIO_AFRL_AFR3_1             (0x2UL << GPIO_AFRL_AFR3_Pos)          /*!< 0x00002000 */
#define GPIO_AFRL_AFR3_2             (0x4UL << GPIO_AFRL_AFR3_Pos)          /*!< 0x00004000 */
#define GPIO_AFRL_AFR3_3             (0x8UL << GPIO_AFRL_AFR3_Pos)          /*!< 0x00008000 */
#define GPIO_AFRL_AFR4_Pos           (16U)
#define GPIO_AFRL_AFR4_Msk           (0xFUL << GPIO_AFRL_AFR4_Pos)          /*!< 0x000F0000 */
#define GPIO_AFRL_AFR4               GPIO_AFRL_AFR4_Msk
#define GPIO_AFRL_AFR4_0             (0x1UL << GPIO_AFRL_AFR4_Pos)          /*!< 0x00010000 */
#define GPIO_AFRL_AFR4_1             (0x2UL << GPIO_AFRL_AFR4_Pos)          /*!< 0x00020000 */
#define GPIO_AFRL_AFR4_2             (0x4UL << GPIO_AFRL_AFR4_Pos)          /*!< 0x00040000 */
#define GPIO_AFRL_AFR4_3             (0x8UL << GPIO_AFRL_AFR4_Pos)          /*!< 0x00080000 */
#define GPIO_AFRL_AFR5_Pos           (20U)
#define GPIO_AFRL_AFR5_Msk           (0xFUL << GPIO_AFRL_AFR5_Pos)          /*!< 0x00F00000 */
#define GPIO_AFRL_AFR5               GPIO_AFRL_AFR5_Msk
#define GPIO_AFRL_AFR5_0             (0x1UL << GPIO_AFRL_AFR5_Pos)          /*!< 0x00100000 */
#define GPIO_AFRL_AFR5_1             (0x2UL << GPIO_AFRL_AFR5_Pos)          /*!< 0x00200000 */
#define GPIO_AFRL_AFR5_2             (0x4UL << GPIO_AFRL_AFR5_Pos)          /*!< 0x00400000 */
#define GPIO_AFRL_AFR5_3             (0x8UL << GPIO_AFRL_AFR5_Pos)          /*!< 0x00800000 */
#define GPIO_AFRL_AFR6_Pos           (24U)
#define GPIO_AFRL_AFR6_Msk           (0xFUL << GPIO_AFRL_AFR6_Pos)          /*!< 0x0F000000 */
#define GPIO_AFRL_AFR6               GPIO_AFRL_AFR6_Msk
#define GPIO_AFRL_AFR6_0             (0x1UL << GPIO_AFRL_AFR6_Pos)          /*!< 0x01000000 */
#define GPIO_AFRL_AFR6_1             (0x2UL << GPIO_AFRL_AFR6_Pos)          /*!< 0x02000000 */
#define GPIO_AFRL_AFR6_2             (0x4UL << GPIO_AFRL_AFR6_Pos)          /*!< 0x04000000 */
#define GPIO_AFRL_AFR6_3             (0x8UL << GPIO_AFRL_AFR6_Pos)          /*!< 0x08000000 */
#define GPIO_AFRL_AFR7_Pos           (28U)
#define GPIO_AFRL_AFR7_Msk           (0xFUL << GPIO_AFRL_AFR7_Pos)          /*!< 0xF0000000 */
#define GPIO_AFRL_AFR7               GPIO_AFRL_AFR7_Msk
#define GPIO_AFRL_AFR7_0             (0x1UL << GPIO_AFRL_AFR7_Pos)          /*!< 0x10000000 */
#define GPIO_AFRL_AFR7_1             (0x2UL << GPIO_AFRL_AFR7_Pos)          /*!< 0x20000000 */
#define GPIO_AFRL_AFR7_2             (0x4UL << GPIO_AFRL_AFR7_Pos)          /*!< 0x40000000 */
#define GPIO_AFRL_AFR7_3             (0x8UL << GPIO_AFRL_AFR7_Pos)          /*!< 0x80000000 */

/****************** Bit definition for GPIO_AFRH register *********************/
#define GPIO_AFRH_AFR8_Pos           (0U)
#define GPIO_AFRH_AFR8_Msk           (0xFUL << GPIO_AFRH_AFR8_Pos)          /*!< 0x0000000F */
#define GPIO_AFRH_AFR8               GPIO_AFRH_AFR8_Msk
#define GPIO_AFRH_AFR8_0             (0x1UL << GPIO_AFRH_AFR8_Pos)          /*!< 0x00000001 */
#define GPIO_AFRH_AFR8_1             (0x2UL << GPIO_AFRH_AFR8_Pos)          /*!< 0x00000002 */
#define GPIO_AFRH_AFR8_2             (0x4UL << GPIO_AFRH_AFR8_Pos)          /*!< 0x00000004 */
#define GPIO_AFRH_AFR8_3             (0x8UL << GPIO_AFRH_AFR8_Pos)          /*!< 0x00000008 */
#define GPIO_AFRH_AFR9_Pos           (4U)
#define GPIO_AFRH_AFR9_Msk           (0xFUL << GPIO_AFRH_AFR9_Pos)          /*!< 0x000000F0 */
#define GPIO_AFRH_AFR9               GPIO_AFRH_AFR9_Msk
#define GPIO_AFRH_AFR9_0             (0x1UL << GPIO_AFRH_AFR9_Pos)          /*!< 0x00000010 */
#define GPIO_AFRH_AFR9_1             (0x2UL << GPIO_AFRH_AFR9_Pos)          /*!< 0x00000020 */
#define GPIO_AFRH_AFR9_2             (0x4UL << GPIO_AFRH_AFR9_Pos)          /*!< 0x00000040 */
#define GPIO_AFRH_AFR9_3             (0x8UL << GPIO_AFRH_AFR9_Pos)          /*!< 0x00000080 */
#define GPIO_AFRH_AFR10_Pos          (8U)
#define GPIO_AFRH_AFR10_Msk          (0xFUL << GPIO_AFRH_AFR10_Pos)         /*!< 0x00000F00 */
#define GPIO_AFRH_AFR10              GPIO_AFRH_AFR10_Msk
#define GPIO_AFRH_AFR10_0            (0x1UL << GPIO_AFRH_AFR10_Pos)         /*!< 0x00000100 */
#define GPIO_AFRH_AFR10_1            (0x2UL << GPIO_AFRH_AFR10_Pos)         /*!< 0x00000200 */
#define GPIO_AFRH_AFR10_2            (0x4UL << GPIO_AFRH_AFR10_Pos)         /*!< 0x00000400 */
#define GPIO_AFRH_AFR10_3            (0x8UL << GPIO_AFRH_AFR10_Pos)         /*!< 0x00000800 */
#define GPIO_AFRH_AFR11_Pos          (12U)
#define GPIO_AFRH_AFR11_Msk          (0xFUL << GPIO_AFRH_AFR11_Pos)         /*!< 0x0000F000 */
#define GPIO_AFRH_AFR11              GPIO_AFRH_AFR11_Msk
#define GPIO_AFRH_AFR11_0            (0x1UL << GPIO_AFRH_AFR11_Pos)         /*!< 0x00001000 */
#define GPIO_AFRH_AFR11_1            (0x2UL << GPIO_AFRH_AFR11_Pos)         /*!< 0x00002000 */
#define GPIO_AFRH_AFR11_2            (0x4UL << GPIO_AFRH_AFR11_Pos)         /*!< 0x00004000 */
#define GPIO_AFRH_AFR11_3            (0x8UL << GPIO_AFRH_AFR11_Pos)         /*!< 0x00008000 */
#define GPIO_AFRH_AFR12_Pos          (16U)
#define GPIO_AFRH_AFR12_Msk          (0xFUL << GPIO_AFRH_AFR12_Pos)         /*!< 0x000F0000 */
#define GPIO_AFRH_AFR12              GPIO_AFRH_AFR12_Msk
#define GPIO_AFRH_AFR12_0            (0x1UL << GPIO_AFRH_AFR12_Pos)         /*!< 0x00010000 */
#define GPIO_AFRH_AFR12_1            (0x2UL << GPIO_AFRH_AFR12_Pos)         /*!< 0x00020000 */
#define GPIO_AFRH_AFR12_2            (0x4UL << GPIO_AFRH_AFR12_Pos)         /*!< 0x00040000 */
#define GPIO_AFRH_AFR12_3            (0x8UL << GPIO_AFRH_AFR12_Pos)         /*!< 0x00080000 */
#define GPIO_AFRH_AFR13_Pos          (20U)
#define GPIO_AFRH_AFR13_Msk          (0xFUL << GPIO_AFRH_AFR13_Pos)         /*!< 0x00F00000 */
#define GPIO_AFRH_AFR13              GPIO_AFRH_AFR13_Msk
#define GPIO_AFRH_AFR13_0            (0x1UL << GPIO_AFRH_AFR13_Pos)         /*!< 0x00100000 */
#define GPIO_AFRH_AFR13_1            (0x2UL << GPIO_AFRH_AFR13_Pos)         /*!< 0x00200000 */
#define GPIO_AFRH_AFR13_2            (0x4UL << GPIO_AFRH_AFR13_Pos)         /*!< 0x00400000 */
#define GPIO_AFRH_AFR13_3            (0x8UL << GPIO_AFRH_AFR13_Pos)         /*!< 0x00800000 */
#define GPIO_AFRH_AFR14_Pos          (24U)
#define GPIO_AFRH_AFR14_Msk          (0xFUL << GPIO_AFRH_AFR14_Pos)         /*!< 0x0F000000 */
#define GPIO_AFRH_AFR14              GPIO_AFRH_AFR14_Msk
#define GPIO_AFRH_AFR14_0            (0x1UL << GPIO_AFRH_AFR14_Pos)         /*!< 0x01000000 */
#define GPIO_AFRH_AFR14_1            (0x2UL << GPIO_AFRH_AFR14_Pos)         /*!< 0x02000000 */
#define GPIO_AFRH_AFR14_2            (0x4UL << GPIO_AFRH_AFR14_Pos)         /*!< 0x04000000 */
#define GPIO_AFRH_AFR14_3            (0x8UL << GPIO_AFRH_AFR14_Pos)         /*!< 0x08000000 */
#define GPIO_AFRH_AFR15_Pos          (28U)
#define GPIO_AFRH_AFR15_Msk          (0xFUL << GPIO_AFRH_AFR15_Pos)         /*!< 0xF0000000 */
#define GPIO_AFRH_AFR15              GPIO_AFRH_AFR15_Msk
#define GPIO_AFRH_AFR15_0            (0x1UL << GPIO_AFRH_AFR15_Pos)         /*!< 0x10000000 */
#define GPIO_AFRH_AFR15_1            (0x2UL << GPIO_AFRH_AFR15_Pos)         /*!< 0x20000000 */
#define GPIO_AFRH_AFR15_2            (0x4UL << GPIO_AFRH_AFR15_Pos)         /*!< 0x40000000 */
#define GPIO_AFRH_AFR15_3            (0x8UL << GPIO_AFRH_AFR15_Pos)         /*!< 0x80000000 */

/******************  Bits definition for GPIO_BRR register  ******************/
#define GPIO_BRR_BR0_Pos               (0U)
#define GPIO_BRR_BR0_Msk               (0x1UL << GPIO_BRR_BR0_Pos)              /*!< 0x00000001 */
#define GPIO_BRR_BR0                   GPIO_BRR_BR0_Msk
#define GPIO_BRR_BR1_Pos               (1U)
#define GPIO_BRR_BR1_Msk               (0x1UL << GPIO_BRR_BR1_Pos)              /*!< 0x00000002 */
#define GPIO_BRR_BR1                   GPIO_BRR_BR1_Msk
#define GPIO_BRR_BR2_Pos               (2U)
#define GPIO_BRR_BR2_Msk               (0x1UL << GPIO_BRR_BR2_Pos)              /*!< 0x00000004 */
#define GPIO_BRR_BR2                   GPIO_BRR_BR2_Msk
#define GPIO_BRR_BR3_Pos               (3U)
#define GPIO_BRR_BR3_Msk               (0x1UL << GPIO_BRR_BR3_Pos)              /*!< 0x00000008 */
#define GPIO_BRR_BR3                   GPIO_BRR_BR3_Msk
#define GPIO_BRR_BR4_Pos               (4U)
#define GPIO_BRR_BR4_Msk               (0x1UL << GPIO_BRR_BR4_Pos)              /*!< 0x00000010 */
#define GPIO_BRR_BR4                   GPIO_BRR_BR4_Msk
#define GPIO_BRR_BR5_Pos               (5U)
#define GPIO_BRR_BR5_Msk               (0x1UL << GPIO_BRR_BR5_Pos)              /*!< 0x00000020 */
#define GPIO_BRR_BR5                   GPIO_BRR_BR5_Msk
#define GPIO_BRR_BR6_Pos               (6U)
#define GPIO_BRR_BR6_Msk               (0x1UL << GPIO_BRR_BR6_Pos)              /*!< 0x00000040 */
#define GPIO_BRR_BR6                   GPIO_BRR_BR6_Msk
#define GPIO_BRR_BR7_Pos               (7U)
#define GPIO_BRR_BR7_Msk               (0x1UL << GPIO_BRR_BR7_Pos)              /*!< 0x00000080 */
#define GPIO_BRR_BR7                   GPIO_BRR_BR7_Msk
#define GPIO_BRR_BR8_Pos               (8U)
#define GPIO_BRR_BR8_Msk               (0x1UL << GPIO_BRR_BR8_Pos)              /*!< 0x00000100 */
#define GPIO_BRR_BR8                   GPIO_BRR_BR8_Msk
#define GPIO_BRR_BR9_Pos               (9U)
#define GPIO_BRR_BR9_Msk               (0x1UL << GPIO_BRR_BR9_Pos)              /*!< 0x00000200 */
#define GPIO_BRR_BR9                   GPIO_BRR_BR9_Msk
#define GPIO_BRR_BR10_Pos              (10U)
#define GPIO_BRR_BR10_Msk              (0x1UL << GPIO_BRR_BR10_Pos)             /*!< 0x00000400 */
#define GPIO_BRR_BR10                  GPIO_BRR_BR10_Msk
#define GPIO_BRR_BR11_Pos              (11U)
#define GPIO_BRR_BR11_Msk              (0x1UL << GPIO_BRR_BR11_Pos)             /*!< 0x00000800 */
#define GPIO_BRR_BR11                  GPIO_BRR_BR11_Msk
#define GPIO_BRR_BR12_Pos              (12U)
#define GPIO_BRR_BR12_Msk              (0x1UL << GPIO_BRR_BR12_Pos)             /*!< 0x00001000 */
#define GPIO_BRR_BR12                  GPIO_BRR_BR12_Msk
#define GPIO_BRR_BR13_Pos              (13U)
#define GPIO_BRR_BR13_Msk              (0x1UL << GPIO_BRR_BR13_Pos)             /*!< 0x00002000 */
#define GPIO_BRR_BR13                  GPIO_BRR_BR13_Msk
#define GPIO_BRR_BR14_Pos              (14U)
#define GPIO_BRR_BR14_Msk              (0x1UL << GPIO_BRR_BR14_Pos)             /*!< 0x00004000 */
#define GPIO_BRR_BR14                  GPIO_BRR_BR14_Msk
#define GPIO_BRR_BR15_Pos              (15U)
#define GPIO_BRR_BR15_Msk              (0x1UL << GPIO_BRR_BR15_Pos)             /*!< 0x00008000 */
#define GPIO_BRR_BR15                  GPIO_BRR_BR15_Msk

/******************  Bits definition for GPIO_SECCFGR register  ******************/
#define GPIO_SECCFGR_SEC0_Pos            (0U)
#define GPIO_SECCFGR_SEC0_Msk            (0x1UL << GPIO_SECCFGR_SEC0_Pos)           /*!< 0x00000001 */
#define GPIO_SECCFGR_SEC0                GPIO_SECCFGR_SEC0_Msk
#define GPIO_SECCFGR_SEC1_Pos            (1U)
#define GPIO_SECCFGR_SEC1_Msk            (0x1UL << GPIO_SECCFGR_SEC1_Pos)           /*!< 0x00000002 */
#define GPIO_SECCFGR_SEC1                GPIO_SECCFGR_SEC1_Msk
#define GPIO_SECCFGR_SEC2_Pos            (2U)
#define GPIO_SECCFGR_SEC2_Msk            (0x1UL << GPIO_SECCFGR_SEC2_Pos)           /*!< 0x00000004 */
#define GPIO_SECCFGR_SEC2                GPIO_SECCFGR_SEC2_Msk
#define GPIO_SECCFGR_SEC3_Pos            (3U)
#define GPIO_SECCFGR_SEC3_Msk            (0x1UL << GPIO_SECCFGR_SEC3_Pos)           /*!< 0x00000008 */
#define GPIO_SECCFGR_SEC3                GPIO_SECCFGR_SEC3_Msk
#define GPIO_SECCFGR_SEC4_Pos            (4U)
#define GPIO_SECCFGR_SEC4_Msk            (0x1UL << GPIO_SECCFGR_SEC4_Pos)           /*!< 0x00000010 */
#define GPIO_SECCFGR_SEC4                GPIO_SECCFGR_SEC4_Msk
#define GPIO_SECCFGR_SEC5_Pos            (5U)
#define GPIO_SECCFGR_SEC5_Msk            (0x1UL << GPIO_SECCFGR_SEC5_Pos)           /*!< 0x00000020 */
#define GPIO_SECCFGR_SEC5                GPIO_SECCFGR_SEC5_Msk
#define GPIO_SECCFGR_SEC6_Pos            (6U)
#define GPIO_SECCFGR_SEC6_Msk            (0x1UL << GPIO_SECCFGR_SEC6_Pos)           /*!< 0x00000040 */
#define GPIO_SECCFGR_SEC6                GPIO_SECCFGR_SEC6_Msk
#define GPIO_SECCFGR_SEC7_Pos            (7U)
#define GPIO_SECCFGR_SEC7_Msk            (0x1UL << GPIO_SECCFGR_SEC7_Pos)           /*!< 0x00000080 */
#define GPIO_SECCFGR_SEC7                GPIO_SECCFGR_SEC7_Msk

/***************  Bit definition for GPIO_HWCFGR10 register  ****************/
#define GPIO_HWCFGR10_AHB_IOP_Pos     (0U)
#define GPIO_HWCFGR10_AHB_IOP_Msk     (0xFUL << GPIO_HWCFGR10_AHB_IOP_Pos)   /*!< 0x0000000F */
#define GPIO_HWCFGR10_AHB_IOP         GPIO_HWCFGR10_AHB_IOP_Msk             /*!< Bus interface configuration */
#define GPIO_HWCFGR10_AHB_IOP_0       (0x1UL << GPIO_HWCFGR10_AHB_IOP_Pos)   /*!< 0x00000001 */
#define GPIO_HWCFGR10_AHB_IOP_1       (0x2UL << GPIO_HWCFGR10_AHB_IOP_Pos)   /*!< 0x00000002 */
#define GPIO_HWCFGR10_AHB_IOP_2       (0x4UL << GPIO_HWCFGR10_AHB_IOP_Pos)   /*!< 0x00000004 */
#define GPIO_HWCFGR10_AHB_IOP_3       (0x8UL << GPIO_HWCFGR10_AHB_IOP_Pos)   /*!< 0x00000008 */
#define GPIO_HWCFGR10_AF_SIZE_Pos     (4U)
#define GPIO_HWCFGR10_AF_SIZE_Msk     (0xFUL << GPIO_HWCFGR10_AF_SIZE_Pos)   /*!< 0x000000F0 */
#define GPIO_HWCFGR10_AF_SIZE         GPIO_HWCFGR10_AF_SIZE_Msk             /*!< Number of AF available for each I/O */
#define GPIO_HWCFGR10_AF_SIZE_0       (0x1UL << GPIO_HWCFGR10_AF_SIZE_Pos)   /*!< 0x00000010 */
#define GPIO_HWCFGR10_AF_SIZE_1       (0x2UL << GPIO_HWCFGR10_AF_SIZE_Pos)   /*!< 0x00000020 */
#define GPIO_HWCFGR10_AF_SIZE_2       (0x4UL << GPIO_HWCFGR10_AF_SIZE_Pos)   /*!< 0x00000040 */
#define GPIO_HWCFGR10_AF_SIZE_3       (0x8UL << GPIO_HWCFGR10_AF_SIZE_Pos)   /*!< 0x00000080 */
#define GPIO_HWCFGR10_SPEED_CFG_Pos   (8U)
#define GPIO_HWCFGR10_SPEED_CFG_Msk   (0xFUL << GPIO_HWCFGR10_SPEED_CFG_Pos) /*!< 0x00000F00 */
#define GPIO_HWCFGR10_SPEED_CFG       GPIO_HWCFGR10_SPEED_CFG_Msk           /*!< Number of speed lines for each I/O */
#define GPIO_HWCFGR10_SPEED_CFG_0     (0x1UL << GPIO_HWCFGR10_SPEED_CFG_Pos) /*!< 0x00000100 */
#define GPIO_HWCFGR10_SPEED_CFG_1     (0x2UL << GPIO_HWCFGR10_SPEED_CFG_Pos) /*!< 0x00000200 */
#define GPIO_HWCFGR10_SPEED_CFG_2     (0x4UL << GPIO_HWCFGR10_SPEED_CFG_Pos) /*!< 0x00000400 */
#define GPIO_HWCFGR10_SPEED_CFG_3     (0x8UL << GPIO_HWCFGR10_SPEED_CFG_Pos) /*!< 0x00000800 */
#define GPIO_HWCFGR10_LOCK_CFG_Pos    (12U)
#define GPIO_HWCFGR10_LOCK_CFG_Msk    (0xFUL << GPIO_HWCFGR10_LOCK_CFG_Pos)  /*!< 0x0000F000 */
#define GPIO_HWCFGR10_LOCK_CFG        GPIO_HWCFGR10_LOCK_CFG_Msk            /*!< Lock mechanism activation */
#define GPIO_HWCFGR10_LOCK_CFG_0      (0x1UL << GPIO_HWCFGR10_LOCK_CFG_Pos)  /*!< 0x00001000 */
#define GPIO_HWCFGR10_LOCK_CFG_1      (0x2UL << GPIO_HWCFGR10_LOCK_CFG_Pos)  /*!< 0x00002000 */
#define GPIO_HWCFGR10_LOCK_CFG_2      (0x4UL << GPIO_HWCFGR10_LOCK_CFG_Pos)  /*!< 0x00004000 */
#define GPIO_HWCFGR10_LOCK_CFG_3      (0x8UL << GPIO_HWCFGR10_LOCK_CFG_Pos)  /*!< 0x00008000 */
#define GPIO_HWCFGR10_SEC_CFG_Pos     (16U)
#define GPIO_HWCFGR10_SEC_CFG_Msk     (0xFUL << GPIO_HWCFGR10_SEC_CFG_Pos)   /*!< 0x000F0000 */
#define GPIO_HWCFGR10_SEC_CFG         GPIO_HWCFGR10_SEC_CFG_Msk             /*!< Security mechanism activation */
#define GPIO_HWCFGR10_SEC_CFG_0       (0x1UL << GPIO_HWCFGR10_SEC_CFG_Pos)   /*!< 0x00010000 */
#define GPIO_HWCFGR10_SEC_CFG_1       (0x2UL << GPIO_HWCFGR10_SEC_CFG_Pos)   /*!< 0x00020000 */
#define GPIO_HWCFGR10_SEC_CFG_2       (0x4UL << GPIO_HWCFGR10_SEC_CFG_Pos)   /*!< 0x00040000 */
#define GPIO_HWCFGR10_SEC_CFG_3       (0x8UL << GPIO_HWCFGR10_SEC_CFG_Pos)   /*!< 0x00080000 */
#define GPIO_HWCFGR10_OR_CFG_Pos      (20U)
#define GPIO_HWCFGR10_OR_CFG_Msk      (0xFUL << GPIO_HWCFGR10_OR_CFG_Pos)    /*!< 0x00F00000 */
#define GPIO_HWCFGR10_OR_CFG          GPIO_HWCFGR10_OR_CFG_Msk              /*!< Option register configuration */
#define GPIO_HWCFGR10_OR_CFG_0        (0x1UL << GPIO_HWCFGR10_OR_CFG_Pos)    /*!< 0x00100000 */
#define GPIO_HWCFGR10_OR_CFG_1        (0x2UL << GPIO_HWCFGR10_OR_CFG_Pos)    /*!< 0x00200000 */
#define GPIO_HWCFGR10_OR_CFG_2        (0x4UL << GPIO_HWCFGR10_OR_CFG_Pos)    /*!< 0x00400000 */
#define GPIO_HWCFGR10_OR_CFG_3        (0x8UL << GPIO_HWCFGR10_OR_CFG_Pos)    /*!< 0x00800000 */

