zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/* Montgomery multiplication output data */
#define PKA_MONTGOMERY_MUL_OUT_RESULT             ((0xE78U - PKA_RAM_OFFSET)>>2)   /*!< Output result */

/* Generic Arithmetic input data */
#define PKA_ARITHMETIC_ALL_OPS_NB_BITS            ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input operand number of bits */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP1             ((0xA50U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op1 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP2             ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op2 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP3             ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input operand op2 */

/* Generic Arithmetic output data */
#define PKA_ARITHMETIC_ALL_OPS_OUT_RESULT         ((0xE78U - PKA_RAM_OFFSET)>>2)   /*!< Output result */

/* PKA functions list */
#define PKA_DEFINE_IN_CMSIS               (1U)                    /*!< i.e. PKA operation define are in CMSIS device not in PKA_HAL header */

#define PKA_MODE_MODULAR_EXP              ((uint32_t)0x00000000U) /*!< Compute Montgomery parameter and modular exponentiation */
#define PKA_MODE_MONTGOMERY_PARAM         ((uint32_t)0x00000001U) /*!< Compute Montgomery parameter only */
#define PKA_MODE_MODULAR_EXP_FAST_MODE    ((uint32_t)0x00000002U) /*!< Compute modular exponentiation only (fast, Montgomery parameter should be loaded) */
#define PKA_MODE_MODULAR_EXP_PROTECT      ((uint32_t)0x00000003U) /*!< Compute modular exponentiation protected */
#define PKA_MODE_RSA_CRT_EXP              ((uint32_t)0x00000007U) /*!< RSA CRT exponentiation */
#define PKA_MODE_MODULAR_INV              ((uint32_t)0x00000008U) /*!< Modular inversion */
#define PKA_MODE_ARITHMETIC_ADD           ((uint32_t)0x00000009U) /*!< Arithmetic addition */
#define PKA_MODE_ARITHMETIC_SUB           ((uint32_t)0x0000000AU) /*!< Arithmetic subtraction */
#define PKA_MODE_ARITHMETIC_MUL           ((uint32_t)0x0000000BU) /*!< Arithmetic multiplication */
#define PKA_MODE_COMPARISON               ((uint32_t)0x0000000CU) /*!< Comparison */
#define PKA_MODE_MODULAR_RED              ((uint32_t)0x0000000DU) /*!< Modular reduction */
#define PKA_MODE_MODULAR_ADD              ((uint32_t)0x0000000EU) /*!< Modular addition */
#define PKA_MODE_MODULAR_SUB              ((uint32_t)0x0000000FU) /*!< Modular subtraction */
#define PKA_MODE_MONTGOMERY_MUL           ((uint32_t)0x00000010U) /*!< Montgomery multiplication */
#define PKA_MODE_ECC_MUL                  ((uint32_t)0x00000020U) /*!< Compute ECC Fp scalar multiplication */
#define PKA_MODE_ECC_COMPLETE_ADD         ((uint32_t)0x00000023U) /*!< ECC complete addition */
#define PKA_MODE_ECDSA_SIGNATURE          ((uint32_t)0x00000024U) /*!< ECDSA signature */
#define PKA_MODE_ECDSA_VERIFICATION       ((uint32_t)0x00000026U) /*!< ECDSA verification */
#define PKA_MODE_DOUBLE_BASE_LADDER       ((uint32_t)0x00000027U) /*!< ECC double base ladder  */
#define PKA_MODE_POINT_CHECK              ((uint32_t)0x00000028U) /*!< Point on elliptic curve check */
#define PKA_MODE_ECC_PROJECTIVE_AFF       ((uint32_t)0x0000002FU) /*!< ECC projective to affine */


/******************************************************************************/
/*                                                                            */
/*                                     MDMA                                   */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for MDMA_GISR0 register  ****************/
#define MDMA_GISR0_GIF0_Pos       (0U)
#define MDMA_GISR0_GIF0_Msk       (0x1UL << MDMA_GISR0_GIF0_Pos)                /*!< 0x00000001 */
#define MDMA_GISR0_GIF0           MDMA_GISR0_GIF0_Msk                          /*!< Channel 0 global interrupt flag */
#define MDMA_GISR0_GIF1_Pos       (1U)
#define MDMA_GISR0_GIF1_Msk       (0x1UL << MDMA_GISR0_GIF1_Pos)                /*!< 0x00000002 */
#define MDMA_GISR0_GIF1           MDMA_GISR0_GIF1_Msk                          /*!< Channel 1 global interrupt flag */
#define MDMA_GISR0_GIF2_Pos       (2U)
#define MDMA_GISR0_GIF2_Msk       (0x1UL << MDMA_GISR0_GIF2_Pos)                /*!< 0x00000004 */
#define MDMA_GISR0_GIF2           MDMA_GISR0_GIF2_Msk                          /*!< Channel 2 global interrupt flag */
#define MDMA_GISR0_GIF3_Pos       (3U)
#define MDMA_GISR0_GIF3_Msk       (0x1UL << MDMA_GISR0_GIF3_Pos)                /*!< 0x00000008 */
#define MDMA_GISR0_GIF3           MDMA_GISR0_GIF3_Msk                          /*!< Channel 3 global interrupt flag */
#define MDMA_GISR0_GIF4_Pos       (4U)
#define MDMA_GISR0_GIF4_Msk       (0x1UL << MDMA_GISR0_GIF4_Pos)                /*!< 0x00000010 */
#define MDMA_GISR0_GIF4           MDMA_GISR0_GIF4_Msk                          /*!< Channel 4 global interrupt flag */
#define MDMA_GISR0_GIF5_Pos       (5U)
#define MDMA_GISR0_GIF5_Msk       (0x1UL << MDMA_GISR0_GIF5_Pos)                /*!< 0x00000020 */
#define MDMA_GISR0_GIF5           MDMA_GISR0_GIF5_Msk                          /*!< Channel 5 global interrupt flag */
#define MDMA_GISR0_GIF6_Pos       (6U)
#define MDMA_GISR0_GIF6_Msk       (0x1UL << MDMA_GISR0_GIF6_Pos)                /*!< 0x00000040 */
#define MDMA_GISR0_GIF6           MDMA_GISR0_GIF6_Msk                          /*!< Channel 6 global interrupt flag */
#define MDMA_GISR0_GIF7_Pos       (7U)
#define MDMA_GISR0_GIF7_Msk       (0x1UL << MDMA_GISR0_GIF7_Pos)                /*!< 0x00000080 */
#define MDMA_GISR0_GIF7           MDMA_GISR0_GIF7_Msk                          /*!< Channel 7 global interrupt flag */
#define MDMA_GISR0_GIF8_Pos       (8U)
#define MDMA_GISR0_GIF8_Msk       (0x1UL << MDMA_GISR0_GIF8_Pos)                /*!< 0x00000100 */
#define MDMA_GISR0_GIF8           MDMA_GISR0_GIF8_Msk                          /*!< Channel 8 global interrupt flag */
#define MDMA_GISR0_GIF9_Pos       (9U)
#define MDMA_GISR0_GIF9_Msk       (0x1UL << MDMA_GISR0_GIF9_Pos)                /*!< 0x00000200 */
#define MDMA_GISR0_GIF9           MDMA_GISR0_GIF9_Msk                          /*!< Channel 9 global interrupt flag */
#define MDMA_GISR0_GIF10_Pos      (10U)
#define MDMA_GISR0_GIF10_Msk      (0x1UL << MDMA_GISR0_GIF10_Pos)               /*!< 0x00000400 */
#define MDMA_GISR0_GIF10          MDMA_GISR0_GIF10_Msk                         /*!< Channel 10 global interrupt flag */
#define MDMA_GISR0_GIF11_Pos      (11U)
#define MDMA_GISR0_GIF11_Msk      (0x1UL << MDMA_GISR0_GIF11_Pos)               /*!< 0x00000800 */
#define MDMA_GISR0_GIF11          MDMA_GISR0_GIF11_Msk                         /*!< Channel 11 global interrupt flag */
#define MDMA_GISR0_GIF12_Pos      (12U)
#define MDMA_GISR0_GIF12_Msk      (0x1UL << MDMA_GISR0_GIF12_Pos)               /*!< 0x00001000 */
#define MDMA_GISR0_GIF12          MDMA_GISR0_GIF12_Msk                         /*!< Channel 12 global interrupt flag */
#define MDMA_GISR0_GIF13_Pos      (13U)
#define MDMA_GISR0_GIF13_Msk      (0x1UL << MDMA_GISR0_GIF13_Pos)               /*!< 0x00002000 */
#define MDMA_GISR0_GIF13          MDMA_GISR0_GIF13_Msk                         /*!< Channel 13 global interrupt flag */
#define MDMA_GISR0_GIF14_Pos      (14U)
#define MDMA_GISR0_GIF14_Msk      (0x1UL << MDMA_GISR0_GIF14_Pos)               /*!< 0x00004000 */
#define MDMA_GISR0_GIF14          MDMA_GISR0_GIF14_Msk                         /*!< Channel 14 global interrupt flag */
#define MDMA_GISR0_GIF15_Pos      (15U)
#define MDMA_GISR0_GIF15_Msk      (0x1UL << MDMA_GISR0_GIF15_Pos)               /*!< 0x00008000 */
#define MDMA_GISR0_GIF15          MDMA_GISR0_GIF15_Msk                         /*!< Channel 15 global interrupt flag */
#define MDMA_GISR0_GIF16_Pos      (16U)
#define MDMA_GISR0_GIF16_Msk      (0x1UL << MDMA_GISR0_GIF16_Pos)               /*!< 0x00010000 */
#define MDMA_GISR0_GIF16          MDMA_GISR0_GIF16_Msk                         /*!< Channel 16 global interrupt flag */
#define MDMA_GISR0_GIF17_Pos      (17U)
#define MDMA_GISR0_GIF17_Msk      (0x1UL << MDMA_GISR0_GIF17_Pos)               /*!< 0x00020000 */
#define MDMA_GISR0_GIF17          MDMA_GISR0_GIF17_Msk                         /*!< Channel 17 global interrupt flag */
#define MDMA_GISR0_GIF18_Pos      (18U)
#define MDMA_GISR0_GIF18_Msk      (0x1UL << MDMA_GISR0_GIF18_Pos)               /*!< 0x00040000 */
#define MDMA_GISR0_GIF18          MDMA_GISR0_GIF18_Msk                         /*!< Channel 18 global interrupt flag */
#define MDMA_GISR0_GIF19_Pos      (19U)
#define MDMA_GISR0_GIF19_Msk      (0x1UL << MDMA_GISR0_GIF19_Pos)               /*!< 0x00080000 */
#define MDMA_GISR0_GIF19          MDMA_GISR0_GIF19_Msk                         /*!< Channel 19 global interrupt flag */
#define MDMA_GISR0_GIF20_Pos      (20U)
#define MDMA_GISR0_GIF20_Msk      (0x1UL << MDMA_GISR0_GIF20_Pos)               /*!< 0x00100000 */
#define MDMA_GISR0_GIF20          MDMA_GISR0_GIF20_Msk                         /*!< Channel 20 global interrupt flag */
#define MDMA_GISR0_GIF21_Pos      (21U)
#define MDMA_GISR0_GIF21_Msk      (0x1UL << MDMA_GISR0_GIF21_Pos)               /*!< 0x00200000 */
#define MDMA_GISR0_GIF21          MDMA_GISR0_GIF21_Msk                         /*!< Channel 21 global interrupt flag */
#define MDMA_GISR0_GIF22_Pos      (22U)
#define MDMA_GISR0_GIF22_Msk      (0x1UL << MDMA_GISR0_GIF22_Pos)               /*!< 0x00400000 */
#define MDMA_GISR0_GIF22          MDMA_GISR0_GIF22_Msk                         /*!< Channel 22 global interrupt flag */
#define MDMA_GISR0_GIF23_Pos      (23U)
#define MDMA_GISR0_GIF23_Msk      (0x1UL << MDMA_GISR0_GIF23_Pos)               /*!< 0x00800000 */
#define MDMA_GISR0_GIF23          MDMA_GISR0_GIF23_Msk                         /*!< Channel 23 global interrupt flag */
#define MDMA_GISR0_GIF24_Pos      (24U)
#define MDMA_GISR0_GIF24_Msk      (0x1UL << MDMA_GISR0_GIF24_Pos)               /*!< 0x01000000 */
#define MDMA_GISR0_GIF24          MDMA_GISR0_GIF24_Msk                         /*!< Channel 24 global interrupt flag */
#define MDMA_GISR0_GIF25_Pos      (25U)
#define MDMA_GISR0_GIF25_Msk      (0x1UL << MDMA_GISR0_GIF25_Pos)               /*!< 0x02000000 */
#define MDMA_GISR0_GIF25          MDMA_GISR0_GIF25_Msk                         /*!< Channel 25 global interrupt flag */
#define MDMA_GISR0_GIF26_Pos      (26U)
#define MDMA_GISR0_GIF26_Msk      (0x1UL << MDMA_GISR0_GIF26_Pos)               /*!< 0x04000000 */
#define MDMA_GISR0_GIF26          MDMA_GISR0_GIF26_Msk                         /*!< Channel 26 global interrupt flag */
#define MDMA_GISR0_GIF27_Pos      (27U)
#define MDMA_GISR0_GIF27_Msk      (0x1UL << MDMA_GISR0_GIF27_Pos)               /*!< 0x08000000 */
#define MDMA_GISR0_GIF27          MDMA_GISR0_GIF27_Msk                         /*!< Channel 27 global interrupt flag */
#define MDMA_GISR0_GIF28_Pos      (28U)
#define MDMA_GISR0_GIF28_Msk      (0x1UL << MDMA_GISR0_GIF28_Pos)               /*!< 0x10000000 */
#define MDMA_GISR0_GIF28          MDMA_GISR0_GIF28_Msk                         /*!< Channel 28 global interrupt flag */
#define MDMA_GISR0_GIF29_Pos      (29U)
#define MDMA_GISR0_GIF29_Msk      (0x1UL << MDMA_GISR0_GIF29_Pos)               /*!< 0x20000000 */
#define MDMA_GISR0_GIF29          MDMA_GISR0_GIF29_Msk                         /*!< Channel 29 global interrupt flag */
#define MDMA_GISR0_GIF30_Pos      (30U)
#define MDMA_GISR0_GIF30_Msk      (0x1UL << MDMA_GISR0_GIF30_Pos)               /*!< 0x40000000 */
#define MDMA_GISR0_GIF30          MDMA_GISR0_GIF30_Msk                         /*!< Channel 30 global interrupt flag */
#define MDMA_GISR0_GIF31_Pos      (31U)
#define MDMA_GISR0_GIF31_Msk      (0x1UL << MDMA_GISR0_GIF31_Pos)               /*!< 0x80000000 */
#define MDMA_GISR0_GIF31          MDMA_GISR0_GIF31_Msk                         /*!< Channel 31 global interrupt flag */

/********************  Bit definition for MDMA_GISR1 register  ****************/
#define MDMA_GISR1_GIF32_Pos      (0U)
#define MDMA_GISR1_GIF32_Msk      (0x1UL << MDMA_GISR1_GIF32_Pos)               /*!< 0x00000001 */
#define MDMA_GISR1_GIF32          MDMA_GISR1_GIF32_Msk                         /*!< Channel 32 global interrupt flag */
#define MDMA_GISR1_GIF33_Pos      (1U)
#define MDMA_GISR1_GIF33_Msk      (0x1UL << MDMA_GISR1_GIF33_Pos)               /*!< 0x00000002 */
#define MDMA_GISR1_GIF33          MDMA_GISR1_GIF33_Msk                         /*!< Channel 33 global interrupt flag */
#define MDMA_GISR1_GIF34_Pos      (2U)
#define MDMA_GISR1_GIF34_Msk      (0x1UL << MDMA_GISR1_GIF34_Pos)               /*!< 0x00000004 */
#define MDMA_GISR1_GIF34          MDMA_GISR1_GIF34_Msk                         /*!< Channel 34 global interrupt flag */
#define MDMA_GISR1_GIF35_Pos      (3U)
#define MDMA_GISR1_GIF35_Msk      (0x1UL << MDMA_GISR1_GIF35_Pos)               /*!< 0x00000008 */
#define MDMA_GISR1_GIF35          MDMA_GISR1_GIF35_Msk                         /*!< Channel 35 global interrupt flag */
#define MDMA_GISR1_GIF36_Pos      (4U)
#define MDMA_GISR1_GIF36_Msk      (0x1UL << MDMA_GISR1_GIF36_Pos)               /*!< 0x00000010 */
#define MDMA_GISR1_GIF36          MDMA_GISR1_GIF36_Msk                         /*!< Channel 36 global interrupt flag */
#define MDMA_GISR1_GIF37_Pos      (5U)
#define MDMA_GISR1_GIF37_Msk      (0x1UL << MDMA_GISR1_GIF37_Pos)               /*!< 0x00000020 */
#define MDMA_GISR1_GIF37          MDMA_GISR1_GIF37_Msk                         /*!< Channel 37 global interrupt flag */
#define MDMA_GISR1_GIF38_Pos      (6U)
#define MDMA_GISR1_GIF38_Msk      (0x1UL << MDMA_GISR1_GIF38_Pos)               /*!< 0x00000040 */
#define MDMA_GISR1_GIF38          MDMA_GISR1_GIF38_Msk                         /*!< Channel 38 global interrupt flag */
#define MDMA_GISR1_GIF39_Pos      (7U)
#define MDMA_GISR1_GIF39_Msk      (0x1UL << MDMA_GISR1_GIF39_Pos)               /*!< 0x00000080 */
#define MDMA_GISR1_GIF39          MDMA_GISR1_GIF39_Msk                         /*!< Channel 39 global interrupt flag */
#define MDMA_GISR1_GIF40_Pos      (8U)
#define MDMA_GISR1_GIF40_Msk      (0x1UL << MDMA_GISR1_GIF40_Pos)               /*!< 0x00000100 */
#define MDMA_GISR1_GIF40          MDMA_GISR1_GIF40_Msk                         /*!< Channel 40 global interrupt flag */
#define MDMA_GISR1_GIF41_Pos      (9U)
#define MDMA_GISR1_GIF41_Msk      (0x1UL << MDMA_GISR1_GIF41_Pos)               /*!< 0x00000200 */
#define MDMA_GISR1_GIF41          MDMA_GISR1_GIF41_Msk                         /*!< Channel 41 global interrupt flag */
#define MDMA_GISR1_GIF42_Pos      (10U)
#define MDMA_GISR1_GIF42_Msk      (0x1UL << MDMA_GISR1_GIF42_Pos)               /*!< 0x00000400 */
#define MDMA_GISR1_GIF42          MDMA_GISR1_GIF42_Msk                         /*!< Channel 42 global interrupt flag */
#define MDMA_GISR1_GIF43_Pos      (11U)
#define MDMA_GISR1_GIF43_Msk      (0x1UL << MDMA_GISR1_GIF43_Pos)               /*!< 0x00000800 */
#define MDMA_GISR1_GIF43          MDMA_GISR1_GIF43_Msk                         /*!< Channel 43 global interrupt flag */
#define MDMA_GISR1_GIF44_Pos      (12U)
#define MDMA_GISR1_GIF44_Msk      (0x1UL << MDMA_GISR1_GIF44_Pos)               /*!< 0x00001000 */
#define MDMA_GISR1_GIF44          MDMA_GISR1_GIF44_Msk                         /*!< Channel 44 global interrupt flag */
#define MDMA_GISR1_GIF45_Pos      (13U)
#define MDMA_GISR1_GIF45_Msk      (0x1UL << MDMA_GISR1_GIF45_Pos)               /*!< 0x00002000 */
#define MDMA_GISR1_GIF45          MDMA_GISR1_GIF45_Msk                         /*!< Channel 45 global interrupt flag */
#define MDMA_GISR1_GIF46_Pos      (14U)
#define MDMA_GISR1_GIF46_Msk      (0x1UL << MDMA_GISR1_GIF46_Pos)               /*!< 0x00004000 */
#define MDMA_GISR1_GIF46          MDMA_GISR1_GIF46_Msk                         /*!< Channel 46 global interrupt flag */
#define MDMA_GISR1_GIF47_Pos      (15U)
#define MDMA_GISR1_GIF47_Msk      (0x1UL << MDMA_GISR1_GIF47_Pos)               /*!< 0x00008000 */
#define MDMA_GISR1_GIF47          MDMA_GISR1_GIF47_Msk                         /*!< Channel 47 global interrupt flag */
#define MDMA_GISR1_GIF48_Pos      (16U)
#define MDMA_GISR1_GIF48_Msk      (0x1UL << MDMA_GISR1_GIF48_Pos)               /*!< 0x00010000 */
#define MDMA_GISR1_GIF48          MDMA_GISR1_GIF48_Msk                         /*!< Channel 48 global interrupt flag */
#define MDMA_GISR1_GIF49_Pos      (17U)
#define MDMA_GISR1_GIF49_Msk      (0x1UL << MDMA_GISR1_GIF49_Pos)               /*!< 0x00020000 */
#define MDMA_GISR1_GIF49          MDMA_GISR1_GIF49_Msk                         /*!< Channel 49 global interrupt flag */
#define MDMA_GISR1_GIF50_Pos      (18U)
#define MDMA_GISR1_GIF50_Msk      (0x1UL << MDMA_GISR1_GIF50_Pos)               /*!< 0x00040000 */
#define MDMA_GISR1_GIF50          MDMA_GISR1_GIF50_Msk                         /*!< Channel 50 global interrupt flag */
#define MDMA_GISR1_GIF51_Pos      (19U)
#define MDMA_GISR1_GIF51_Msk      (0x1UL << MDMA_GISR1_GIF51_Pos)               /*!< 0x00080000 */
#define MDMA_GISR1_GIF51          MDMA_GISR1_GIF51_Msk                         /*!< Channel 51 global interrupt flag */
#define MDMA_GISR1_GIF52_Pos      (20U)
#define MDMA_GISR1_GIF52_Msk      (0x1UL << MDMA_GISR1_GIF52_Pos)               /*!< 0x00100000 */
#define MDMA_GISR1_GIF52          MDMA_GISR1_GIF52_Msk                         /*!< Channel 52 global interrupt flag */
#define MDMA_GISR1_GIF53_Pos      (21U)
#define MDMA_GISR1_GIF53_Msk      (0x1UL << MDMA_GISR1_GIF53_Pos)               /*!< 0x00200000 */
#define MDMA_GISR1_GIF53          MDMA_GISR1_GIF53_Msk                         /*!< Channel 53 global interrupt flag */
#define MDMA_GISR1_GIF54_Pos      (22U)
#define MDMA_GISR1_GIF54_Msk      (0x1UL << MDMA_GISR1_GIF54_Pos)               /*!< 0x00400000 */
#define MDMA_GISR1_GIF54          MDMA_GISR1_GIF54_Msk                         /*!< Channel 54 global interrupt flag */
#define MDMA_GISR1_GIF55_Pos      (23U)
#define MDMA_GISR1_GIF55_Msk      (0x1UL << MDMA_GISR1_GIF55_Pos)               /*!< 0x00800000 */
#define MDMA_GISR1_GIF55          MDMA_GISR1_GIF55_Msk                         /*!< Channel 55 global interrupt flag */
#define MDMA_GISR1_GIF56_Pos      (24U)
#define MDMA_GISR1_GIF56_Msk      (0x1UL << MDMA_GISR1_GIF56_Pos)               /*!< 0x01000000 */
#define MDMA_GISR1_GIF56          MDMA_GISR1_GIF56_Msk                         /*!< Channel 56 global interrupt flag */
#define MDMA_GISR1_GIF57_Pos      (25U)
#define MDMA_GISR1_GIF57_Msk      (0x1UL << MDMA_GISR1_GIF57_Pos)               /*!< 0x02000000 */
#define MDMA_GISR1_GIF57          MDMA_GISR1_GIF57_Msk                         /*!< Channel 57 global interrupt flag */
#define MDMA_GISR1_GIF58_Pos      (26U)
#define MDMA_GISR1_GIF58_Msk      (0x1UL << MDMA_GISR1_GIF58_Pos)               /*!< 0x04000000 */
#define MDMA_GISR1_GIF58          MDMA_GISR1_GIF58_Msk                         /*!< Channel 58 global interrupt flag */
#define MDMA_GISR1_GIF59_Pos      (27U)
#define MDMA_GISR1_GIF59_Msk      (0x1UL << MDMA_GISR1_GIF59_Pos)               /*!< 0x08000000 */
#define MDMA_GISR1_GIF59          MDMA_GISR1_GIF59_Msk                         /*!< Channel 59 global interrupt flag */
#define MDMA_GISR1_GIF60_Pos      (28U)
#define MDMA_GISR1_GIF60_Msk      (0x1UL << MDMA_GISR1_GIF60_Pos)               /*!< 0x10000000 */
#define MDMA_GISR1_GIF60          MDMA_GISR1_GIF60_Msk                         /*!< Channel 60 global interrupt flag */
#define MDMA_GISR1_GIF61_Pos      (29U)
#define MDMA_GISR1_GIF61_Msk      (0x1UL << MDMA_GISR1_GIF61_Pos)               /*!< 0x20000000 */
#define MDMA_GISR1_GIF61          MDMA_GISR1_GIF61_Msk                         /*!< Channel 61 global interrupt flag */
#define MDMA_GISR1_GIF62_Pos      (30U)
#define MDMA_GISR1_GIF62_Msk      (0x1UL << MDMA_GISR1_GIF62_Pos)               /*!< 0x40000000 */
#define MDMA_GISR1_GIF62          MDMA_GISR1_GIF62_Msk                         /*!< Channel 62 global interrupt flag */

/********************  Bit definition for MDMA_CxISR register  ****************/
#define MDMA_CISR_TEIF_Pos        (0U)
#define MDMA_CISR_TEIF_Msk        (0x1UL << MDMA_CISR_TEIF_Pos)                 /*!< 0x00000001 */
#define MDMA_CISR_TEIF            MDMA_CISR_TEIF_Msk                           /*!< Channel x transfer error interrupt flag */
#define MDMA_CISR_CTCIF_Pos       (1U)
#define MDMA_CISR_CTCIF_Msk       (0x1UL << MDMA_CISR_CTCIF_Pos)                /*!< 0x00000002 */
#define MDMA_CISR_CTCIF           MDMA_CISR_CTCIF_Msk                          /*!< Channel x Channel Transfer Complete interrupt flag */
#define MDMA_CISR_BRTIF_Pos       (2U)
#define MDMA_CISR_BRTIF_Msk       (0x1UL << MDMA_CISR_BRTIF_Pos)                /*!< 0x00000004 */
#define MDMA_CISR_BRTIF           MDMA_CISR_BRTIF_Msk                          /*!< Channel x block repeat transfer complete interrupt flag */
#define MDMA_CISR_BTIF_Pos        (3U)
#define MDMA_CISR_BTIF_Msk        (0x1UL << MDMA_CISR_BTIF_Pos)                 /*!< 0x00000008 */
#define MDMA_CISR_BTIF            MDMA_CISR_BTIF_Msk                           /*!< Channel x block transfer complete interrupt flag */
#define MDMA_CISR_TCIF_Pos        (4U)
#define MDMA_CISR_TCIF_Msk        (0x1UL << MDMA_CISR_TCIF_Pos)                 /*!< 0x00000010 */
#define MDMA_CISR_TCIF            MDMA_CISR_TCIF_Msk                           /*!< Channel x buffer transfer complete interrupt flag */
#define MDMA_CISR_CRQA_Pos        (16U)
#define MDMA_CISR_CRQA_Msk        (0x1UL << MDMA_CISR_CRQA_Pos)                 /*!< 0x00010000 */
#define MDMA_CISR_CRQA            MDMA_CISR_CRQA_Msk                           /*!< Channel x Request Active flag */

/********************  Bit definition for MDMA_CxIFCR register  ****************/
#define MDMA_CIFCR_CTEIF_Pos      (0U)
#define MDMA_CIFCR_CTEIF_Msk      (0x1UL << MDMA_CIFCR_CTEIF_Pos)               /*!< 0x00000001 */
#define MDMA_CIFCR_CTEIF          MDMA_CIFCR_CTEIF_Msk                         /*!< Channel x clear transfer error interrupt flag */
#define MDMA_CIFCR_CCTCIF_Pos     (1U)
#define MDMA_CIFCR_CCTCIF_Msk     (0x1UL << MDMA_CIFCR_CCTCIF_Pos)              /*!< 0x00000002 */
#define MDMA_CIFCR_CCTCIF         MDMA_CIFCR_CCTCIF_Msk                        /*!< Clear Channel transfer complete interrupt flag for channel x */
#define MDMA_CIFCR_CBRTIF_Pos     (2U)
#define MDMA_CIFCR_CBRTIF_Msk     (0x1UL << MDMA_CIFCR_CBRTIF_Pos)              /*!< 0x00000004 */
#define MDMA_CIFCR_CBRTIF         MDMA_CIFCR_CBRTIF_Msk                        /*!< Channel x clear block repeat transfer complete interrupt flag */
#define MDMA_CIFCR_CBTIF_Pos      (3U)
#define MDMA_CIFCR_CBTIF_Msk      (0x1UL << MDMA_CIFCR_CBTIF_Pos)               /*!< 0x00000008 */
#define MDMA_CIFCR_CBTIF          MDMA_CIFCR_CBTIF_Msk                         /*!< Channel x Clear block transfer complete interrupt flag */
#define MDMA_CIFCR_CLTCIF_Pos     (4U)
#define MDMA_CIFCR_CLTCIF_Msk     (0x1UL << MDMA_CIFCR_CLTCIF_Pos)              /*!< 0x00000010 */
#define MDMA_CIFCR_CLTCIF         MDMA_CIFCR_CLTCIF_Msk                        /*!< CLear Transfer buffer Complete Interrupt Flag for channel */

