zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/***************  Bit definition for RCC_AHB5RSTSETR register  ****************/
#define RCC_AHB5RSTSETR_PKARST_Pos                 (2U)
#define RCC_AHB5RSTSETR_PKARST_Msk                 (0x1UL << RCC_AHB5RSTSETR_PKARST_Pos)                /*!< 0x00000004 */
#define RCC_AHB5RSTSETR_PKARST                     RCC_AHB5RSTSETR_PKARST_Msk                          /*!< PKA block reset If PKA is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB5RSTSETR_SAESRST_Pos                (3U)
#define RCC_AHB5RSTSETR_SAESRST_Msk                (0x1UL << RCC_AHB5RSTSETR_SAESRST_Pos)               /*!< 0x00000008 */
#define RCC_AHB5RSTSETR_SAESRST                    RCC_AHB5RSTSETR_SAESRST_Msk                         /*!< SAES block reset If SAES is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB5RSTSETR_CRYP1RST_Pos               (4U)
#define RCC_AHB5RSTSETR_CRYP1RST_Msk               (0x1UL << RCC_AHB5RSTSETR_CRYP1RST_Pos)              /*!< 0x00000010 */
#define RCC_AHB5RSTSETR_CRYP1RST                   RCC_AHB5RSTSETR_CRYP1RST_Msk                        /*!< CRYP (3DES/AES) block reset If CRYP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB5RSTSETR_HASH1RST_Pos               (5U)
#define RCC_AHB5RSTSETR_HASH1RST_Msk               (0x1UL << RCC_AHB5RSTSETR_HASH1RST_Pos)              /*!< 0x00000020 */
#define RCC_AHB5RSTSETR_HASH1RST                   RCC_AHB5RSTSETR_HASH1RST_Msk                        /*!< HASH block reset If HASH is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB5RSTSETR_RNG1RST_Pos                (6U)
#define RCC_AHB5RSTSETR_RNG1RST_Msk                (0x1UL << RCC_AHB5RSTSETR_RNG1RST_Pos)               /*!< 0x00000040 */
#define RCC_AHB5RSTSETR_RNG1RST                    RCC_AHB5RSTSETR_RNG1RST_Msk                         /*!< RNG1 block reset If RNG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB5RSTSETR_AXIMCRST_Pos               (16U)
#define RCC_AHB5RSTSETR_AXIMCRST_Msk               (0x1UL << RCC_AHB5RSTSETR_AXIMCRST_Pos)              /*!< 0x00010000 */
#define RCC_AHB5RSTSETR_AXIMCRST                   RCC_AHB5RSTSETR_AXIMCRST_Msk                        /*!< AXIMC block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */

/***************  Bit definition for RCC_AHB5RSTCLRR register  ****************/
#define RCC_AHB5RSTCLRR_PKARST_Pos                 (2U)
#define RCC_AHB5RSTCLRR_PKARST_Msk                 (0x1UL << RCC_AHB5RSTCLRR_PKARST_Pos)                /*!< 0x00000004 */
#define RCC_AHB5RSTCLRR_PKARST                     RCC_AHB5RSTCLRR_PKARST_Msk                          /*!< PKA block reset If PKA is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB5RSTCLRR_SAESRST_Pos                (3U)
#define RCC_AHB5RSTCLRR_SAESRST_Msk                (0x1UL << RCC_AHB5RSTCLRR_SAESRST_Pos)               /*!< 0x00000008 */
#define RCC_AHB5RSTCLRR_SAESRST                    RCC_AHB5RSTCLRR_SAESRST_Msk                         /*!< SAES block reset If SAES is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB5RSTCLRR_CRYP1RST_Pos               (4U)
#define RCC_AHB5RSTCLRR_CRYP1RST_Msk               (0x1UL << RCC_AHB5RSTCLRR_CRYP1RST_Pos)              /*!< 0x00000010 */
#define RCC_AHB5RSTCLRR_CRYP1RST                   RCC_AHB5RSTCLRR_CRYP1RST_Msk                        /*!< CRYP (3DES/AES) block reset If CRYP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB5RSTCLRR_HASH1RST_Pos               (5U)
#define RCC_AHB5RSTCLRR_HASH1RST_Msk               (0x1UL << RCC_AHB5RSTCLRR_HASH1RST_Pos)              /*!< 0x00000020 */
#define RCC_AHB5RSTCLRR_HASH1RST                   RCC_AHB5RSTCLRR_HASH1RST_Msk                        /*!< HASH block reset If HASH is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB5RSTCLRR_RNG1RST_Pos                (6U)
#define RCC_AHB5RSTCLRR_RNG1RST_Msk                (0x1UL << RCC_AHB5RSTCLRR_RNG1RST_Pos)               /*!< 0x00000040 */
#define RCC_AHB5RSTCLRR_RNG1RST                    RCC_AHB5RSTCLRR_RNG1RST_Msk                         /*!< RNG1 block reset If RNG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB5RSTCLRR_AXIMCRST_Pos               (16U)
#define RCC_AHB5RSTCLRR_AXIMCRST_Msk               (0x1UL << RCC_AHB5RSTCLRR_AXIMCRST_Pos)              /*!< 0x00010000 */
#define RCC_AHB5RSTCLRR_AXIMCRST                   RCC_AHB5RSTCLRR_AXIMCRST_Msk                        /*!< AXIMC block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */

/***************  Bit definition for RCC_AHB6RSTSETR register  ****************/
#define RCC_AHB6RSTSETR_MDMARST_Pos                (0U)
#define RCC_AHB6RSTSETR_MDMARST_Msk                (0x1UL << RCC_AHB6RSTSETR_MDMARST_Pos)               /*!< 0x00000001 */
#define RCC_AHB6RSTSETR_MDMARST                    RCC_AHB6RSTSETR_MDMARST_Msk                         /*!< MDMA block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB6RSTSETR_MCERST_Pos                 (1U)
#define RCC_AHB6RSTSETR_MCERST_Msk                 (0x1UL << RCC_AHB6RSTSETR_MCERST_Pos)                /*!< 0x00000002 */
#define RCC_AHB6RSTSETR_MCERST                     RCC_AHB6RSTSETR_MCERST_Msk                          /*!< MCE block reset If MCE is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB6RSTSETR_ETH1MACRST_Pos             (10U)
#define RCC_AHB6RSTSETR_ETH1MACRST_Msk             (0x1UL << RCC_AHB6RSTSETR_ETH1MACRST_Pos)            /*!< 0x00000400 */
#define RCC_AHB6RSTSETR_ETH1MACRST                 RCC_AHB6RSTSETR_ETH1MACRST_Msk                      /*!< ETH1 MAC block reset If ETH1 MAC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB6RSTSETR_FMCRST_Pos                 (12U)
#define RCC_AHB6RSTSETR_FMCRST_Msk                 (0x1UL << RCC_AHB6RSTSETR_FMCRST_Pos)                /*!< 0x00001000 */
#define RCC_AHB6RSTSETR_FMCRST                     RCC_AHB6RSTSETR_FMCRST_Msk                          /*!< FMC block reset If FMC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB6RSTSETR_QSPIRST_Pos                (14U)
#define RCC_AHB6RSTSETR_QSPIRST_Msk                (0x1UL << RCC_AHB6RSTSETR_QSPIRST_Pos)               /*!< 0x00004000 */
#define RCC_AHB6RSTSETR_QSPIRST                    RCC_AHB6RSTSETR_QSPIRST_Msk                         /*!< QUADSPI and the QUADSPI delay block reset If QSPI is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB6RSTSETR_SDMMC1RST_Pos              (16U)
#define RCC_AHB6RSTSETR_SDMMC1RST_Msk              (0x1UL << RCC_AHB6RSTSETR_SDMMC1RST_Pos)             /*!< 0x00010000 */
#define RCC_AHB6RSTSETR_SDMMC1RST                  RCC_AHB6RSTSETR_SDMMC1RST_Msk                       /*!< SDMMC1 and the SDMMC1 delay (DLYBSD1) block reset If SDMMC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB6RSTSETR_SDMMC2RST_Pos              (17U)
#define RCC_AHB6RSTSETR_SDMMC2RST_Msk              (0x1UL << RCC_AHB6RSTSETR_SDMMC2RST_Pos)             /*!< 0x00020000 */
#define RCC_AHB6RSTSETR_SDMMC2RST                  RCC_AHB6RSTSETR_SDMMC2RST_Msk                       /*!< SDMMC2 and the SDMMC2 delay (DLYBSD2) block reset If SDMMC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_AHB6RSTSETR_CRC1RST_Pos                (20U)
#define RCC_AHB6RSTSETR_CRC1RST_Msk                (0x1UL << RCC_AHB6RSTSETR_CRC1RST_Pos)               /*!< 0x00100000 */
#define RCC_AHB6RSTSETR_CRC1RST                    RCC_AHB6RSTSETR_CRC1RST_Msk                         /*!< CRC block reset Set by software. */
#define RCC_AHB6RSTSETR_USBHRST_Pos                (24U)
#define RCC_AHB6RSTSETR_USBHRST_Msk                (0x1UL << RCC_AHB6RSTSETR_USBHRST_Pos)               /*!< 0x01000000 */
#define RCC_AHB6RSTSETR_USBHRST                    RCC_AHB6RSTSETR_USBHRST_Msk                         /*!< USBH block reset Set by software. */
#define RCC_AHB6RSTSETR_ETH2MACRST_Pos             (30U)
#define RCC_AHB6RSTSETR_ETH2MACRST_Msk             (0x1UL << RCC_AHB6RSTSETR_ETH2MACRST_Pos)            /*!< 0x40000000 */
#define RCC_AHB6RSTSETR_ETH2MACRST                 RCC_AHB6RSTSETR_ETH2MACRST_Msk                      /*!< ETH2 MAC block reset If ETH2 MAC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/***************  Bit definition for RCC_AHB6RSTCLRR register  ****************/
#define RCC_AHB6RSTCLRR_MDMARST_Pos                (0U)
#define RCC_AHB6RSTCLRR_MDMARST_Msk                (0x1UL << RCC_AHB6RSTCLRR_MDMARST_Pos)               /*!< 0x00000001 */
#define RCC_AHB6RSTCLRR_MDMARST                    RCC_AHB6RSTCLRR_MDMARST_Msk                         /*!< MDMA block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB6RSTCLRR_MCERST_Pos                 (1U)
#define RCC_AHB6RSTCLRR_MCERST_Msk                 (0x1UL << RCC_AHB6RSTCLRR_MCERST_Pos)                /*!< 0x00000002 */
#define RCC_AHB6RSTCLRR_MCERST                     RCC_AHB6RSTCLRR_MCERST_Msk                          /*!< MCE block reset If MCE is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB6RSTCLRR_ETH1MACRST_Pos             (10U)
#define RCC_AHB6RSTCLRR_ETH1MACRST_Msk             (0x1UL << RCC_AHB6RSTCLRR_ETH1MACRST_Pos)            /*!< 0x00000400 */
#define RCC_AHB6RSTCLRR_ETH1MACRST                 RCC_AHB6RSTCLRR_ETH1MACRST_Msk                      /*!< ETH1 MAC block reset If ETH1 MAC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB6RSTCLRR_FMCRST_Pos                 (12U)
#define RCC_AHB6RSTCLRR_FMCRST_Msk                 (0x1UL << RCC_AHB6RSTCLRR_FMCRST_Pos)                /*!< 0x00001000 */
#define RCC_AHB6RSTCLRR_FMCRST                     RCC_AHB6RSTCLRR_FMCRST_Msk                          /*!< FMC block reset If FMC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB6RSTCLRR_QSPIRST_Pos                (14U)
#define RCC_AHB6RSTCLRR_QSPIRST_Msk                (0x1UL << RCC_AHB6RSTCLRR_QSPIRST_Pos)               /*!< 0x00004000 */
#define RCC_AHB6RSTCLRR_QSPIRST                    RCC_AHB6RSTCLRR_QSPIRST_Msk                         /*!< QUADSPI and the QUADSPI delay block reset If QSPI is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB6RSTCLRR_SDMMC1RST_Pos              (16U)
#define RCC_AHB6RSTCLRR_SDMMC1RST_Msk              (0x1UL << RCC_AHB6RSTCLRR_SDMMC1RST_Pos)             /*!< 0x00010000 */
#define RCC_AHB6RSTCLRR_SDMMC1RST                  RCC_AHB6RSTCLRR_SDMMC1RST_Msk                       /*!< SDMMC1 and the SDMMC1 delay (DLYBSD1) block reset If SDMMC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB6RSTCLRR_SDMMC2RST_Pos              (17U)
#define RCC_AHB6RSTCLRR_SDMMC2RST_Msk              (0x1UL << RCC_AHB6RSTCLRR_SDMMC2RST_Pos)             /*!< 0x00020000 */
#define RCC_AHB6RSTCLRR_SDMMC2RST                  RCC_AHB6RSTCLRR_SDMMC2RST_Msk                       /*!< SDMMC2 and the SDMMC2 delay (DLYBSD2) block reset If SDMMC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_AHB6RSTCLRR_CRC1RST_Pos                (20U)
#define RCC_AHB6RSTCLRR_CRC1RST_Msk                (0x1UL << RCC_AHB6RSTCLRR_CRC1RST_Pos)               /*!< 0x00100000 */
#define RCC_AHB6RSTCLRR_CRC1RST                    RCC_AHB6RSTCLRR_CRC1RST_Msk                         /*!< CRC block reset Cleared by software. */
#define RCC_AHB6RSTCLRR_USBHRST_Pos                (24U)
#define RCC_AHB6RSTCLRR_USBHRST_Msk                (0x1UL << RCC_AHB6RSTCLRR_USBHRST_Pos)               /*!< 0x01000000 */
#define RCC_AHB6RSTCLRR_USBHRST                    RCC_AHB6RSTCLRR_USBHRST_Msk                         /*!< USBH block reset Cleared by software. */
#define RCC_AHB6RSTCLRR_ETH2MACRST_Pos             (30U)
#define RCC_AHB6RSTCLRR_ETH2MACRST_Msk             (0x1UL << RCC_AHB6RSTCLRR_ETH2MACRST_Pos)            /*!< 0x40000000 */
#define RCC_AHB6RSTCLRR_ETH2MACRST                 RCC_AHB6RSTCLRR_ETH2MACRST_Msk                      /*!< ETH2 MAC block reset If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

/**************  Bit definition for RCC_MP_APB1ENSETR register  ***************/
#define RCC_MP_APB1ENSETR_TIM2EN_Pos               (0U)
#define RCC_MP_APB1ENSETR_TIM2EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_TIM2EN_Pos)              /*!< 0x00000001 */
#define RCC_MP_APB1ENSETR_TIM2EN                   RCC_MP_APB1ENSETR_TIM2EN_Msk                        /*!< TIM2 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_TIM3EN_Pos               (1U)
#define RCC_MP_APB1ENSETR_TIM3EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_TIM3EN_Pos)              /*!< 0x00000002 */
#define RCC_MP_APB1ENSETR_TIM3EN                   RCC_MP_APB1ENSETR_TIM3EN_Msk                        /*!< TIM3 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_TIM4EN_Pos               (2U)
#define RCC_MP_APB1ENSETR_TIM4EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_TIM4EN_Pos)              /*!< 0x00000004 */
#define RCC_MP_APB1ENSETR_TIM4EN                   RCC_MP_APB1ENSETR_TIM4EN_Msk                        /*!< TIM4 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_TIM5EN_Pos               (3U)
#define RCC_MP_APB1ENSETR_TIM5EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_TIM5EN_Pos)              /*!< 0x00000008 */
#define RCC_MP_APB1ENSETR_TIM5EN                   RCC_MP_APB1ENSETR_TIM5EN_Msk                        /*!< TIM5 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_TIM6EN_Pos               (4U)
#define RCC_MP_APB1ENSETR_TIM6EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_TIM6EN_Pos)              /*!< 0x00000010 */
#define RCC_MP_APB1ENSETR_TIM6EN                   RCC_MP_APB1ENSETR_TIM6EN_Msk                        /*!< TIM6 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_TIM7EN_Pos               (5U)
#define RCC_MP_APB1ENSETR_TIM7EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_TIM7EN_Pos)              /*!< 0x00000020 */
#define RCC_MP_APB1ENSETR_TIM7EN                   RCC_MP_APB1ENSETR_TIM7EN_Msk                        /*!< TIM7 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_LPTIM1EN_Pos             (9U)
#define RCC_MP_APB1ENSETR_LPTIM1EN_Msk             (0x1UL << RCC_MP_APB1ENSETR_LPTIM1EN_Pos)            /*!< 0x00000200 */
#define RCC_MP_APB1ENSETR_LPTIM1EN                 RCC_MP_APB1ENSETR_LPTIM1EN_Msk                      /*!< LPTIM1 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_SPI2EN_Pos               (11U)
#define RCC_MP_APB1ENSETR_SPI2EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_SPI2EN_Pos)              /*!< 0x00000800 */
#define RCC_MP_APB1ENSETR_SPI2EN                   RCC_MP_APB1ENSETR_SPI2EN_Msk                        /*!< SPI2 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_SPI3EN_Pos               (12U)
#define RCC_MP_APB1ENSETR_SPI3EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_SPI3EN_Pos)              /*!< 0x00001000 */
#define RCC_MP_APB1ENSETR_SPI3EN                   RCC_MP_APB1ENSETR_SPI3EN_Msk                        /*!< SPI3 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_USART3EN_Pos             (15U)
#define RCC_MP_APB1ENSETR_USART3EN_Msk             (0x1UL << RCC_MP_APB1ENSETR_USART3EN_Pos)            /*!< 0x00008000 */
#define RCC_MP_APB1ENSETR_USART3EN                 RCC_MP_APB1ENSETR_USART3EN_Msk                      /*!< USART3 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_UART4EN_Pos              (16U)
#define RCC_MP_APB1ENSETR_UART4EN_Msk              (0x1UL << RCC_MP_APB1ENSETR_UART4EN_Pos)             /*!< 0x00010000 */
#define RCC_MP_APB1ENSETR_UART4EN                  RCC_MP_APB1ENSETR_UART4EN_Msk                       /*!< UART4 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_UART5EN_Pos              (17U)
#define RCC_MP_APB1ENSETR_UART5EN_Msk              (0x1UL << RCC_MP_APB1ENSETR_UART5EN_Pos)             /*!< 0x00020000 */
#define RCC_MP_APB1ENSETR_UART5EN                  RCC_MP_APB1ENSETR_UART5EN_Msk                       /*!< UART5 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_UART7EN_Pos              (18U)
#define RCC_MP_APB1ENSETR_UART7EN_Msk              (0x1UL << RCC_MP_APB1ENSETR_UART7EN_Pos)             /*!< 0x00040000 */
#define RCC_MP_APB1ENSETR_UART7EN                  RCC_MP_APB1ENSETR_UART7EN_Msk                       /*!< UART7 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_UART8EN_Pos              (19U)
#define RCC_MP_APB1ENSETR_UART8EN_Msk              (0x1UL << RCC_MP_APB1ENSETR_UART8EN_Pos)             /*!< 0x00080000 */
#define RCC_MP_APB1ENSETR_UART8EN                  RCC_MP_APB1ENSETR_UART8EN_Msk                       /*!< UART8 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_I2C1EN_Pos               (21U)
#define RCC_MP_APB1ENSETR_I2C1EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_I2C1EN_Pos)              /*!< 0x00200000 */
#define RCC_MP_APB1ENSETR_I2C1EN                   RCC_MP_APB1ENSETR_I2C1EN_Msk                        /*!< I2C1 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_I2C2EN_Pos               (22U)
#define RCC_MP_APB1ENSETR_I2C2EN_Msk               (0x1UL << RCC_MP_APB1ENSETR_I2C2EN_Pos)              /*!< 0x00400000 */
#define RCC_MP_APB1ENSETR_I2C2EN                   RCC_MP_APB1ENSETR_I2C2EN_Msk                        /*!< I2C2 peripheral clocks enable Set by software. */
#define RCC_MP_APB1ENSETR_SPDIFEN_Pos              (26U)
#define RCC_MP_APB1ENSETR_SPDIFEN_Msk              (0x1UL << RCC_MP_APB1ENSETR_SPDIFEN_Pos)             /*!< 0x04000000 */
#define RCC_MP_APB1ENSETR_SPDIFEN                  RCC_MP_APB1ENSETR_SPDIFEN_Msk                       /*!< SPDIFRX peripheral clocks enable Set by software. */

