zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/**************  Bit definition for RCC_MP_AHB5ENSETR register  ***************/
#define RCC_MP_AHB5ENSETR_PKAEN_Pos                (2U)
#define RCC_MP_AHB5ENSETR_PKAEN_Msk                (0x1UL << RCC_MP_AHB5ENSETR_PKAEN_Pos)               /*!< 0x00000004 */
#define RCC_MP_AHB5ENSETR_PKAEN                    RCC_MP_AHB5ENSETR_PKAEN_Msk                         /*!< PKA peripheral clocks enable If PKA is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5ENSETR_SAESEN_Pos               (3U)
#define RCC_MP_AHB5ENSETR_SAESEN_Msk               (0x1UL << RCC_MP_AHB5ENSETR_SAESEN_Pos)              /*!< 0x00000008 */
#define RCC_MP_AHB5ENSETR_SAESEN                   RCC_MP_AHB5ENSETR_SAESEN_Msk                        /*!< SAES peripheral clocks enable If SAES is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5ENSETR_CRYP1EN_Pos              (4U)
#define RCC_MP_AHB5ENSETR_CRYP1EN_Msk              (0x1UL << RCC_MP_AHB5ENSETR_CRYP1EN_Pos)             /*!< 0x00000010 */
#define RCC_MP_AHB5ENSETR_CRYP1EN                  RCC_MP_AHB5ENSETR_CRYP1EN_Msk                       /*!< CRYP (3DES/AES) peripheral clocks enable If CRYP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5ENSETR_HASH1EN_Pos              (5U)
#define RCC_MP_AHB5ENSETR_HASH1EN_Msk              (0x1UL << RCC_MP_AHB5ENSETR_HASH1EN_Pos)             /*!< 0x00000020 */
#define RCC_MP_AHB5ENSETR_HASH1EN                  RCC_MP_AHB5ENSETR_HASH1EN_Msk                       /*!< HASH peripheral clocks enable If HASH is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5ENSETR_RNG1EN_Pos               (6U)
#define RCC_MP_AHB5ENSETR_RNG1EN_Msk               (0x1UL << RCC_MP_AHB5ENSETR_RNG1EN_Pos)              /*!< 0x00000040 */
#define RCC_MP_AHB5ENSETR_RNG1EN                   RCC_MP_AHB5ENSETR_RNG1EN_Msk                        /*!< RNG1 peripheral clocks enable If RNG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5ENSETR_BKPSRAMEN_Pos            (8U)
#define RCC_MP_AHB5ENSETR_BKPSRAMEN_Msk            (0x1UL << RCC_MP_AHB5ENSETR_BKPSRAMEN_Pos)           /*!< 0x00000100 */
#define RCC_MP_AHB5ENSETR_BKPSRAMEN                RCC_MP_AHB5ENSETR_BKPSRAMEN_Msk                     /*!< BKPSRAM clocks enable If BKPSRAM is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5ENSETR_AXIMCEN_Pos              (16U)
#define RCC_MP_AHB5ENSETR_AXIMCEN_Msk              (0x1UL << RCC_MP_AHB5ENSETR_AXIMCEN_Pos)             /*!< 0x00010000 */
#define RCC_MP_AHB5ENSETR_AXIMCEN                  RCC_MP_AHB5ENSETR_AXIMCEN_Msk                       /*!< AXIMC clocks enable A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */

/**************  Bit definition for RCC_MP_AHB5ENCLRR register  ***************/
#define RCC_MP_AHB5ENCLRR_PKAEN_Pos                (2U)
#define RCC_MP_AHB5ENCLRR_PKAEN_Msk                (0x1UL << RCC_MP_AHB5ENCLRR_PKAEN_Pos)               /*!< 0x00000004 */
#define RCC_MP_AHB5ENCLRR_PKAEN                    RCC_MP_AHB5ENCLRR_PKAEN_Msk                         /*!< PKA peripheral clocks enable If PKA is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5ENCLRR_SAESEN_Pos               (3U)
#define RCC_MP_AHB5ENCLRR_SAESEN_Msk               (0x1UL << RCC_MP_AHB5ENCLRR_SAESEN_Pos)              /*!< 0x00000008 */
#define RCC_MP_AHB5ENCLRR_SAESEN                   RCC_MP_AHB5ENCLRR_SAESEN_Msk                        /*!< SAES peripheral clocks enable If SAES is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5ENCLRR_CRYP1EN_Pos              (4U)
#define RCC_MP_AHB5ENCLRR_CRYP1EN_Msk              (0x1UL << RCC_MP_AHB5ENCLRR_CRYP1EN_Pos)             /*!< 0x00000010 */
#define RCC_MP_AHB5ENCLRR_CRYP1EN                  RCC_MP_AHB5ENCLRR_CRYP1EN_Msk                       /*!< CRYP (3DES/AES) peripheral clocks enable If CRYP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5ENCLRR_HASH1EN_Pos              (5U)
#define RCC_MP_AHB5ENCLRR_HASH1EN_Msk              (0x1UL << RCC_MP_AHB5ENCLRR_HASH1EN_Pos)             /*!< 0x00000020 */
#define RCC_MP_AHB5ENCLRR_HASH1EN                  RCC_MP_AHB5ENCLRR_HASH1EN_Msk                       /*!< HASH peripheral clocks enable If HASH is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5ENCLRR_RNG1EN_Pos               (6U)
#define RCC_MP_AHB5ENCLRR_RNG1EN_Msk               (0x1UL << RCC_MP_AHB5ENCLRR_RNG1EN_Pos)              /*!< 0x00000040 */
#define RCC_MP_AHB5ENCLRR_RNG1EN                   RCC_MP_AHB5ENCLRR_RNG1EN_Msk                        /*!< RNG1 peripheral clocks enable If RNG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5ENCLRR_BKPSRAMEN_Pos            (8U)
#define RCC_MP_AHB5ENCLRR_BKPSRAMEN_Msk            (0x1UL << RCC_MP_AHB5ENCLRR_BKPSRAMEN_Pos)           /*!< 0x00000100 */
#define RCC_MP_AHB5ENCLRR_BKPSRAMEN                RCC_MP_AHB5ENCLRR_BKPSRAMEN_Msk                     /*!< BKPSRAM clocks enable If BKPSRAM is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5ENCLRR_AXIMCEN_Pos              (16U)
#define RCC_MP_AHB5ENCLRR_AXIMCEN_Msk              (0x1UL << RCC_MP_AHB5ENCLRR_AXIMCEN_Pos)             /*!< 0x00010000 */
#define RCC_MP_AHB5ENCLRR_AXIMCEN                  RCC_MP_AHB5ENCLRR_AXIMCEN_Msk                       /*!< AXIMC clocks enable A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */

/**************  Bit definition for RCC_MP_AHB6ENSETR register  ***************/
#define RCC_MP_AHB6ENSETR_MCEEN_Pos                (1U)
#define RCC_MP_AHB6ENSETR_MCEEN_Msk                (0x1UL << RCC_MP_AHB6ENSETR_MCEEN_Pos)               /*!< 0x00000002 */
#define RCC_MP_AHB6ENSETR_MCEEN                    RCC_MP_AHB6ENSETR_MCEEN_Msk                         /*!< MCE peripheral clocks enable If MCE is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_ETH1CKEN_Pos             (7U)
#define RCC_MP_AHB6ENSETR_ETH1CKEN_Msk             (0x1UL << RCC_MP_AHB6ENSETR_ETH1CKEN_Pos)            /*!< 0x00000080 */
#define RCC_MP_AHB6ENSETR_ETH1CKEN                 RCC_MP_AHB6ENSETR_ETH1CKEN_Msk                      /*!< Enable of the ETH1 clock generated by the RCC (eth1_ker_ck) If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_ETH1TXEN_Pos             (8U)
#define RCC_MP_AHB6ENSETR_ETH1TXEN_Msk             (0x1UL << RCC_MP_AHB6ENSETR_ETH1TXEN_Pos)            /*!< 0x00000100 */
#define RCC_MP_AHB6ENSETR_ETH1TXEN                 RCC_MP_AHB6ENSETR_ETH1TXEN_Msk                      /*!< ETH1 transmission clock enable If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_ETH1RXEN_Pos             (9U)
#define RCC_MP_AHB6ENSETR_ETH1RXEN_Msk             (0x1UL << RCC_MP_AHB6ENSETR_ETH1RXEN_Pos)            /*!< 0x00000200 */
#define RCC_MP_AHB6ENSETR_ETH1RXEN                 RCC_MP_AHB6ENSETR_ETH1RXEN_Msk                      /*!< ETH1 reception clock enable If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_ETH1MACEN_Pos            (10U)
#define RCC_MP_AHB6ENSETR_ETH1MACEN_Msk            (0x1UL << RCC_MP_AHB6ENSETR_ETH1MACEN_Pos)           /*!< 0x00000400 */
#define RCC_MP_AHB6ENSETR_ETH1MACEN                RCC_MP_AHB6ENSETR_ETH1MACEN_Msk                     /*!< ETH1 MAC bus interface clock enable (hclk6 and aclk) If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_FMCEN_Pos                (12U)
#define RCC_MP_AHB6ENSETR_FMCEN_Msk                (0x1UL << RCC_MP_AHB6ENSETR_FMCEN_Pos)               /*!< 0x00001000 */
#define RCC_MP_AHB6ENSETR_FMCEN                    RCC_MP_AHB6ENSETR_FMCEN_Msk                         /*!< FMC peripheral clocks enable If FMC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_QSPIEN_Pos               (14U)
#define RCC_MP_AHB6ENSETR_QSPIEN_Msk               (0x1UL << RCC_MP_AHB6ENSETR_QSPIEN_Pos)              /*!< 0x00004000 */
#define RCC_MP_AHB6ENSETR_QSPIEN                   RCC_MP_AHB6ENSETR_QSPIEN_Msk                        /*!< QUADSPI peripheral clocks enable If QSPI is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_SDMMC1EN_Pos             (16U)
#define RCC_MP_AHB6ENSETR_SDMMC1EN_Msk             (0x1UL << RCC_MP_AHB6ENSETR_SDMMC1EN_Pos)            /*!< 0x00010000 */
#define RCC_MP_AHB6ENSETR_SDMMC1EN                 RCC_MP_AHB6ENSETR_SDMMC1EN_Msk                      /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable If SDMMC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_SDMMC2EN_Pos             (17U)
#define RCC_MP_AHB6ENSETR_SDMMC2EN_Msk             (0x1UL << RCC_MP_AHB6ENSETR_SDMMC2EN_Pos)            /*!< 0x00020000 */
#define RCC_MP_AHB6ENSETR_SDMMC2EN                 RCC_MP_AHB6ENSETR_SDMMC2EN_Msk                      /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable If SDMMC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_CRC1EN_Pos               (20U)
#define RCC_MP_AHB6ENSETR_CRC1EN_Msk               (0x1UL << RCC_MP_AHB6ENSETR_CRC1EN_Pos)              /*!< 0x00100000 */
#define RCC_MP_AHB6ENSETR_CRC1EN                   RCC_MP_AHB6ENSETR_CRC1EN_Msk                        /*!< CRC peripheral clocks enable Set by software. */
#define RCC_MP_AHB6ENSETR_USBHEN_Pos               (24U)
#define RCC_MP_AHB6ENSETR_USBHEN_Msk               (0x1UL << RCC_MP_AHB6ENSETR_USBHEN_Pos)              /*!< 0x01000000 */
#define RCC_MP_AHB6ENSETR_USBHEN                   RCC_MP_AHB6ENSETR_USBHEN_Msk                        /*!< USBH peripheral clocks enable Set by software. */
#define RCC_MP_AHB6ENSETR_ETH2CKEN_Pos             (27U)
#define RCC_MP_AHB6ENSETR_ETH2CKEN_Msk             (0x1UL << RCC_MP_AHB6ENSETR_ETH2CKEN_Pos)            /*!< 0x08000000 */
#define RCC_MP_AHB6ENSETR_ETH2CKEN                 RCC_MP_AHB6ENSETR_ETH2CKEN_Msk                      /*!< Enable of the ETH2 clock generated by the RCC (eth2_ker_ck) If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_ETH2TXEN_Pos             (28U)
#define RCC_MP_AHB6ENSETR_ETH2TXEN_Msk             (0x1UL << RCC_MP_AHB6ENSETR_ETH2TXEN_Pos)            /*!< 0x10000000 */
#define RCC_MP_AHB6ENSETR_ETH2TXEN                 RCC_MP_AHB6ENSETR_ETH2TXEN_Msk                      /*!< ETH2 transmission clock enable If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_ETH2RXEN_Pos             (29U)
#define RCC_MP_AHB6ENSETR_ETH2RXEN_Msk             (0x1UL << RCC_MP_AHB6ENSETR_ETH2RXEN_Pos)            /*!< 0x20000000 */
#define RCC_MP_AHB6ENSETR_ETH2RXEN                 RCC_MP_AHB6ENSETR_ETH2RXEN_Msk                      /*!< ETH2 reception clock enable If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB6ENSETR_ETH2MACEN_Pos            (30U)
#define RCC_MP_AHB6ENSETR_ETH2MACEN_Msk            (0x1UL << RCC_MP_AHB6ENSETR_ETH2MACEN_Pos)           /*!< 0x40000000 */
#define RCC_MP_AHB6ENSETR_ETH2MACEN                RCC_MP_AHB6ENSETR_ETH2MACEN_Msk                     /*!< ETH2 MAC bus interface clock enable (hclk6 and aclk) If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/**************  Bit definition for RCC_MP_AHB6ENCLRR register  ***************/
#define RCC_MP_AHB6ENCLRR_MCEEN_Pos                (1U)
#define RCC_MP_AHB6ENCLRR_MCEEN_Msk                (0x1UL << RCC_MP_AHB6ENCLRR_MCEEN_Pos)               /*!< 0x00000002 */
#define RCC_MP_AHB6ENCLRR_MCEEN                    RCC_MP_AHB6ENCLRR_MCEEN_Msk                         /*!< MCE peripheral clocks enable If MCE is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_ETH1CKEN_Pos             (7U)
#define RCC_MP_AHB6ENCLRR_ETH1CKEN_Msk             (0x1UL << RCC_MP_AHB6ENCLRR_ETH1CKEN_Pos)            /*!< 0x00000080 */
#define RCC_MP_AHB6ENCLRR_ETH1CKEN                 RCC_MP_AHB6ENCLRR_ETH1CKEN_Msk                      /*!< Enable of the ETH1 clock generated by the RCC (eth1_ker_ck) If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_ETH1TXEN_Pos             (8U)
#define RCC_MP_AHB6ENCLRR_ETH1TXEN_Msk             (0x1UL << RCC_MP_AHB6ENCLRR_ETH1TXEN_Pos)            /*!< 0x00000100 */
#define RCC_MP_AHB6ENCLRR_ETH1TXEN                 RCC_MP_AHB6ENCLRR_ETH1TXEN_Msk                      /*!< ETH1 transmission clock enable If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_ETH1RXEN_Pos             (9U)
#define RCC_MP_AHB6ENCLRR_ETH1RXEN_Msk             (0x1UL << RCC_MP_AHB6ENCLRR_ETH1RXEN_Pos)            /*!< 0x00000200 */
#define RCC_MP_AHB6ENCLRR_ETH1RXEN                 RCC_MP_AHB6ENCLRR_ETH1RXEN_Msk                      /*!< ETH1 reception clock enable If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_ETH1MACEN_Pos            (10U)
#define RCC_MP_AHB6ENCLRR_ETH1MACEN_Msk            (0x1UL << RCC_MP_AHB6ENCLRR_ETH1MACEN_Pos)           /*!< 0x00000400 */
#define RCC_MP_AHB6ENCLRR_ETH1MACEN                RCC_MP_AHB6ENCLRR_ETH1MACEN_Msk                     /*!< ETH1 MAC bus interface clock enable (hclk6 and aclk) If ETH1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_FMCEN_Pos                (12U)
#define RCC_MP_AHB6ENCLRR_FMCEN_Msk                (0x1UL << RCC_MP_AHB6ENCLRR_FMCEN_Pos)               /*!< 0x00001000 */
#define RCC_MP_AHB6ENCLRR_FMCEN                    RCC_MP_AHB6ENCLRR_FMCEN_Msk                         /*!< FMC peripheral clocks enable If FMC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_QSPIEN_Pos               (14U)
#define RCC_MP_AHB6ENCLRR_QSPIEN_Msk               (0x1UL << RCC_MP_AHB6ENCLRR_QSPIEN_Pos)              /*!< 0x00004000 */
#define RCC_MP_AHB6ENCLRR_QSPIEN                   RCC_MP_AHB6ENCLRR_QSPIEN_Msk                        /*!< QUADSPI peripheral clocks enable If QSPI is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_SDMMC1EN_Pos             (16U)
#define RCC_MP_AHB6ENCLRR_SDMMC1EN_Msk             (0x1UL << RCC_MP_AHB6ENCLRR_SDMMC1EN_Pos)            /*!< 0x00010000 */
#define RCC_MP_AHB6ENCLRR_SDMMC1EN                 RCC_MP_AHB6ENCLRR_SDMMC1EN_Msk                      /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable If SDMMC1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_SDMMC2EN_Pos             (17U)
#define RCC_MP_AHB6ENCLRR_SDMMC2EN_Msk             (0x1UL << RCC_MP_AHB6ENCLRR_SDMMC2EN_Pos)            /*!< 0x00020000 */
#define RCC_MP_AHB6ENCLRR_SDMMC2EN                 RCC_MP_AHB6ENCLRR_SDMMC2EN_Msk                      /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable If SDMMC2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_CRC1EN_Pos               (20U)
#define RCC_MP_AHB6ENCLRR_CRC1EN_Msk               (0x1UL << RCC_MP_AHB6ENCLRR_CRC1EN_Pos)              /*!< 0x00100000 */
#define RCC_MP_AHB6ENCLRR_CRC1EN                   RCC_MP_AHB6ENCLRR_CRC1EN_Msk                        /*!< CRC peripheral clocks enable Cleared by software. */
#define RCC_MP_AHB6ENCLRR_USBHEN_Pos               (24U)
#define RCC_MP_AHB6ENCLRR_USBHEN_Msk               (0x1UL << RCC_MP_AHB6ENCLRR_USBHEN_Pos)              /*!< 0x01000000 */
#define RCC_MP_AHB6ENCLRR_USBHEN                   RCC_MP_AHB6ENCLRR_USBHEN_Msk                        /*!< USBH peripheral clocks enable Cleared by software. */
#define RCC_MP_AHB6ENCLRR_ETH2CKEN_Pos             (27U)
#define RCC_MP_AHB6ENCLRR_ETH2CKEN_Msk             (0x1UL << RCC_MP_AHB6ENCLRR_ETH2CKEN_Pos)            /*!< 0x08000000 */
#define RCC_MP_AHB6ENCLRR_ETH2CKEN                 RCC_MP_AHB6ENCLRR_ETH2CKEN_Msk                      /*!< Enable of the ETH2 clock generated by the RCC (eth2_ker_ck) If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_ETH2TXEN_Pos             (28U)
#define RCC_MP_AHB6ENCLRR_ETH2TXEN_Msk             (0x1UL << RCC_MP_AHB6ENCLRR_ETH2TXEN_Pos)            /*!< 0x10000000 */
#define RCC_MP_AHB6ENCLRR_ETH2TXEN                 RCC_MP_AHB6ENCLRR_ETH2TXEN_Msk                      /*!< ETH2 transmission clock enable If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_ETH2RXEN_Pos             (29U)
#define RCC_MP_AHB6ENCLRR_ETH2RXEN_Msk             (0x1UL << RCC_MP_AHB6ENCLRR_ETH2RXEN_Pos)            /*!< 0x20000000 */
#define RCC_MP_AHB6ENCLRR_ETH2RXEN                 RCC_MP_AHB6ENCLRR_ETH2RXEN_Msk                      /*!< ETH2 reception clock enable If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB6ENCLRR_ETH2MACEN_Pos            (30U)
#define RCC_MP_AHB6ENCLRR_ETH2MACEN_Msk            (0x1UL << RCC_MP_AHB6ENCLRR_ETH2MACEN_Pos)           /*!< 0x40000000 */
#define RCC_MP_AHB6ENCLRR_ETH2MACEN                RCC_MP_AHB6ENCLRR_ETH2MACEN_Msk                     /*!< ETH2 MAC bus interface clock enable (hclk6 and aclk) If ETH2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

