zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
#define SYSCFG_PMCSETR_ETH2_CLK_SEL_Pos        (24U)
#define SYSCFG_PMCSETR_ETH2_CLK_SEL_Msk        (0x1UL << SYSCFG_PMCSETR_ETH2_CLK_SEL_Pos)           /*!< 0x01000000 */
#define SYSCFG_PMCSETR_ETH2_CLK_SEL            SYSCFG_PMCSETR_ETH2_CLK_SEL_Msk                    /*!< Internal clock ETH_CLK from RCC is used regardless AFMux */
#define SYSCFG_PMCSETR_ETH2_REF_CLK_SEL_Pos    (25U)
#define SYSCFG_PMCSETR_ETH2_REF_CLK_SEL_Msk    (0x1UL << SYSCFG_PMCSETR_ETH2_REF_CLK_SEL_Pos)       /*!< 0x02000000 */
#define SYSCFG_PMCSETR_ETH2_REF_CLK_SEL        SYSCFG_PMCSETR_ETH2_REF_CLK_SEL_Msk                 /*!< Ethernet 50MHz RMII clock selection */

#define SYSCFG_PMCSETR_ETH2_SEL_Pos             (29U)
#define SYSCFG_PMCSETR_ETH2_SEL_Msk             (0x7UL << SYSCFG_PMCSETR_ETH2_SEL_Pos)               /*!< 0xE0000000 */
#define SYSCFG_PMCSETR_ETH2_SEL                 SYSCFG_PMCSETR_ETH2_SEL_Msk                         /*!< Ethernet2 PHY Interface Selection */
#define SYSCFG_PMCSETR_ETH2_SEL_0               (0x1UL << SYSCFG_PMCSETR_ETH2_SEL_Pos)               /*!< 0x20000000 */
#define SYSCFG_PMCSETR_ETH2_SEL_1               (0x2UL << SYSCFG_PMCSETR_ETH2_SEL_Pos)               /*!< 0x40000000 */
#define SYSCFG_PMCSETR_ETH2_SEL_2               (0x4UL << SYSCFG_PMCSETR_ETH2_SEL_Pos)               /*!< 0x80000000 */

/******************  Bit definition for SYSCFG_PMCCLRR register  ******************/
#define SYSCFG_PMCCLRR_I2C1_FMP_Pos     (0U)
#define SYSCFG_PMCCLRR_I2C1_FMP_Msk     (0x1UL << SYSCFG_PMCCLRR_I2C1_FMP_Pos)        /*!< 0x00000001 */
#define SYSCFG_PMCCLRR_I2C1_FMP         SYSCFG_PMCCLRR_I2C1_FMP_Msk                  /*!< I2C1 Fast mode plus */
#define SYSCFG_PMCCLRR_I2C2_FMP_Pos     (1U)
#define SYSCFG_PMCCLRR_I2C2_FMP_Msk     (0x1UL << SYSCFG_PMCCLRR_I2C2_FMP_Pos)        /*!< 0x00000002 */
#define SYSCFG_PMCCLRR_I2C2_FMP         SYSCFG_PMCCLRR_I2C2_FMP_Msk                  /*!< I2C2 Fast mode plus */
#define SYSCFG_PMCCLRR_I2C3_FMP_Pos     (2U)
#define SYSCFG_PMCCLRR_I2C3_FMP_Msk     (0x1UL << SYSCFG_PMCCLRR_I2C3_FMP_Pos)        /*!< 0x00000004 */
#define SYSCFG_PMCCLRR_I2C3_FMP         SYSCFG_PMCCLRR_I2C3_FMP_Msk                  /*!< I2C3 Fast mode plus */
#define SYSCFG_PMCCLRR_I2C4_FMP_Pos     (3U)
#define SYSCFG_PMCCLRR_I2C4_FMP_Msk     (0x1UL << SYSCFG_PMCCLRR_I2C4_FMP_Pos)        /*!< 0x00000008 */
#define SYSCFG_PMCCLRR_I2C4_FMP         SYSCFG_PMCCLRR_I2C4_FMP_Msk                  /*!< I2C4 Fast mode plus */
#define SYSCFG_PMCCLRR_I2C5_FMP_Pos     (4U)
#define SYSCFG_PMCCLRR_I2C5_FMP_Msk     (0x1UL << SYSCFG_PMCCLRR_I2C5_FMP_Pos)        /*!< 0x00000010 */
#define SYSCFG_PMCCLRR_I2C5_FMP         SYSCFG_PMCCLRR_I2C5_FMP_Msk                  /*!< I2C5 Fast mode plus */

#define SYSCFG_PMCCLRR_EN_BOOSTER_Pos     (8U)
#define SYSCFG_PMCCLRR_EN_BOOSTER_Msk     (0x1UL << SYSCFG_PMCCLRR_EN_BOOSTER_Pos)         /*!< 0x00000100 */
#define SYSCFG_PMCCLRR_EN_BOOSTER          SYSCFG_PMCCLRR_EN_BOOSTER_Msk                   /*!< I/O analog switch voltage booster enable */

#define SYSCFG_PMCCLRR_ANASWVDD_Pos     (9U)
#define SYSCFG_PMCCLRR_ANASWVDD_Msk     (0x1UL << SYSCFG_PMCCLRR_ANASWVDD_Pos)         /*!< 0x00000200 */
#define SYSCFG_PMCCLRR_ANASWVDD         SYSCFG_PMCCLRR_ANASWVDD_Msk                   /*!< GPIO analog switches control voltage selection */

#define SYSCFG_PMCCLRR_ETH1_CLK_SEL_Pos        (16U)
#define SYSCFG_PMCCLRR_ETH1_CLK_SEL_Msk        (0x1UL << SYSCFG_PMCCLRR_ETH1_CLK_SEL_Pos)          /*!< 0x00010000 */
#define SYSCFG_PMCCLRR_ETH1_CLK_SEL            SYSCFG_PMCCLRR_ETH1_CLK_SEL_Msk                    /*!< Internal clock ETH_CLK1 from RCC is used regardless AFMux */
#define SYSCFG_PMCCLRR_ETH1_REF_CLK_SEL_Pos    (17U)
#define SYSCFG_PMCCLRR_ETH1_REF_CLK_SEL_Msk    (0x1UL << SYSCFG_PMCCLRR_ETH1_REF_CLK_SEL_Pos)      /*!< 0x00020000 */
#define SYSCFG_PMCCLRR_ETH1_REF_CLK_SEL        SYSCFG_PMCCLRR_ETH1_REF_CLK_SEL_Msk                /*!< Ethernet 50MHz RMII clock selection */
#define SYSCFG_PMCCLRR_ETH1_SEL_Pos            (21U)
#define SYSCFG_PMCCLRR_ETH1_SEL_Msk            (0x7UL << SYSCFG_PMCCLRR_ETH1_SEL_Pos)               /*!< 0x00E00000 */
#define SYSCFG_PMCCLRR_ETH1_SEL                SYSCFG_PMCCLRR_ETH1_SEL_Msk                         /*!< Ethernet1 PHY Interface Selection */
#define SYSCFG_PMCCLRR_ETH1_SEL_0              (0x1UL << SYSCFG_PMCCLRR_ETH1_SEL_Pos)               /*!< 0x00200000 */
#define SYSCFG_PMCCLRR_ETH1_SEL_1              (0x2UL << SYSCFG_PMCCLRR_ETH1_SEL_Pos)               /*!< 0x00400000 */
#define SYSCFG_PMCCLRR_ETH1_SEL_2              (0x4UL << SYSCFG_PMCCLRR_ETH1_SEL_Pos)               /*!< 0x00800000 */

#define SYSCFG_PMCCLRR_ETH2_CLK_SEL_Pos        (24U)
#define SYSCFG_PMCCLRR_ETH2_CLK_SEL_Msk        (0x1UL << SYSCFG_PMCCLRR_ETH2_CLK_SEL_Pos)          /*!< 0x01000000 */
#define SYSCFG_PMCCLRR_ETH2_CLK_SEL            SYSCFG_PMCCLRR_ETH2_CLK_SEL_Msk                    /*!< Internal clock ETH2_CLK1 from RCC is used regardless AFMux */
#define SYSCFG_PMCCLRR_ETH2_REF_CLK_SEL_Pos    (25U)
#define SYSCFG_PMCCLRR_ETH2_REF_CLK_SEL_Msk    (0x1UL << SYSCFG_PMCCLRR_ETH2_REF_CLK_SEL_Pos)      /*!< 0x02000000 */
#define SYSCFG_PMCCLRR_ETH2_REF_CLK_SEL        SYSCFG_PMCCLRR_ETH2_REF_CLK_SEL_Msk                /*!< Ethernet2 50MHz RMII clock selection */

#define SYSCFG_PMCCLRR_ETH2_SEL_Pos            (29U)
#define SYSCFG_PMCCLRR_ETH2_SEL_Msk            (0x7UL << SYSCFG_PMCCLRR_ETH2_SEL_Pos)               /*!< 0xE0000000 */
#define SYSCFG_PMCCLRR_ETH2_SEL                SYSCFG_PMCCLRR_ETH2_SEL_Msk                         /*!< Ethernet2 PHY Interface Selection */
#define SYSCFG_PMCCLRR_ETH2_SEL_0              (0x1UL << SYSCFG_PMCCLRR_ETH2_SEL_Pos)               /*!< 0x20000000 */
#define SYSCFG_PMCCLRR_ETH2_SEL_1              (0x2UL << SYSCFG_PMCCLRR_ETH2_SEL_Pos)               /*!< 0x40000000 */
#define SYSCFG_PMCCLRR_ETH2_SEL_2              (0x4UL << SYSCFG_PMCCLRR_ETH2_SEL_Pos)               /*!< 0x80000000 */

/******************  Bit definition for SYSCFG_BOOTCR register   ********************/
#define SYSCFG_BOOTCR_BMEN_Pos                  (0U)
#define SYSCFG_BOOTCR_BMEN_Msk                  (0x1UL << SYSCFG_BOOTCR_BMEN_Pos)                 /*!< 0x00000001 */
#define SYSCFG_BOOTCR_BMEN                      SYSCFG_BOOTCR_BMEN_Msk                           /*!< Boot mode enable */

/******************  Bit definition for SYSCFG_SRAM3ERASER register   ***************/
#define SYSCFG_SRAM3ERASER_SRAM3ER_Pos          (0U)
#define SYSCFG_SRAM3ERASER_SRAM3ER_Msk          (0x1UL << SYSCFG_SRAM3ERASER_SRAM3ER_Pos)         /*!< 0x00000001 */
#define SYSCFG_SRAM3ERASER_SRAM3ER              SYSCFG_SRAM3ERASER_SRAM3ER_Msk                   /*!< SRAM3 erase request */
#define SYSCFG_SRAM3ERASER_SRAM3EO_Pos          (1U)
#define SYSCFG_SRAM3ERASER_SRAM3EO_Msk          (0x1UL << SYSCFG_SRAM3ERASER_SRAM3EO_Pos)         /*!< 0x00000002 */
#define SYSCFG_SRAM3ERASER_SRAM3EO              SYSCFG_SRAM3ERASER_SRAM3EO_Msk                   /*!< SRAM3 erase ongoing */

/******************  Bit definition for SYSCFG_SRAM3KR register   *******************/
#define SYSCFG_SRAM3KR_KEY_Pos                  (0U)
#define SYSCFG_SRAM3KR_KEY_Msk                  (0xFFUL << SYSCFG_SRAM3KR_KEY_Pos)                /*!< 0x000000FF */
#define SYSCFG_SRAM3KR_KEY                      SYSCFG_SRAM3KR_KEY_Msk                           /*!< KEY[7:0] (SRAM3 sw erase key bit field) */

/******************  Bit definition for SYSCFG_CMPCR register   ********************/
#define SYSCFG_CMPCR_SW_CTRL_Pos             (1U)
#define SYSCFG_CMPCR_SW_CTRL_Msk             (0x1UL << SYSCFG_CMPCR_SW_CTRL_Pos) /*!< 0x00000002 */
#define SYSCFG_CMPCR_SW_CTRL                 SYSCFG_CMPCR_SW_CTRL_Msk           /*!< Compensation Software Control */
#define SYSCFG_CMPCR_READY_Pos               (8U)
#define SYSCFG_CMPCR_READY_Msk               (0x1UL << SYSCFG_CMPCR_READY_Pos)   /*!< 0x00000100 */
#define SYSCFG_CMPCR_READY                   SYSCFG_CMPCR_READY_Msk             /*!< Compensation cell ready flag */
#define SYSCFG_CMPCR_RANSRC_Pos              (16U)
#define SYSCFG_CMPCR_RANSRC_Msk              (0xFUL << SYSCFG_CMPCR_RANSRC_Pos)  /*!< 0x000F0000 */
#define SYSCFG_CMPCR_RANSRC                  SYSCFG_CMPCR_RANSRC_Msk            /*!< NMOS I/O Compensation value sent to IOs when SW_CTRL = 1 */
#define SYSCFG_CMPCR_RANSRC_0                (0x1UL << SYSCFG_CMPCR_RANSRC_Pos)  /*!< 0x00010000 */
#define SYSCFG_CMPCR_RANSRC_1                (0x2UL << SYSCFG_CMPCR_RANSRC_Pos)  /*!< 0x00020000 */
#define SYSCFG_CMPCR_RANSRC_2                (0x4UL << SYSCFG_CMPCR_RANSRC_Pos)  /*!< 0x00040000 */
#define SYSCFG_CMPCR_RANSRC_3                (0x8UL << SYSCFG_CMPCR_RANSRC_Pos)  /*!< 0x00080000 */
#define SYSCFG_CMPCR_RAPSRC_Pos              (20U)
#define SYSCFG_CMPCR_RAPSRC_Msk              (0xFUL << SYSCFG_CMPCR_RAPSRC_Pos)  /*!< 0x00F00000 */
#define SYSCFG_CMPCR_RAPSRC                  SYSCFG_CMPCR_RAPSRC_Msk            /*!< PMOS I/O Compensation value sent to IOs when SW_CTRL = 1 */
#define SYSCFG_CMPCR_RAPSRC_0                (0x1UL << SYSCFG_CMPCR_RAPSRC_Pos)  /*!< 0x00100000 */
#define SYSCFG_CMPCR_RAPSRC_1                (0x2UL << SYSCFG_CMPCR_RAPSRC_Pos)  /*!< 0x00200000 */
#define SYSCFG_CMPCR_RAPSRC_2                (0x4UL << SYSCFG_CMPCR_RAPSRC_Pos)  /*!< 0x00400000 */
#define SYSCFG_CMPCR_RAPSRC_3                (0x8UL << SYSCFG_CMPCR_RAPSRC_Pos)  /*!< 0x00800000 */
#define SYSCFG_CMPCR_ANSRC_Pos               (24U)
#define SYSCFG_CMPCR_ANSRC_Msk               (0xFUL << SYSCFG_CMPCR_ANSRC_Pos)   /*!< 0x0F000000 */
#define SYSCFG_CMPCR_ANSRC                   SYSCFG_CMPCR_ANSRC_Msk             /*!< NMOS I/O Compensation value provided by compensation cell */
#define SYSCFG_CMPCR_ANSRC_0                 (0x1UL << SYSCFG_CMPCR_ANSRC_Pos)   /*!< 0x01000000 */
#define SYSCFG_CMPCR_ANSRC_1                 (0x2UL << SYSCFG_CMPCR_ANSRC_Pos)   /*!< 0x02000000 */
#define SYSCFG_CMPCR_ANSRC_2                 (0x4UL << SYSCFG_CMPCR_ANSRC_Pos)   /*!< 0x04000000 */
#define SYSCFG_CMPCR_ANSRC_3                 (0x8UL << SYSCFG_CMPCR_ANSRC_Pos)   /*!< 0x08000000 */
#define SYSCFG_CMPCR_APSRC_Pos               (28U)
#define SYSCFG_CMPCR_APSRC_Msk               (0xFUL << SYSCFG_CMPCR_APSRC_Pos)   /*!< 0xF0000000 */
#define SYSCFG_CMPCR_APSRC                   SYSCFG_CMPCR_APSRC_Msk             /*!< PMOS I/O Compensation value provided by compensation cell */
#define SYSCFG_CMPCR_APSRC_0                 (0x1UL << SYSCFG_CMPCR_APSRC_Pos)   /*!< 0x10000000 */
#define SYSCFG_CMPCR_APSRC_1                 (0x2UL << SYSCFG_CMPCR_APSRC_Pos)   /*!< 0x20000000 */
#define SYSCFG_CMPCR_APSRC_2                 (0x4UL << SYSCFG_CMPCR_APSRC_Pos)   /*!< 0x40000000 */
#define SYSCFG_CMPCR_APSRC_3                 (0x8UL << SYSCFG_CMPCR_APSRC_Pos)   /*!< 0x80000000 */

/******************  Bit definition for SYSCFG_CMPENSETR register   ********************/
#define SYSCFG_CMPENSETR_EN_Pos                  (0U)
#define SYSCFG_CMPENSETR_EN_Msk                  (0x1UL << SYSCFG_CMPENSETR_EN_Pos)     /*!< 0x00000001 */
#define SYSCFG_CMPENSETR_EN                      SYSCFG_CMPENSETR_EN_Msk               /*!< Compensation cell enable */

