zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/******************  Bit definition for SYSCFG_CMPENCLRR register   ********************/
#define SYSCFG_CMPENCLRR_EN_Pos                  (0U)
#define SYSCFG_CMPENCLRR_EN_Msk                  (0x1UL << SYSCFG_CMPENCLRR_EN_Pos)      /*!< 0x00000001 */
#define SYSCFG_CMPENCLRR_EN                      SYSCFG_CMPENCLRR_EN_Msk                /*!< Compensation cell disable */

/******************  Bit definition for SYSCFG_CBR register  ******************/
#define SYSCFG_CBR_PVDL_Pos          (2U)
#define SYSCFG_CBR_PVDL_Msk          (0x1UL << SYSCFG_CBR_PVDL_Pos)             /*!< 0x00000004 */
#define SYSCFG_CBR_PVDL              SYSCFG_CBR_PVDL_Msk                       /*!< PVD lock enable bit */

/******************  Bit definition for SYSCFG_CMPSD1CR register   ********************/
#define SYSCFG_CMPSD1CR_SW_CTRL_Pos             (1U)
#define SYSCFG_CMPSD1CR_SW_CTRL_Msk             (0x1UL << SYSCFG_CMPSD1CR_SW_CTRL_Pos) /*!< 0x00000002 */
#define SYSCFG_CMPSD1CR_SW_CTRL                 SYSCFG_CMPSD1CR_SW_CTRL_Msk           /*!< Compensation Software Control */
#define SYSCFG_CMPSD1CR_READY_Pos               (8U)
#define SYSCFG_CMPSD1CR_READY_Msk               (0x1UL << SYSCFG_CMPSD1CR_READY_Pos)   /*!< 0x00000100 */
#define SYSCFG_CMPSD1CR_READY                   SYSCFG_CMPSD1CR_READY_Msk             /*!< Compensation cell ready flag */
#define SYSCFG_CMPSD1CR_RANSRC_Pos              (16U)
#define SYSCFG_CMPSD1CR_RANSRC_Msk              (0xFUL << SYSCFG_CMPSD1CR_RANSRC_Pos)  /*!< 0x000F0000 */
#define SYSCFG_CMPSD1CR_RANSRC                  SYSCFG_CMPSD1CR_RANSRC_Msk            /*!< NMOS I/O Compensation value sent to IOs when SW_CTRL = 1 */
#define SYSCFG_CMPSD1CR_RANSRC_0                (0x1UL << SYSCFG_CMPSD1CR_RANSRC_Pos)  /*!< 0x00010000 */
#define SYSCFG_CMPSD1CR_RANSRC_1                (0x2UL << SYSCFG_CMPSD1CR_RANSRC_Pos)  /*!< 0x00020000 */
#define SYSCFG_CMPSD1CR_RANSRC_2                (0x4UL << SYSCFG_CMPSD1CR_RANSRC_Pos)  /*!< 0x00040000 */
#define SYSCFG_CMPSD1CR_RANSRC_3                (0x8UL << SYSCFG_CMPSD1CR_RANSRC_Pos)  /*!< 0x00080000 */
#define SYSCFG_CMPSD1CR_RAPSRC_Pos              (20U)
#define SYSCFG_CMPSD1CR_RAPSRC_Msk              (0xFUL << SYSCFG_CMPSD1CR_RAPSRC_Pos)  /*!< 0x00F00000 */
#define SYSCFG_CMPSD1CR_RAPSRC                  SYSCFG_CMPSD1CR_RAPSRC_Msk            /*!< PMOS I/O Compensation value sent to IOs when SW_CTRL = 1 */
#define SYSCFG_CMPSD1CR_RAPSRC_0                (0x1UL << SYSCFG_CMPSD1CR_RAPSRC_Pos)  /*!< 0x00100000 */
#define SYSCFG_CMPSD1CR_RAPSRC_1                (0x2UL << SYSCFG_CMPSD1CR_RAPSRC_Pos)  /*!< 0x00200000 */
#define SYSCFG_CMPSD1CR_RAPSRC_2                (0x4UL << SYSCFG_CMPSD1CR_RAPSRC_Pos)  /*!< 0x00400000 */
#define SYSCFG_CMPSD1CR_RAPSRC_3                (0x8UL << SYSCFG_CMPSD1CR_RAPSRC_Pos)  /*!< 0x00800000 */
#define SYSCFG_CMPSD1CR_ANSRC_Pos               (24U)
#define SYSCFG_CMPSD1CR_ANSRC_Msk               (0xFUL << SYSCFG_CMPSD1CR_ANSRC_Pos)   /*!< 0x0F000000 */
#define SYSCFG_CMPSD1CR_ANSRC                   SYSCFG_CMPSD1CR_ANSRC_Msk             /*!< NMOS I/O Compensation value provided by compensation cell */
#define SYSCFG_CMPSD1CR_ANSRC_0                 (0x1UL << SYSCFG_CMPSD1CR_ANSRC_Pos)   /*!< 0x01000000 */
#define SYSCFG_CMPSD1CR_ANSRC_1                 (0x2UL << SYSCFG_CMPSD1CR_ANSRC_Pos)   /*!< 0x02000000 */
#define SYSCFG_CMPSD1CR_ANSRC_2                 (0x4UL << SYSCFG_CMPSD1CR_ANSRC_Pos)   /*!< 0x04000000 */
#define SYSCFG_CMPSD1CR_ANSRC_3                 (0x8UL << SYSCFG_CMPSD1CR_ANSRC_Pos)   /*!< 0x08000000 */
#define SYSCFG_CMPSD1CR_APSRC_Pos               (28U)
#define SYSCFG_CMPSD1CR_APSRC_Msk               (0xFUL << SYSCFG_CMPSD1CR_APSRC_Pos)   /*!< 0xF0000000 */
#define SYSCFG_CMPSD1CR_APSRC                   SYSCFG_CMPSD1CR_APSRC_Msk             /*!< PMOS I/O Compensation value provided by compensation cell */
#define SYSCFG_CMPSD1CR_APSRC_0                 (0x1UL << SYSCFG_CMPSD1CR_APSRC_Pos)   /*!< 0x10000000 */
#define SYSCFG_CMPSD1CR_APSRC_1                 (0x2UL << SYSCFG_CMPSD1CR_APSRC_Pos)   /*!< 0x20000000 */
#define SYSCFG_CMPSD1CR_APSRC_2                 (0x4UL << SYSCFG_CMPSD1CR_APSRC_Pos)   /*!< 0x40000000 */
#define SYSCFG_CMPSD1CR_APSRC_3                 (0x8UL << SYSCFG_CMPSD1CR_APSRC_Pos)   /*!< 0x80000000 */

/******************  Bit definition for SYSCFG_CMPSD1ENSETR register   ********************/
#define SYSCFG_CMPSD1ENSETR_EN_Pos                  (0U)
#define SYSCFG_CMPSD1ENSETR_EN_Msk                  (0x1UL << SYSCFG_CMPSD1ENSETR_EN_Pos)     /*!< 0x00000001 */
#define SYSCFG_CMPSD1ENSETR_EN                      SYSCFG_CMPSD1ENSETR_EN_Msk               /*!< Compensation cell enable */

/******************  Bit definition for SYSCFG_CMPSD1ENCLRR register   ********************/
#define SYSCFG_CMPSD1ENCLRR_EN_Pos                  (0U)
#define SYSCFG_CMPSD1ENCLRR_EN_Msk                  (0x1UL << SYSCFG_CMPSD1ENCLRR_EN_Pos)      /*!< 0x00000001 */
#define SYSCFG_CMPSD1ENCLRR_EN                      SYSCFG_CMPSD1ENCLRR_EN_Msk                /*!< Compensation cell disable */

/******************  Bit definition for SYSCFG_CMPSD2CR register   ********************/
#define SYSCFG_CMPSD2CR_SW_CTRL_Pos             (1U)
#define SYSCFG_CMPSD2CR_SW_CTRL_Msk             (0x1UL << SYSCFG_CMPSD2CR_SW_CTRL_Pos) /*!< 0x00000002 */
#define SYSCFG_CMPSD2CR_SW_CTRL                 SYSCFG_CMPSD2CR_SW_CTRL_Msk           /*!< Compensation Software Control */
#define SYSCFG_CMPSD2CR_READY_Pos               (8U)
#define SYSCFG_CMPSD2CR_READY_Msk               (0x1UL << SYSCFG_CMPSD2CR_READY_Pos)   /*!< 0x00000100 */
#define SYSCFG_CMPSD2CR_READY                   SYSCFG_CMPSD2CR_READY_Msk             /*!< Compensation cell ready flag */
#define SYSCFG_CMPSD2CR_RANSRC_Pos              (16U)
#define SYSCFG_CMPSD2CR_RANSRC_Msk              (0xFUL << SYSCFG_CMPSD2CR_RANSRC_Pos)  /*!< 0x000F0000 */
#define SYSCFG_CMPSD2CR_RANSRC                  SYSCFG_CMPSD2CR_RANSRC_Msk            /*!< NMOS I/O Compensation value sent to IOs when SW_CTRL = 1 */
#define SYSCFG_CMPSD2CR_RANSRC_0                (0x1UL << SYSCFG_CMPSD2CR_RANSRC_Pos)  /*!< 0x00010000 */
#define SYSCFG_CMPSD2CR_RANSRC_1                (0x2UL << SYSCFG_CMPSD2CR_RANSRC_Pos)  /*!< 0x00020000 */
#define SYSCFG_CMPSD2CR_RANSRC_2                (0x4UL << SYSCFG_CMPSD2CR_RANSRC_Pos)  /*!< 0x00040000 */
#define SYSCFG_CMPSD2CR_RANSRC_3                (0x8UL << SYSCFG_CMPSD2CR_RANSRC_Pos)  /*!< 0x00080000 */
#define SYSCFG_CMPSD2CR_RAPSRC_Pos              (20U)
#define SYSCFG_CMPSD2CR_RAPSRC_Msk              (0xFUL << SYSCFG_CMPSD2CR_RAPSRC_Pos)  /*!< 0x00F00000 */
#define SYSCFG_CMPSD2CR_RAPSRC                  SYSCFG_CMPSD2CR_RAPSRC_Msk            /*!< PMOS I/O Compensation value sent to IOs when SW_CTRL = 1 */
#define SYSCFG_CMPSD2CR_RAPSRC_0                (0x1UL << SYSCFG_CMPSD2CR_RAPSRC_Pos)  /*!< 0x00100000 */
#define SYSCFG_CMPSD2CR_RAPSRC_1                (0x2UL << SYSCFG_CMPSD2CR_RAPSRC_Pos)  /*!< 0x00200000 */
#define SYSCFG_CMPSD2CR_RAPSRC_2                (0x4UL << SYSCFG_CMPSD2CR_RAPSRC_Pos)  /*!< 0x00400000 */
#define SYSCFG_CMPSD2CR_RAPSRC_3                (0x8UL << SYSCFG_CMPSD2CR_RAPSRC_Pos)  /*!< 0x00800000 */
#define SYSCFG_CMPSD2CR_ANSRC_Pos               (24U)
#define SYSCFG_CMPSD2CR_ANSRC_Msk               (0xFUL << SYSCFG_CMPSD2CR_ANSRC_Pos)   /*!< 0x0F000000 */
#define SYSCFG_CMPSD2CR_ANSRC                   SYSCFG_CMPSD2CR_ANSRC_Msk             /*!< NMOS I/O Compensation value provided by compensation cell */
#define SYSCFG_CMPSD2CR_ANSRC_0                 (0x1UL << SYSCFG_CMPSD2CR_ANSRC_Pos)   /*!< 0x01000000 */
#define SYSCFG_CMPSD2CR_ANSRC_1                 (0x2UL << SYSCFG_CMPSD2CR_ANSRC_Pos)   /*!< 0x02000000 */
#define SYSCFG_CMPSD2CR_ANSRC_2                 (0x4UL << SYSCFG_CMPSD2CR_ANSRC_Pos)   /*!< 0x04000000 */
#define SYSCFG_CMPSD2CR_ANSRC_3                 (0x8UL << SYSCFG_CMPSD2CR_ANSRC_Pos)   /*!< 0x08000000 */
#define SYSCFG_CMPSD2CR_APSRC_Pos               (28U)
#define SYSCFG_CMPSD2CR_APSRC_Msk               (0xFUL << SYSCFG_CMPSD2CR_APSRC_Pos)   /*!< 0xF0000000 */
#define SYSCFG_CMPSD2CR_APSRC                   SYSCFG_CMPSD2CR_APSRC_Msk             /*!< PMOS I/O Compensation value provided by compensation cell */
#define SYSCFG_CMPSD2CR_APSRC_0                 (0x1UL << SYSCFG_CMPSD2CR_APSRC_Pos)   /*!< 0x10000000 */
#define SYSCFG_CMPSD2CR_APSRC_1                 (0x2UL << SYSCFG_CMPSD2CR_APSRC_Pos)   /*!< 0x20000000 */
#define SYSCFG_CMPSD2CR_APSRC_2                 (0x4UL << SYSCFG_CMPSD2CR_APSRC_Pos)   /*!< 0x40000000 */
#define SYSCFG_CMPSD2CR_APSRC_3                 (0x8UL << SYSCFG_CMPSD2CR_APSRC_Pos)   /*!< 0x80000000 */

/******************  Bit definition for SYSCFG_CMPSD2ENSETR register   ********************/
#define SYSCFG_CMPSD2ENSETR_EN_Pos                  (0U)
#define SYSCFG_CMPSD2ENSETR_EN_Msk                  (0x1UL << SYSCFG_CMPSD2ENSETR_EN_Pos)     /*!< 0x00000001 */
#define SYSCFG_CMPSD2ENSETR_EN                      SYSCFG_CMPSD2ENSETR_EN_Msk               /*!< Compensation cell enable */

