zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/********************  Bit definition for USB_OTG_HAINT register  ********************/
#define USB_OTG_HAINT_HAINT_Pos                  (0U)
#define USB_OTG_HAINT_HAINT_Msk                  (0xFFFFUL << USB_OTG_HAINT_HAINT_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HAINT_HAINT                      USB_OTG_HAINT_HAINT_Msk       /*!< Channel interrupts */

/********************  Bit definition for USB_OTG_DOEPMSK register  ********************/
#define USB_OTG_DOEPMSK_XFRCM_Pos              (0U)
#define USB_OTG_DOEPMSK_XFRCM_Msk              (0x1UL << USB_OTG_DOEPMSK_XFRCM_Pos)         /*!< 0x00000001 */
#define USB_OTG_DOEPMSK_XFRCM                  USB_OTG_DOEPMSK_XFRCM_Msk                   /*!< Transfer completed interrupt mask */
#define USB_OTG_DOEPMSK_EPDM_Pos               (1U)
#define USB_OTG_DOEPMSK_EPDM_Msk               (0x1UL << USB_OTG_DOEPMSK_EPDM_Pos)          /*!< 0x00000002 */
#define USB_OTG_DOEPMSK_EPDM                   USB_OTG_DOEPMSK_EPDM_Msk                    /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DOEPMSK_AHBERRM_Pos            (2U)
#define USB_OTG_DOEPMSK_AHBERRM_Msk            (0x1UL << USB_OTG_DOEPMSK_AHBERRM_Pos)       /*!< 0x00000004 */
#define USB_OTG_DOEPMSK_AHBERRM                USB_OTG_DOEPMSK_AHBERRM_Msk                 /*!< AHB error mask */
#define USB_OTG_DOEPMSK_STUPM_Pos              (3U)
#define USB_OTG_DOEPMSK_STUPM_Msk              (0x1UL << USB_OTG_DOEPMSK_STUPM_Pos)         /*!< 0x00000008 */
#define USB_OTG_DOEPMSK_STUPM                  USB_OTG_DOEPMSK_STUPM_Msk                   /*!< STUPM: SETUP phase done mask */
#define USB_OTG_DOEPMSK_OTEPDM_Pos             (4U)
#define USB_OTG_DOEPMSK_OTEPDM_Msk             (0x1UL << USB_OTG_DOEPMSK_OTEPDM_Pos)        /*!< 0x00000010 */
#define USB_OTG_DOEPMSK_OTEPDM                 USB_OTG_DOEPMSK_OTEPDM_Msk                  /*!< OUT token received when endpoint disabled mask */
#define USB_OTG_DOEPMSK_STSPHSRXM_Pos          (5U)
#define USB_OTG_DOEPMSK_STSPHSRXM_Msk          (0x1UL << USB_OTG_DOEPMSK_STSPHSRXM_Pos)     /*!< 0x00000020 */
#define USB_OTG_DOEPMSK_STSPHSRXM              USB_OTG_DOEPMSK_STSPHSRXM_Msk               /*!< Status phase received for control write mask */
#define USB_OTG_DOEPMSK_B2BSTUPM_Pos           (6U)
#define USB_OTG_DOEPMSK_B2BSTUPM_Msk           (0x1UL << USB_OTG_DOEPMSK_B2BSTUPM_Pos)      /*!< 0x00000040 */
#define USB_OTG_DOEPMSK_B2BSTUPM               USB_OTG_DOEPMSK_B2BSTUPM_Msk                /*!< Back-to-back SETUP packets received mask */
#define USB_OTG_DOEPMSK_OUTPKTERRM_Pos         (8U)
#define USB_OTG_DOEPMSK_OUTPKTERRM_Msk         (0x1UL << USB_OTG_DOEPMSK_OUTPKTERRM_Pos)    /*!< 0x00000100 */
#define USB_OTG_DOEPMSK_OUTPKTERRM             USB_OTG_DOEPMSK_OUTPKTERRM_Msk              /*!< Out packet error mask */
#define USB_OTG_DOEPMSK_BNAM_Pos               (9U)
#define USB_OTG_DOEPMSK_BNAM_Msk               (0x1UL << USB_OTG_DOEPMSK_BNAM_Pos)          /*!< 0x00000200 */
#define USB_OTG_DOEPMSK_BNAM                   USB_OTG_DOEPMSK_BNAM_Msk                    /*!< BNA interrupt mask */
#define USB_OTG_DOEPMSK_BERRM_Pos              (12U)
#define USB_OTG_DOEPMSK_BERRM_Msk              (0x1UL << USB_OTG_DOEPMSK_BERRM_Pos)         /*!< 0x00001000 */
#define USB_OTG_DOEPMSK_BERRM                  USB_OTG_DOEPMSK_BERRM_Msk                   /*!< Babble error interrupt mask */
#define USB_OTG_DOEPMSK_NAKMSK_Pos             (13U)
#define USB_OTG_DOEPMSK_NAKMSK_Msk             (0x1UL << USB_OTG_DOEPMSK_NAKMSK_Pos)        /*!< 0x00002000 */
#define USB_OTG_DOEPMSK_NAKMSK                 USB_OTG_DOEPMSK_NAKMSK_Msk                  /*!< NAK interrupt mask */
#define USB_OTG_DOEPMSK_NYETMSK_Pos            (14U)
#define USB_OTG_DOEPMSK_NYETMSK_Msk            (0x1UL << USB_OTG_DOEPMSK_NYETMSK_Pos)       /*!< 0x00004000 */
#define USB_OTG_DOEPMSK_NYETMSK                USB_OTG_DOEPMSK_NYETMSK_Msk                 /*!< NYET interrupt mask */                            */

/********************  Bit definition for USB_OTG_GINTSTS register  ********************/
#define USB_OTG_GINTSTS_CMOD_Pos               (0U)
#define USB_OTG_GINTSTS_CMOD_Msk               (0x1UL << USB_OTG_GINTSTS_CMOD_Pos)          /*!< 0x00000001 */
#define USB_OTG_GINTSTS_CMOD                   USB_OTG_GINTSTS_CMOD_Msk                    /*!< Current mode of operation */
#define USB_OTG_GINTSTS_MMIS_Pos               (1U)
#define USB_OTG_GINTSTS_MMIS_Msk               (0x1UL << USB_OTG_GINTSTS_MMIS_Pos)          /*!< 0x00000002 */
#define USB_OTG_GINTSTS_MMIS                   USB_OTG_GINTSTS_MMIS_Msk                    /*!< Mode mismatch interrupt */
#define USB_OTG_GINTSTS_OTGINT_Pos             (2U)
#define USB_OTG_GINTSTS_OTGINT_Msk             (0x1UL << USB_OTG_GINTSTS_OTGINT_Pos)        /*!< 0x00000004 */
#define USB_OTG_GINTSTS_OTGINT                 USB_OTG_GINTSTS_OTGINT_Msk                  /*!< OTG interrupt */
#define USB_OTG_GINTSTS_SOF_Pos                (3U)
#define USB_OTG_GINTSTS_SOF_Msk                (0x1UL << USB_OTG_GINTSTS_SOF_Pos)           /*!< 0x00000008 */
#define USB_OTG_GINTSTS_SOF                    USB_OTG_GINTSTS_SOF_Msk                     /*!< Start of frame */
#define USB_OTG_GINTSTS_RXFLVL_Pos             (4U)
#define USB_OTG_GINTSTS_RXFLVL_Msk             (0x1UL << USB_OTG_GINTSTS_RXFLVL_Pos)        /*!< 0x00000010 */
#define USB_OTG_GINTSTS_RXFLVL                 USB_OTG_GINTSTS_RXFLVL_Msk                  /*!< Rx FIFO non-empty */
#define USB_OTG_GINTSTS_NPTXFE_Pos             (5U)
#define USB_OTG_GINTSTS_NPTXFE_Msk             (0x1UL << USB_OTG_GINTSTS_NPTXFE_Pos)        /*!< 0x00000020 */
#define USB_OTG_GINTSTS_NPTXFE                 USB_OTG_GINTSTS_NPTXFE_Msk                  /*!< Non-periodic Tx FIFO empty */
#define USB_OTG_GINTSTS_GINAKEFF_Pos           (6U)
#define USB_OTG_GINTSTS_GINAKEFF_Msk           (0x1UL << USB_OTG_GINTSTS_GINAKEFF_Pos)      /*!< 0x00000040 */
#define USB_OTG_GINTSTS_GINAKEFF               USB_OTG_GINTSTS_GINAKEFF_Msk                /*!< Global IN non-periodic NAK effective */
#define USB_OTG_GINTSTS_GONAKEFF_Pos           (7U)
#define USB_OTG_GINTSTS_GONAKEFF_Msk           (0x1UL << USB_OTG_GINTSTS_GONAKEFF_Pos)      /*!< 0x00000080 */
#define USB_OTG_GINTSTS_GONAKEFF               USB_OTG_GINTSTS_GONAKEFF_Msk                /*!< Global OUT NAK effective */
#define USB_OTG_GINTSTS_ESUSP_Pos              (10U)
#define USB_OTG_GINTSTS_ESUSP_Msk              (0x1UL << USB_OTG_GINTSTS_ESUSP_Pos)         /*!< 0x00000400 */
#define USB_OTG_GINTSTS_ESUSP                  USB_OTG_GINTSTS_ESUSP_Msk                   /*!< Early suspend */
#define USB_OTG_GINTSTS_USBSUSP_Pos            (11U)
#define USB_OTG_GINTSTS_USBSUSP_Msk            (0x1UL << USB_OTG_GINTSTS_USBSUSP_Pos)       /*!< 0x00000800 */
#define USB_OTG_GINTSTS_USBSUSP                USB_OTG_GINTSTS_USBSUSP_Msk                 /*!< USB suspend */
#define USB_OTG_GINTSTS_USBRST_Pos             (12U)
#define USB_OTG_GINTSTS_USBRST_Msk             (0x1UL << USB_OTG_GINTSTS_USBRST_Pos)        /*!< 0x00001000 */
#define USB_OTG_GINTSTS_USBRST                 USB_OTG_GINTSTS_USBRST_Msk                  /*!< USB reset */
#define USB_OTG_GINTSTS_ENUMDNE_Pos            (13U)
#define USB_OTG_GINTSTS_ENUMDNE_Msk            (0x1UL << USB_OTG_GINTSTS_ENUMDNE_Pos)       /*!< 0x00002000 */
#define USB_OTG_GINTSTS_ENUMDNE                USB_OTG_GINTSTS_ENUMDNE_Msk                 /*!< Enumeration done */
#define USB_OTG_GINTSTS_ISOODRP_Pos            (14U)
#define USB_OTG_GINTSTS_ISOODRP_Msk            (0x1UL << USB_OTG_GINTSTS_ISOODRP_Pos)       /*!< 0x00004000 */
#define USB_OTG_GINTSTS_ISOODRP                USB_OTG_GINTSTS_ISOODRP_Msk                 /*!< Isochronous OUT packet dropped interrupt */
#define USB_OTG_GINTSTS_EOPF_Pos               (15U)
#define USB_OTG_GINTSTS_EOPF_Msk               (0x1UL << USB_OTG_GINTSTS_EOPF_Pos)          /*!< 0x00008000 */
#define USB_OTG_GINTSTS_EOPF                   USB_OTG_GINTSTS_EOPF_Msk                    /*!< End of periodic frame interrupt */
#define USB_OTG_GINTSTS_IEPINT_Pos             (18U)
#define USB_OTG_GINTSTS_IEPINT_Msk             (0x1UL << USB_OTG_GINTSTS_IEPINT_Pos)        /*!< 0x00040000 */
#define USB_OTG_GINTSTS_IEPINT                 USB_OTG_GINTSTS_IEPINT_Msk                  /*!< IN endpoint interrupt */
#define USB_OTG_GINTSTS_OEPINT_Pos             (19U)
#define USB_OTG_GINTSTS_OEPINT_Msk             (0x1UL << USB_OTG_GINTSTS_OEPINT_Pos)        /*!< 0x00080000 */
#define USB_OTG_GINTSTS_OEPINT                 USB_OTG_GINTSTS_OEPINT_Msk                  /*!< OUT endpoint interrupt */
#define USB_OTG_GINTSTS_IISOIXFR_Pos           (20U)
#define USB_OTG_GINTSTS_IISOIXFR_Msk           (0x1UL << USB_OTG_GINTSTS_IISOIXFR_Pos)      /*!< 0x00100000 */
#define USB_OTG_GINTSTS_IISOIXFR               USB_OTG_GINTSTS_IISOIXFR_Msk                /*!< Incomplete isochronous IN transfer */
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT_Pos  (21U)
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT_Msk  (0x1UL << USB_OTG_GINTSTS_PXFR_INCOMPISOOUT_Pos)         /*!< 0x00200000 */
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT      USB_OTG_GINTSTS_PXFR_INCOMPISOOUT_Msk                   /*!< Incomplete periodic transfer */
#define USB_OTG_GINTSTS_DATAFSUSP_Pos          (22U)
#define USB_OTG_GINTSTS_DATAFSUSP_Msk          (0x1UL << USB_OTG_GINTSTS_DATAFSUSP_Pos)     /*!< 0x00400000 */
#define USB_OTG_GINTSTS_DATAFSUSP              USB_OTG_GINTSTS_DATAFSUSP_Msk               /*!< Data fetch suspended */
#define USB_OTG_GINTSTS_RSTDET_Pos             (23U)
#define USB_OTG_GINTSTS_RSTDET_Msk             (0x1UL << USB_OTG_GINTSTS_RSTDET_Pos)        /*!< 0x00800000 */
#define USB_OTG_GINTSTS_RSTDET                 USB_OTG_GINTSTS_RSTDET_Msk                  /*!< Reset detected interrupt */
#define USB_OTG_GINTSTS_HPRTINT_Pos            (24U)
#define USB_OTG_GINTSTS_HPRTINT_Msk            (0x1UL << USB_OTG_GINTSTS_HPRTINT_Pos)       /*!< 0x01000000 */
#define USB_OTG_GINTSTS_HPRTINT                USB_OTG_GINTSTS_HPRTINT_Msk                 /*!< Host port interrupt */
#define USB_OTG_GINTSTS_HCINT_Pos              (25U)
#define USB_OTG_GINTSTS_HCINT_Msk              (0x1UL << USB_OTG_GINTSTS_HCINT_Pos)         /*!< 0x02000000 */
#define USB_OTG_GINTSTS_HCINT                  USB_OTG_GINTSTS_HCINT_Msk                   /*!< Host channels interrupt */
#define USB_OTG_GINTSTS_PTXFE_Pos              (26U)
#define USB_OTG_GINTSTS_PTXFE_Msk              (0x1UL << USB_OTG_GINTSTS_PTXFE_Pos)         /*!< 0x04000000 */
#define USB_OTG_GINTSTS_PTXFE                  USB_OTG_GINTSTS_PTXFE_Msk                   /*!< Periodic Tx FIFO empty */
#define USB_OTG_GINTSTS_LPMINT_Pos             (27U)
#define USB_OTG_GINTSTS_LPMINT_Msk             (0x1UL << USB_OTG_GINTSTS_LPMINT_Pos)        /*!< 0x08000000 */
#define USB_OTG_GINTSTS_LPMINT                 USB_OTG_GINTSTS_LPMINT_Msk                  /*!< LPM interrupt */
#define USB_OTG_GINTSTS_CIDSCHG_Pos            (28U)
#define USB_OTG_GINTSTS_CIDSCHG_Msk            (0x1UL << USB_OTG_GINTSTS_CIDSCHG_Pos)       /*!< 0x10000000 */
#define USB_OTG_GINTSTS_CIDSCHG                USB_OTG_GINTSTS_CIDSCHG_Msk                 /*!< Connector ID status change */
#define USB_OTG_GINTSTS_DISCINT_Pos            (29U)
#define USB_OTG_GINTSTS_DISCINT_Msk            (0x1UL << USB_OTG_GINTSTS_DISCINT_Pos)       /*!< 0x20000000 */
#define USB_OTG_GINTSTS_DISCINT                USB_OTG_GINTSTS_DISCINT_Msk                 /*!< Disconnect detected interrupt */
#define USB_OTG_GINTSTS_SRQINT_Pos             (30U)
#define USB_OTG_GINTSTS_SRQINT_Msk             (0x1UL << USB_OTG_GINTSTS_SRQINT_Pos)        /*!< 0x40000000 */
#define USB_OTG_GINTSTS_SRQINT                 USB_OTG_GINTSTS_SRQINT_Msk                  /*!< Session request/new session detected interrupt */
#define USB_OTG_GINTSTS_WKUINT_Pos             (31U)
#define USB_OTG_GINTSTS_WKUINT_Msk             (0x1UL << USB_OTG_GINTSTS_WKUINT_Pos)       /*!< 0x80000000 */
#define USB_OTG_GINTSTS_WKUINT                 USB_OTG_GINTSTS_WKUINT_Msk                 /*!< Resume/remote wakeup detected interrupt */

