zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135axx_ca7.h
/****************  Bit definition for ETZPC_DECPROT3 register ****************/
#define ETZPC_DECPROT3_ETH1_Pos               (0U)
#define ETZPC_DECPROT3_ETH1_Msk               (0x3UL << ETZPC_DECPROT3_ETH1_Pos) /*!< Define security for ETH1 */
#define ETZPC_DECPROT3_ETH1                   ETZPC_DECPROT3_ETH1_Msk
#define ETZPC_DECPROT3_ETH2_Pos               (2U)
#define ETZPC_DECPROT3_ETH2_Msk               (0x3UL << ETZPC_DECPROT3_ETH2_Pos) /*!< Define security for ETH2 */
#define ETZPC_DECPROT3_ETH2                   ETZPC_DECPROT3_ETH2_Msk
#define ETZPC_DECPROT3_SDMMC1_Pos             (4U)
#define ETZPC_DECPROT3_SDMMC1_Msk             (0x3UL << ETZPC_DECPROT3_SDMMC1_Pos) /*!< Define security for SDMMC1 and DLBSD1 */
#define ETZPC_DECPROT3_SDMMC1                 ETZPC_DECPROT3_SDMMC1_Msk
#define ETZPC_DECPROT3_SDMMC2_Pos             (6U)
#define ETZPC_DECPROT3_SDMMC2_Msk             (0x3UL << ETZPC_DECPROT3_SDMMC2_Pos) /*!< Define security for SDMMC2 and DLBSD2 */
#define ETZPC_DECPROT3_SDMMC2                 ETZPC_DECPROT3_SDMMC2_Msk
#define ETZPC_DECPROT3_DDRMCE_Pos             (10U)
#define ETZPC_DECPROT3_DDRMCE_Msk             (0x3UL << ETZPC_DECPROT3_DDRMCE_Pos) /*!< Define security for DDRMCE */
#define ETZPC_DECPROT3_DDRMCE                 ETZPC_DECPROT3_DDRMCE_Msk
#define ETZPC_DECPROT3_FMC_Pos                (12U)
#define ETZPC_DECPROT3_FMC_Msk                (0x3UL << ETZPC_DECPROT3_FMC_Pos) /*!< Define security for FMC */
#define ETZPC_DECPROT3_FMC                    ETZPC_DECPROT3_FMC_Msk
#define ETZPC_DECPROT3_QSPI_Pos               (14U)
#define ETZPC_DECPROT3_QSPI_Msk               (0x3UL << ETZPC_DECPROT3_QSPI_Pos) /*!< Define security for QSPI and DLBQ */
#define ETZPC_DECPROT3_QSPI                   ETZPC_DECPROT3_QSPI_Msk
#define ETZPC_DECPROT3_SRAM1_Pos              (24U)
#define ETZPC_DECPROT3_SRAM1_Msk              (0x3UL << ETZPC_DECPROT3_SRAM1_Pos) /*!< Define security for SRAM1 */
#define ETZPC_DECPROT3_SRAM1                  ETZPC_DECPROT3_SRAM1_Msk
#define ETZPC_DECPROT3_SRAM2_Pos              (26U)
#define ETZPC_DECPROT3_SRAM2_Msk              (0x3UL << ETZPC_DECPROT3_SRAM2_Pos) /*!< Define security for SRAM2 */
#define ETZPC_DECPROT3_SRAM2                  ETZPC_DECPROT3_SRAM2_Msk
#define ETZPC_DECPROT3_SRAM3_Pos              (28U)
#define ETZPC_DECPROT3_SRAM3_Msk              (0x3UL << ETZPC_DECPROT3_SRAM3_Pos) /*!< Define security for SRAM3 */
#define ETZPC_DECPROT3_SRAM3                  ETZPC_DECPROT3_SRAM3_Msk

/****************  Bit definition for ETZPC_DECPROT_LOCK0 register ****************/
#define ETZPC_DECPROT_LOCK0_VREFBUF_Pos       (0U)
#define ETZPC_DECPROT_LOCK0_VREFBUF_Msk       (0x1UL << ETZPC_DECPROT_LOCK0_VREFBUF_Pos) /*!< Define security for VREFBUF */
#define ETZPC_DECPROT_LOCK0_VREFBUF           ETZPC_DECPROT_LOCK0_VREFBUF_Msk
#define ETZPC_DECPROT_LOCK0_LPTIM2_Pos        (1U)
#define ETZPC_DECPROT_LOCK0_LPTIM2_Msk        (0x1UL << ETZPC_DECPROT_LOCK0_LPTIM2_Pos) /*!< Define security for LPTIM2 */
#define ETZPC_DECPROT_LOCK0_LPTIM2            ETZPC_DECPROT_LOCK0_LPTIM2_Msk
#define ETZPC_DECPROT_LOCK0_LPTIM3_Pos        (2U)
#define ETZPC_DECPROT_LOCK0_LPTIM3_Msk        (0x1UL << ETZPC_DECPROT_LOCK0_LPTIM3_Pos) /*!< Define security for LPTIM3 */
#define ETZPC_DECPROT_LOCK0_LPTIM3            ETZPC_DECPROT_LOCK0_LPTIM3_Msk
#define ETZPC_DECPROT_LOCK0_LTDC_Pos          (3U)
#define ETZPC_DECPROT_LOCK0_LTDC_Msk          (0x1UL << ETZPC_DECPROT_LOCK0_LTDC_Pos) /*!< Define security for LTDC layer 2 */
#define ETZPC_DECPROT_LOCK0_LTDC              ETZPC_DECPROT_LOCK0_LTDC_Msk
#define ETZPC_DECPROT_LOCK0_DCMIPP_Pos        (4U)
#define ETZPC_DECPROT_LOCK0_DCMIPP_Msk        (0x1UL << ETZPC_DECPROT_LOCK0_DCMIPP_Pos) /*!< Define security for DCMIPP */
#define ETZPC_DECPROT_LOCK0_DCMIPP            ETZPC_DECPROT_LOCK0_DCMIPP_Msk
#define ETZPC_DECPROT_LOCK0_USBPHYC_Pos       (5U)
#define ETZPC_DECPROT_LOCK0_USBPHYC_Msk       (0x1UL << ETZPC_DECPROT_LOCK0_USBPHYC_Pos) /*!< Define security for USBPHYC */
#define ETZPC_DECPROT_LOCK0_USBPHYC           ETZPC_DECPROT_LOCK0_USBPHYC_Msk
#define ETZPC_DECPROT_LOCK0_DDRCTRL_Pos       (6U)
#define ETZPC_DECPROT_LOCK0_DDRCTRL_Msk       (0x1UL << ETZPC_DECPROT_LOCK0_DDRCTRL_Pos) /*!< Define security for DDRCTRL and DDRPHYC */
#define ETZPC_DECPROT_LOCK0_DDRCTRL           ETZPC_DECPROT_LOCK0_DDRCTRL_Msk
#define ETZPC_DECPROT_LOCK0_IWDG1_Pos         (12U)
#define ETZPC_DECPROT_LOCK0_IWDG1_Msk         (0x1UL << ETZPC_DECPROT_LOCK0_IWDG1_Pos) /*!< Define security for IWDG1 */
#define ETZPC_DECPROT_LOCK0_IWDG1             ETZPC_DECPROT_LOCK0_IWDG1_Msk
#define ETZPC_DECPROT_LOCK0_STGENC_Pos        (13U)
#define ETZPC_DECPROT_LOCK0_STGENC_Msk        (0x1UL << ETZPC_DECPROT_LOCK0_STGENC_Pos) /*!< Define security for STGENC */
#define ETZPC_DECPROT_LOCK0_STGENC            ETZPC_DECPROT_LOCK0_STGENC_Msk
#define ETZPC_DECPROT_LOCK0_USART1_Pos        (16U)
#define ETZPC_DECPROT_LOCK0_USART1_Msk        (0x1UL << ETZPC_DECPROT_LOCK0_USART1_Pos) /*!< Define security for USART1 */
#define ETZPC_DECPROT_LOCK0_USART1            ETZPC_DECPROT_LOCK0_USART1_Msk
#define ETZPC_DECPROT_LOCK0_USART2_Pos        (17U)
#define ETZPC_DECPROT_LOCK0_USART2_Msk        (0x1UL << ETZPC_DECPROT_LOCK0_USART2_Pos) /*!< Define security for USART2 */
#define ETZPC_DECPROT_LOCK0_USART2            ETZPC_DECPROT_LOCK0_USART2_Msk
#define ETZPC_DECPROT_LOCK0_SPI4_Pos          (18U)
#define ETZPC_DECPROT_LOCK0_SPI4_Msk          (0x1UL << ETZPC_DECPROT_LOCK0_SPI4_Pos) /*!< Define security for SPI4 */
#define ETZPC_DECPROT_LOCK0_SPI4              ETZPC_DECPROT_LOCK0_SPI4_Msk
#define ETZPC_DECPROT_LOCK0_SPI5_Pos          (19U)
#define ETZPC_DECPROT_LOCK0_SPI5_Msk          (0x1UL << ETZPC_DECPROT_LOCK0_SPI5_Pos) /*!< Define security for SPI5 */
#define ETZPC_DECPROT_LOCK0_SPI5              ETZPC_DECPROT_LOCK0_SPI5_Msk
#define ETZPC_DECPROT_LOCK0_I2C3_Pos          (20U)
#define ETZPC_DECPROT_LOCK0_I2C3_Msk          (0x1UL << ETZPC_DECPROT_LOCK0_I2C3_Pos) /*!< Define security for I2C3 */
#define ETZPC_DECPROT_LOCK0_I2C3              ETZPC_DECPROT_LOCK0_I2C3_Msk
#define ETZPC_DECPROT_LOCK0_I2C4_Pos          (21U)
#define ETZPC_DECPROT_LOCK0_I2C4_Msk          (0x1UL << ETZPC_DECPROT_LOCK0_I2C4_Pos) /*!< Define security for I2C4 */
#define ETZPC_DECPROT_LOCK0_I2C4              ETZPC_DECPROT_LOCK0_I2C4_Msk
#define ETZPC_DECPROT_LOCK0_I2C5_Pos          (22U)
#define ETZPC_DECPROT_LOCK0_I2C5_Msk          (0x1UL << ETZPC_DECPROT_LOCK0_I2C5_Pos) /*!< Define security for I2C5 */
#define ETZPC_DECPROT_LOCK0_I2C5              ETZPC_DECPROT_LOCK0_I2C5_Msk
#define ETZPC_DECPROT_LOCK0_TIM12_Pos         (23U)
#define ETZPC_DECPROT_LOCK0_TIM12_Msk         (0x1UL << ETZPC_DECPROT_LOCK0_TIM12_Pos) /*!< Define security for TIM12 */
#define ETZPC_DECPROT_LOCK0_TIM12             ETZPC_DECPROT_LOCK0_TIM12_Msk
#define ETZPC_DECPROT_LOCK0_TIM13_Pos         (24U)
#define ETZPC_DECPROT_LOCK0_TIM13_Msk         (0x1UL << ETZPC_DECPROT_LOCK0_TIM13_Pos) /*!< Define security for TIM13 */
#define ETZPC_DECPROT_LOCK0_TIM13             ETZPC_DECPROT_LOCK0_TIM13_Msk
#define ETZPC_DECPROT_LOCK0_TIM14_Pos         (25U)
#define ETZPC_DECPROT_LOCK0_TIM14_Msk         (0x1UL << ETZPC_DECPROT_LOCK0_TIM14_Pos) /*!< Define security for TIM14 */
#define ETZPC_DECPROT_LOCK0_TIM14             ETZPC_DECPROT_LOCK0_TIM14_Msk
#define ETZPC_DECPROT_LOCK0_TIM15_Pos         (26U)
#define ETZPC_DECPROT_LOCK0_TIM15_Msk         (0x1UL << ETZPC_DECPROT_LOCK0_TIM15_Pos) /*!< Define security for TIM15 */
#define ETZPC_DECPROT_LOCK0_TIM15             ETZPC_DECPROT_LOCK0_TIM15_Msk
#define ETZPC_DECPROT_LOCK0_TIM16_Pos         (27U)
#define ETZPC_DECPROT_LOCK0_TIM16_Msk         (0x1UL << ETZPC_DECPROT_LOCK0_TIM16_Pos) /*!< Define security for TIM16 */
#define ETZPC_DECPROT_LOCK0_TIM16             ETZPC_DECPROT_LOCK0_TIM16_Msk
#define ETZPC_DECPROT_LOCK0_TIM17_Pos         (28U)
#define ETZPC_DECPROT_LOCK0_TIM17_Msk         (0x1UL << ETZPC_DECPROT_LOCK0_TIM17_Pos) /*!< Define security for TIM17 */
#define ETZPC_DECPROT_LOCK0_TIM17             ETZPC_DECPROT_LOCK0_TIM17_Msk

/****************  Bit definition for ETZPC_DECPROT_LOCK1 register ****************/
#define ETZPC_DECPROT_LOCK1_ADC1_Pos          (0U)
#define ETZPC_DECPROT_LOCK1_ADC1_Msk          (0x1UL << ETZPC_DECPROT_LOCK1_ADC1_Pos) /*!< Define security for ADC1 */
#define ETZPC_DECPROT_LOCK1_ADC1              ETZPC_DECPROT_LOCK1_ADC1_Msk
#define ETZPC_DECPROT_LOCK1_ADC2_Pos          (1U)
#define ETZPC_DECPROT_LOCK1_ADC2_Msk          (0x1UL << ETZPC_DECPROT_LOCK1_ADC2_Pos) /*!< Define security for ADC2 */
#define ETZPC_DECPROT_LOCK1_ADC2              ETZPC_DECPROT_LOCK1_ADC2_Msk
#define ETZPC_DECPROT_LOCK1_OTG_Pos           (2U)
#define ETZPC_DECPROT_LOCK1_OTG_Msk           (0x1UL << ETZPC_DECPROT_LOCK1_OTG_Pos) /*!< Define security for OTG */
#define ETZPC_DECPROT_LOCK1_OTG               ETZPC_DECPROT_LOCK1_OTG_Msk
#define ETZPC_DECPROT_LOCK1_RNG_Pos           (8U)
#define ETZPC_DECPROT_LOCK1_RNG_Msk           (0x1UL << ETZPC_DECPROT_LOCK1_RNG_Pos) /*!< Define security for RNG */
#define ETZPC_DECPROT_LOCK1_RNG               ETZPC_DECPROT_LOCK1_RNG_Msk
#define ETZPC_DECPROT_LOCK1_HASH_Pos          (9U)
#define ETZPC_DECPROT_LOCK1_HASH_Msk          (0x1UL << ETZPC_DECPROT_LOCK1_HASH_Pos) /*!< Define security for HASH */
#define ETZPC_DECPROT_LOCK1_HASH              ETZPC_DECPROT_LOCK1_HASH_Msk
#define ETZPC_DECPROT_LOCK1_CRYP_Pos          (10U)
#define ETZPC_DECPROT_LOCK1_CRYP_Msk          (0x1UL << ETZPC_DECPROT_LOCK1_CRYP_Pos) /*!< Define security for CRYP */
#define ETZPC_DECPROT_LOCK1_CRYP              ETZPC_DECPROT_LOCK1_CRYP_Msk
#define ETZPC_DECPROT_LOCK1_SAES_Pos          (11U)
#define ETZPC_DECPROT_LOCK1_SAES_Msk          (0x1UL << ETZPC_DECPROT_LOCK1_SAES_Pos) /*!< Define security for SAES */
#define ETZPC_DECPROT_LOCK1_SAES              ETZPC_DECPROT_LOCK1_SAES_Msk
#define ETZPC_DECPROT_LOCK1_PKA_Pos           (12U)
#define ETZPC_DECPROT_LOCK1_PKA_Msk           (0x1UL << ETZPC_DECPROT_LOCK1_PKA_Pos) /*!< Define security for PKA */
#define ETZPC_DECPROT_LOCK1_PKA               ETZPC_DECPROT_LOCK1_PKA_Msk
#define ETZPC_DECPROT_LOCK1_BKPSRAM_Pos       (13U)
#define ETZPC_DECPROT_LOCK1_BKPSRAM_Msk       (0x1UL << ETZPC_DECPROT_LOCK1_BKPSRAM_Pos) /*!< Define security for BKPSRAM */
#define ETZPC_DECPROT_LOCK1_BKPSRAM           ETZPC_DECPROT_LOCK1_BKPSRAM_Msk
#define ETZPC_DECPROT_LOCK1_ETH1_Pos          (16U)
#define ETZPC_DECPROT_LOCK1_ETH1_Msk          (0x1UL << ETZPC_DECPROT_LOCK1_ETH1_Pos) /*!< Define security for ETH1 */
#define ETZPC_DECPROT_LOCK1_ETH1              ETZPC_DECPROT_LOCK1_ETH1_Msk
#define ETZPC_DECPROT_LOCK1_ETH2_Pos          (17U)
#define ETZPC_DECPROT_LOCK1_ETH2_Msk          (0x1UL << ETZPC_DECPROT_LOCK1_ETH2_Pos) /*!< Define security for ETH2 */
#define ETZPC_DECPROT_LOCK1_ETH2              ETZPC_DECPROT_LOCK1_ETH2_Msk
#define ETZPC_DECPROT_LOCK1_SDMMC1_Pos        (18U)
#define ETZPC_DECPROT_LOCK1_SDMMC1_Msk        (0x1UL << ETZPC_DECPROT_LOCK1_SDMMC1_Pos) /*!< Define security for SDMMC1 and DLBSD1 */
#define ETZPC_DECPROT_LOCK1_SDMMC1            ETZPC_DECPROT_LOCK1_SDMMC1_Msk
#define ETZPC_DECPROT_LOCK1_SDMMC2_Pos        (19U)
#define ETZPC_DECPROT_LOCK1_SDMMC2_Msk        (0x1UL << ETZPC_DECPROT_LOCK1_SDMMC2_Pos) /*!< Define security for SDMMC2 and DLBSD2 */
#define ETZPC_DECPROT_LOCK1_SDMMC2            ETZPC_DECPROT_LOCK1_SDMMC2_Msk
#define ETZPC_DECPROT_LOCK1_DDRMCE_Pos        (21U)
#define ETZPC_DECPROT_LOCK1_DDRMCE_Msk        (0x1UL << ETZPC_DECPROT_LOCK1_DDRMCE_Pos) /*!< Define security for DDRMCE */
#define ETZPC_DECPROT_LOCK1_DDRMCE            ETZPC_DECPROT_LOCK1_DDRMCE_Msk
#define ETZPC_DECPROT_LOCK1_FMC_Pos           (22U)
#define ETZPC_DECPROT_LOCK1_FMC_Msk           (0x1UL << ETZPC_DECPROT_LOCK1_FMC_Pos) /*!< Define security for FMC */
#define ETZPC_DECPROT_LOCK1_FMC               ETZPC_DECPROT_LOCK1_FMC_Msk
#define ETZPC_DECPROT_LOCK1_QSPI_Pos          (23U)
#define ETZPC_DECPROT_LOCK1_QSPI_Msk          (0x1UL << ETZPC_DECPROT_LOCK1_QSPI_Pos) /*!< Define security for QSPI and DLBQ */
#define ETZPC_DECPROT_LOCK1_QSPI              ETZPC_DECPROT_LOCK1_QSPI_Msk
#define ETZPC_DECPROT_LOCK1_SRAM1_Pos         (28U)
#define ETZPC_DECPROT_LOCK1_SRAM1_Msk         (0x1UL << ETZPC_DECPROT_LOCK1_SRAM1_Pos) /*!< Define security for SRAM1 */
#define ETZPC_DECPROT_LOCK1_SRAM1             ETZPC_DECPROT_LOCK1_SRAM1_Msk
#define ETZPC_DECPROT_LOCK1_SRAM2_Pos         (29U)
#define ETZPC_DECPROT_LOCK1_SRAM2_Msk         (0x1UL << ETZPC_DECPROT_LOCK1_SRAM2_Pos) /*!< Define security for SRAM2 */
#define ETZPC_DECPROT_LOCK1_SRAM2             ETZPC_DECPROT_LOCK1_SRAM2_Msk
#define ETZPC_DECPROT_LOCK1_SRAM3_Pos         (30U)
#define ETZPC_DECPROT_LOCK1_SRAM3_Msk         (0x1UL << ETZPC_DECPROT_LOCK1_SRAM3_Pos) /*!< Define security for SRAM3 */
#define ETZPC_DECPROT_LOCK1_SRAM3             ETZPC_DECPROT_LOCK1_SRAM3_Msk

